{
  "Bar Stools": "Viti vya Baa",
  "How many different ways can you arrange teachers and students in a row of 5 chairs such that no 2 teachers are sat next to each other?": "Je! ni njia ngapi tofauti unaweza kupanga walimu na wanafunzi katika safu ya viti 5 hivi kwamba hakuna walimu 2 wanaokalishwa karibu na kila mmoja?",
  "You could have five students sitting on the five chairs. You could have two teachers sitting on chairs number 2 and 4 and students in chairs 1, 3, and 5. Can you think of any other options? Can you think of the maximum number of teachers that could sit on the chairs? You might like to start with a smaller number of chairs and work your way up.": "Unaweza kuwa na wanafunzi watano wameketi kwenye viti vitano. Unaweza kuwa na walimu wawili wanaokaa kwenye viti namba 2 na 4 na wanafunzi kwenye viti 1, 3, na 5. Je, unaweza kufikiria chaguzi nyingine zozote? Je, unaweza kufikiria idadi ya juu zaidi ya walimu wanaoweza kukaa kwenye viti? Unaweza kupenda kuanza na idadi ndogo ya viti na uongeze njia yako.",
  "Think of chairs as having a teacher (x) or a student (o).": "Fikiria viti kuwa na mwalimu (x) au mwanafunzi (o).",
  "For 5 chairs we can have": "Kwa viti 5 tunaweza kuwa na",
  "ooooo, xoooo, oxooo, ooxoo, oooxo, oooox, xoxoo, xooxo, xooox, oxoxo, oxoox, ooxox, xoxox": "ooooo, xoooo, oxooo, ooxoo, oooxo, oooox, xoxoo, xooxo, xooox, oxoxo, oxoox, ooxox, xoxox",
  "Total = 13": "Jumla = 13",
  "There is a way we can build up to this solution by thinking about the answer if there was 1 chair, 2 chairs, 3 chairs etc.": "Kuna njia tunaweza kujenga suluhisho hili kwa kufikiria jibu ikiwa kungekuwa na kiti 1, viti 2, viti 3 n.k.",
  "1 chair has 2 options: x , o": "Kiti 1 kina chaguzi 2: x , o",
  "2 chairs has 3 options: ox, oo, xo": "Viti 2 vina chaguzi 3: ng'ombe, oo, xo",
  "3 chairs has 5 options: oox, ooo, oxo, xox, xoo": "Viti 3 vina chaguzi 5: oox, ooo, oxo, xox, xoo",
  "Each time you add a chair you can generate the new options by simply adding a student to the start of all the previous options. You can also add a teacher and then a student to all of the options from two chairs ago. Let's see this with 4 chairs:": "Kila wakati unapoongeza kiti unaweza kuzalisha chaguo mpya kwa kuongeza tu mwanafunzi mwanzoni mwa chaguo zote za awali. Unaweza pia kuongeza mwalimu na kisha mwanafunzi kwa chaguzi zote kutoka viti viwili vilivyopita. Wacha tuone hii na viti 4:",
  "Add o onto all the 3 chair options gives:": "Ongeza o kwenye chaguzi zote 3 za viti hutoa:",
  "ooox, oooo, ooxo, oxox, oxoo": "ooox, oooo, ooxo, oxox, oxoo",
  "And adding xo onto all the 2 chair options gives:": "Na kuongeza xo kwenye chaguzi zote 2 za viti hutoa:",
  "xoox, xooo, xoxo": "xoox, xooo, xoxo",
  "This gives 5 + 3 = 8 options in total.": "Hii inatoa chaguzi 5 + 3 = 8 kwa jumla.",
  "For the 5 chairs we can add o onto all the 4 chairs options and and xo onto all the 3 chair options which gives 8 + 5 = 13 as before.": "Kwa viti 5 tunaweza kuongeza o kwenye chaguzi zote 4 za viti na na xo kwenye chaguzi zote 3 za viti ambavyo vinatoa 8 + 5 = 13 kama hapo awali.",
  "The sequence of numbers in this puzzle are part of the Fibonacci Sequence sequence:": "Mlolongo wa nambari katika fumbo hili ni sehemu ya mfuatano wa Fibonacci:",
  "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... It is easy to find the next number by adding the previous two numbers, but you can also find the nᵗʰ Fibonacci number in the sequence directly using this formula:": "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... Ni rahisi kupata nambari inayofuata kwa kuongeza nambari mbili zilizotangulia, lakini pia unaweza kupata nambari ya nᵗʰ Fibonacci katika mlolongo. moja kwa moja kwa kutumia formula hii:",
  "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )": "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )",
  "How many different ways can you arrange teachers and students in a row of 10 chairs such that no 2 teachers are sat next to each other?": "Je! ni njia ngapi tofauti unaweza kupanga walimu na wanafunzi katika safu ya viti 10 hivi kwamba hakuna walimu 2 wanaokalishwa karibu na kila mmoja?",
  "Try and build up the answer from a smaller number of chairs.": "Jaribu na ujenge jibu kutoka kwa idadi ndogo ya viti.",
  "We had already found the following sequence for 1 chair, 2 chairs, 3 chairs , …": "Tayari tumepata mlolongo ufuatao wa kiti 1, viti 2, viti 3 , ...",
  "2, 3, 5, 8, 13": "2, 3, 5, 8, 13",
  "Each term in the sequence can be found by adding the two previous terms. We can carry it on:": "Kila neno katika mlolongo linaweza kupatikana kwa kuongeza maneno mawili ya awali. Tunaweza kuendelea nayo:",
  "2, 3, 5, 8, 13, 21, 34, 55, 89, 144": "2, 3, 5, 8, 13, 21, 34, 55, 89, 144",
  "So there are 144 ways to have people sitting on the 10 chairs.": "Kwa hivyo kuna njia 144 za kuwa na watu kukaa kwenye viti 10.",
  "For all the number of chairs between 1 and 30 inclusive, how many of these will have an even number of ways of sitting on them?": "Kwa idadi yote ya viti kati ya 1 na 30 zikijumlishwa, ni ngapi kati ya hizi zitakuwa na idadi sawa ya njia za kuketi juu yake?",
  "For the sequence 2,3,5,8,13, … we can see that there is a pattern even, odd, odd, even, odd odd, etc. This makes sense as even + odd = odd and odd + odd = even. So every third number in the sequence is even. We need to do 30 ∕ 3 = 10.": "Kwa mfuatano wa 2,3,5,8,13, … tunaweza kuona kwamba kuna muundo idadi sawa, isiyo ya kawaida, isiyo ya kawaida,  idadi sawa, isiyo ya kawaida, n.k. Hii inaleta maana kama idadi sawa+ isiyo ya kawaida = isiyo ya kawaida na isiyo ya kawaida + isiyo ya kawaida =idadi sawa. Kwa hivyo kila nambari ya tatu katika mlolongo ni sawa.Tunahitaji kufanya 30 ∕ 3 = 10."
}