{
  "Benford's Law": "Sheria ya Benford",
  "When you look at numbers found in real-world data sets, for most sets of numbers the first digit is more often a 1 than any other digit. 2 is a more common first digit than 3, and so on up to 9. In fact, the first digits often follow the same pattern (distribution).": "Unapotazama nambari zinazopatikana katika seti za data za ulimwengu halisi, kwa seti nyingi za nambari tarakimu ya kwanza mara nyingi ni 1 kuliko tarakimu nyingine yoyote. 2 ni tarakimu ya kwanza ya kawaida zaidi kuliko 3, na kadhalika hadi 9. Kwa kweli, tarakimu za kwanza mara nyingi hufuata muundo sawa (usambazaji).",
  "Have a look at some data sets that span many orders of magnitude. For example, what are the first digits of: the first 100 prime numbers (or more!), the populations of the countries in Africa, the heights of the tallest buildings in the world?": "Angalia seti fulani za data ambazo huchukua maagizo mengi ya ukubwa. Kwa mfano, ni tarakimu gani za kwanza za: nambari kuu 100 za kwanza (au zaidi!), idadi ya watu wa nchi barani Afrika, urefu wa majengo marefu zaidi duniani?",
  "Many data sets (for example, populations of countries, heights of buildings, stock prices) or famous sequences (Fibonacci numbers, prime numbers) are spread over very different scales (orders of magnitude). Many of these big sets of data arise from decreasing power laws. A simple example might be": "Seti nyingi za data (kwa mfano, idadi ya watu wa nchi, urefu wa majengo, bei ya hisa) au mlolongo maarufu (nambari za Fibonacci, nambari kuu) zimeenea kwenye mizani tofauti sana (maagizo ya ukubwa). Nyingi za seti hizi kubwa za data hutokana na kupungua kwa sheria za nguvu. Mfano rahisi unaweza kuwa",
  "y = k×10⁽⁻ᵃˣ⁾ where k, a > 0. Choosing a = 0.1 and k = 1000 gives the following:": "y = k×10⁽⁻ᵃˣ⁾ ambapo k, a > 0. Kuchagua a = 0.1 na k = 1000 kunatoa yafuatayo:",
  "Power laws will look like a straight line on semi-log graph paper - where the y-axis is on a log-scale paper. We can show this by rewriting our formula for the power law y = k×10⁽⁻ᵃˣ⁾ = 10ᵇ×10⁽⁻ᵃˣ⁾ = 10⁽⁻ᵃˣ⁺ᵇ⁾ , and then applying a logarithm on both sides: log₁₀(y) = - a×x + b. This is the equation when the y-axis is on a log scale. The same example is shown below:": "Sheria za nguvu zitaonekana kama mstari ulionyooka kwenye karatasi ya grafu nusu-logi - ambapo mhimili wa y uko kwenye karatasi ya mizani ya logi. Tunaweza kuonyesha hili kwa kuandika upya fomula yetu ya sheria ya nguvu y = k×10⁽⁻ᵃˣ⁾ = 10ᵇ×10⁽⁻ᵃˣ⁾ = 10⁽⁻ᵃˣ⁺ᵇ⁾ , na kisha kutumia logarithm ya pande zote mbili: log₁₀(y) = - a×x + b. Huu ndio mlinganyo wakati mhimili wa y uko kwenye kipimo cha logi. Mfano sawa unaonyeshwa hapa chini:",
  "The horizontal lines represent 1, 2, 3, 4, …, 10, 20, 30, …, 100, 200, 300, … and note they are unevenly spaced on the y axis! The largest spaces are between 1 and 2, between 10 and 20, and between 100 and 200. The smallest spaces are between 9 and 10, 90 and 100.": "Mistari ya mlalo inawakilisha 1, 2, 3, 4, …, 10, 20, 30, …, 100, 200, 300, … na kumbuka kuwa hazina nafasi kwa usawa kwenye mhimili y! Nafasi kubwa zaidi ni kati ya 1 na 2, kati ya 10 na 20, na kati ya 100 na 200. Nafasi ndogo zaidi ni kati ya 9 na 10, 90 na 100.",
  "Try picking random values of x, and reading off corresponding values of y from our (power law) straight line. Because of the spacing of the horizontal lines we see that we are most likely to get a value of y with first digit 1, then we are next likely to get a value of y with a first digit 2, etc. These probabilities are what leads to Benford's Law.": "Jaribu kuchagua thamani nasibu za x, na usome thamani zinazolingana za y kutoka kwenye mstari wetu wa moja kwa moja (sheria ya nguvu). Kwa sababu ya nafasi za mistari mlalo tunaona kwamba tuna uwezekano mkubwa wa kupata thamani ya y kwa tarakimu ya kwanza 1, basi tunaweza kupata thamani ya y kwa tarakimu ya kwanza 2, n.k. Uwezekano huu ndio unaoongoza. kwa Sheria ya Benford.",
  "Benford's Law is used in the real world to check for fraud on big data sets. If they don't follow the law when they should, it is possible they have been falsified!": "Sheria ya Benford inatumika katika ulimwengu wa kweli kuangalia ulaghai kwenye seti kubwa za data. Wasipofuata sheria inapostahili, inawezekana wameghushiwa!",
  "Can you think of which sets of numbers do not obey Benford's law?": "Je, unaweza kufikiria ni seti gani za nambari hazitii sheria ya Benford?",
  "The explanation of Benford's law mentioned that the data set typically spans many orders of magnitude.": "Ufafanuzi wa sheria ya Benford ulitaja kuwa seti ya data kawaida hujumuisha maagizo mengi ya ukubwa.",
  "Anything that is within a small range, an example would be something normally distributed E.g Measure everyone's height (in metres). Almost all heights would begin with a 1.": "Kitu chochote ambacho kiko ndani ya safu ndogo, mfano unaweza kuwa kitu kinachosambazwa kwa kawaida E.g Pima urefu wa kila mtu (katika mita). Takriban urefu wote ungeanza na 1."
}