{
  "Colouring": "Upakaji rangi",
  "How many possible three-stripe flags similar to the one below are there if only 5 colours are available and two touching stripes must NOT have the same colour.": "Ni bendera ngapi zinazowezekana za milia mitatu zinazofanana na iliyo hapa chini ikiwa ni rangi 5 pekee zinapatikana na mistari miwili inayogusa HAIWEZI KUWA na rangi sawa.",
  "Think about how many different colours could go in the first section, then the second ...": "Fikiria ni rangi ngapi tofauti zinaweza kwenda katika sehemu ya kwanza, kisha ya pili ...",
  "There is a choice of 5 colours for the first section. Once a colour has been chosen, the second section cannot be the same. So there are only four colours to choose from for the second section. For the third section, there are four colours to choose from, as it cannot be the same colour as the second one yet it can be the same colour as the first one. Thus, the number of tricolour flags with 5 colours to choose from are 5×4×4 = 80.": "Kuna chaguo la rangi 5 kwa sehemu ya kwanza. Mara tu rangi imechaguliwa, sehemu ya pili haiwezi kuwa sawa. Kwa hivyo kuna rangi nne tu za kuchagua kutoka kwa sehemu ya pili. Kwa sehemu ya tatu, kuna rangi nne za kuchagua, kwani haiwezi kuwa na rangi sawa na ya pili lakini inaweza kuwa rangi sawa na ya kwanza. Kwa hivyo, idadi ya bendera za tricolor zilizo na rangi 5 za kuchagua ni 5×4×4 = 80.",
  "In a room with an even number of walls, two colors are always enough. For rooms with an odd number of walls, you will need three colors.": "Katika chumba kilicho na idadi hata ya kuta, rangi mbili zinatosha kila wakati. Kwa vyumba vilivyo na idadi isiyo ya kawaida ya kuta, utahitaji rangi tatu.",
  "In how many different ways can I paint the five walls of a pentagonal room using red, blue and green paint so that no two neighbouring walls are the same colour?": "Je! ni kwa njia ngapi tofauti ninaweza kuchora kuta tano za chumba cha pentagonal kwa kutumia rangi nyekundu, bluu na kijani ili hakuna kuta mbili za jirani zinazofanana?",
  "Fix one colour, say start with the top wall red, and try to list all the different options for the other walls.": "Rekebisha rangi moja, sema anza na ukuta wa juu nyekundu, na ujaribu kuorodhesha chaguzi zote tofauti za kuta zingine.",
  "First of all you start with either red, blue or green and use one of the other colours for the second side and so on around the pentagon. When you get to the last side it cannot be the same as the fourth side or the first one.": "Kwanza kabisa unaanza na nyekundu, bluu au kijani na kutumia moja ya rangi nyingine kwa upande wa pili na kadhalika karibu na pentagon. Unapofika upande wa mwisho hauwezi kuwa sawa na upande wa nne au wa kwanza.",
  "We can represent the choices of colours in a tree diagram, At the top (known as the root of the tree) we paint the first side. Here we choose red). The first split is the choice of either green or blue for the second side. The next split is the choice for the third side which depends on your choice of the second side. Any path from the root to end of the tree (known as a leaf) gives you a choice for all of the five edges. We see if we started with red, we have 10 different colourings.": "Tunaweza kuwakilisha uchaguzi wa rangi kwenye mchoro wa mti, Juu (inayojulikana kama mzizi wa mti) tunapaka upande wa kwanza. Hapa tunachagua nyekundu). Mgawanyiko wa kwanza ni chaguo la kijani au bluu kwa upande wa pili. Mgawanyiko unaofuata ni chaguo kwa upande wa tatu ambao unategemea uchaguzi wako wa upande wa pili. Njia yoyote kutoka kwenye mzizi hadi mwisho wa mti (inayojulikana kama jani) inakupa chaguo kwa kingo zote tano. Tunaona ikiwa tulianza na nyekundu, tuna rangi 10 tofauti.",
  "As we can make similar diagrams if we had chosen green or blue in the first position, we have a total of 3×10 = 30 different colourings.": "Tunapoweza kutengeneza michoro sawa kama tungechagua kijani au bluu katika nafasi ya kwanza, tuna jumla ya 3×10 = 30 rangi tofauti."
}