{
  "Dealing Cards": "Kadi za Kushughulikia",
  "Children are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, and a Queen to every third child.": "Watoto wameketi kwenye mduara, na mwalimu anatembea karibu na mduara, akishughulikia kadi. Mwalimu anatoa Jack kwa kila mtoto wa pili, na Malkia kwa kila mtoto wa tatu.",
  "After going around four times, the sixth child in the circle from where the teacher started has two Jacks and two Queens.": "Baada ya kuzunguka mara nne, mtoto wa sita kwenye duara kutoka ambapo mwalimu alianza ana Jacks mbili na Queens mbili.",
  "What is the smallest possible number of children in the circle?": "Ni idadi gani ndogo zaidi ya watoto kwenye duara?",
  "Must there be an even or an odd number of children in the circle?": "Je, lazima kuwe na idadi sawa au isiyo ya kawaida ya watoto kwenye mduara?",
  "The teacher goes round the circle four times. If there was an even number of children, the sixth child would always receive a Jack each time and would have four Jacks by the end. Since they only have two Jacks, there must be an odd number of children in the circle.": "Mwalimu anazunguka duara mara nne. Ikiwa kulikuwa na idadi sawa ya watoto, mtoto wa sita angepokea Jack kila wakati na angekuwa na Jacks nne hadi mwisho. Kwa kuwa wana Jack mbili pekee, lazima kuwe na idadi isiyo ya kawaida ya watoto kwenye duara.",
  "The sixth child receives a Queen in the first round because 6 is a multiple of 3. She only receives one more Queen so the answer can't be a multiple of 3.": "Mtoto wa sita anapokea Malkia katika raundi ya kwanza kwa sababu 6 ni kizidishio cha 3. Anapokea tu Malkia mmoja zaidi kwa hivyo jibu haliwezi kuwa nyingi ya 3.",
  "The options are 7, 11, 13, 17, 19 … and so 7 is the fewest number of children.": "Chaguo ni 7, 11, 13, 17, 19 ... na kwa hivyo 7 ndio idadi ndogo zaidi ya watoto.",
  "This puzzle was written by a student at the Lycee Francais Charles de Gaulle for a Christmas puzzle involving handing out red and blue presents.": "Kitendawili hiki kiliandikwa na mwanafunzi wa Lycee Francais Charles de Gaulle kwa fumbo la Krismasi linalohusisha kupeana zawadi nyekundu na bluu.",
  "Children are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, a Queen to every third child and a King to every fifth child.": "Watoto wameketi kwenye mduara, na mwalimu anatembea karibu na mduara, akishughulikia kadi. Mwalimu anatoa Jack kwa kila mtoto wa pili, Malkia kwa kila mtoto wa tatu na Mfalme kwa kila mtoto wa tano.",
  "After going around four times, the sixth child from where the teacher started has four Jacks, two Queens and no Kings.": "Baada ya kuzunguka mara nne, mtoto wa sita kutoka alipoanzia mwalimu ana Jacks wanne, Queens wawili na hakuna Kings.",
  "What is the fewest amount of children could there be?": "Je, ni watoto wachache zaidi wanaweza kuwapo?",
  "Think about whether the number needs to be odd or even and if it needs to be divisible by 3 or 5.": "Fikiria ikiwa nambari inahitaji kuwa isiyo ya kawaida au hata na ikiwa inahitaji kugawanywa na 3 au 5.",
  "The child receives four Jacks so there must be an even number of children, but only receives two queens so the number of children cannot be a multiple of 3. As the child receives no Kings, 6 and 10 would both be options (try these out with cards or with pen and paper to check). But 6 is a multiple of 3 so the answer must be 10.": "Mtoto hupokea Jack nne kwa hivyo lazima kuwe na idadi sawa ya watoto, lakini hupokea malkia wawili pekee ili idadi ya watoto isiweze kuwa nyingi ya 3. Kwa kuwa mtoto hapati Wafalme, 6 na 10 zote zitakuwa chaguzi (jaribu hizi. na kadi au kwa kalamu na karatasi kuangalia). Lakini 6 ni kizidisho cha 3 kwa hivyo jibu lazima liwe 10.",
  "1000 students are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, and a Queen to every third child": "Wanafunzi 1000 wameketi kwenye duara, na mwalimu anatembea kuzunguka mduara, akishughulikia kadi. Mwalimu anatoa Jack kwa kila mtoto wa pili, na Malkia kwa kila mtoto wa tatu",
  "After the teacher goes around 1000 times, how many cards in total will the sixth child have?": "Baada ya mwalimu kuzunguka mara 1000, mtoto wa sita atakuwa na kadi ngapi kwa jumla?",
  "There are an even number of children so the sixth child will always be in a position on each turn to receive a Jack. So she will have 1000 cards from that rule. For the Queens in the first round the students to receive one will be in position 3, 6, 9, 12, 15, ..., 999, then it will be 2, 5, 8, ..., 998 and then 1,4,7, ..., 997, 1000, and back to 3, 6, 9, ..., 999.  So every third time she will get a Queen. Because 1000 ∕ 3 is 333 with a remainder of 1, she will get one on the 1000ᵗʰ turn too. So 1000 + 334 = 1334 is the total number of cards.": "Kuna idadi sawa ya watoto kwa hivyo mtoto wa sita atakuwa katika nafasi kila wakati kupokea Jack. Kwa hivyo atakuwa na kadi 1000 kutoka kwa sheria hiyo. Kwa Queens katika awamu ya kwanza wanafunzi watakaopokea mmoja watakuwa kwenye nafasi ya 3, 6, 9, 12, 15, ..., 999, kisha itakuwa 2, 5, 8, ..., 998 na kisha 1. ,4,7, ..., 997, 1000, na kurudi 3, 6, 9, ..., 999. Kwa hiyo kila mara ya tatu atapata Malkia. Kwa sababu 1000 ∕ 3 ni 333 na salio ya 1, atapata moja kwenye zamu ya 1000ᵗʰ pia. Hivyo 1000 + 334 = 1334 ni jumla ya idadi ya kadi."
}