{
  "Different Paths": "Njia Tofauti",
  "There are 5 different paths you could take to get from home to school. In a week (from Monday to Friday) you would like to try a different path every day. In how many different ways can you organise your walk to school for the week?": "Kuna njia 5 tofauti unazoweza kuchukua kutoka nyumbani hadi shule. Katika wiki (kutoka Jumatatu hadi Ijumaa) ungependa kujaribu njia tofauti kila siku. Je, ni kwa njia ngapi tofauti unaweza kupanga matembezi yako kwenda shuleni kwa wiki?",
  "Think about how many options you have to select the first path, then how many you have for the second and so on. Be careful that you can not choose the same path twice in a week.": "Fikiria juu ya chaguo ngapi unapaswa kuchagua njia ya kwanza, basi ni ngapi unayo kwa pili na kadhalika. Jihadharini kwamba huwezi kuchagua njia sawa mara mbili kwa wiki.",
  "You have 5 possible days of the week and you would like to have one different path per day. ON the first day you have a choice of 5 paths. On the second day, you only have 4 paths left to choose from because you can't take the one you took on Monday. On the third day you have 3 to choose from and so on. The solution is therefore 5×4×3×2×1 =120. This is counting how many ways you can order 5 objects (paths) in 5 positions (days of the week). This is a problem on <em>permutations</em> (without repetition).": "Una siku 5 zinazowezekana za wiki na ungependa kuwa na njia moja tofauti kwa siku. KATIKA siku ya kwanza una chaguo la njia 5. Siku ya pili, umebakiwa na njia 4 pekee za kuchagua kwa sababu huwezi kuchukua uliyotumia Jumatatu. Siku ya tatu una 3 kuchagua na kadhalika. Kwa hiyo suluhisho ni 5×4×3×2×1 =120. Hii ni kuhesabu ni njia ngapi unaweza kuagiza vitu 5 (njia) katika nafasi 5 (siku za wiki). Hili ni tatizo kwenye <em>vibali</em> (bila kurudia).",
  "The mathematical symbol ! is called <em>factorial</em> and represents multiplying by decreasing integers until you reach 1. So 5×4×3×2×1 can be written as 5!": "Alama ya hisabati! inaitwa <em>factorial</em> na inawakilisha kuzidisha kwa kupunguza nambari kamili hadi kufikia 1. Kwa hivyo 5×4×3×2×1 inaweza kuandikwa kama 5!",
  "Factorials were used to count permutations at least as early as the 12th century, by Indian scholars. The notation n! was introduced by the French mathematician Christian Kramp in 1808.": "Vifaa vilitumiwa kuhesabu vibali angalau mapema kama karne ya 12, na wasomi wa Kihindi. Nukuu n! ilianzishwa na mwanahisabati Mfaransa Christian Kramp mnamo 1808.",
  "Factorials get big very quickly. 5! = 120, but 20! = 2432902008176640000.": "Viwanda vinakua haraka sana. 5! = 120, lakini 20! = 2432902008176640000.",
  "What if you had to go to school on Saturdays as well and you also found a new path? In how many ways can you arrange your week such that every day you go to school walking on different paths?": "Je, ikiwa itabidi uende shuleni siku za Jumamosi pia na pia ukapata njia mpya? Je, unaweza kupanga wiki yako kwa njia ngapi ili kila siku uende shule ukitembea kwenye njia tofauti?",
  "Is there a way to use the result of the previous problem? Think about how many ways you can now walk to school on Monday.": "Kuna njia ya kutumia matokeo ya shida iliyotangulia? Fikiria ni njia ngapi sasa unaweza kutembea kwenda shuleni Jumatatu.",
  "You have now 6 possible days of the week and 6 different paths. You would like to have one different path per day. The solution is obtained by counting how many ways you can order 6 objects (paths) in 6 positions (days of the week). The solution is obtained as 6×5×4×3×2×1 = 120  Notice this is 6×120 (6 times the previous solution). You have just discovered a recursive property of factorials: n! = n×(n - 1)!.": "Sasa una siku 6 zinazowezekana za wiki na njia 6 tofauti. Ungependa kuwa na njia moja tofauti kwa siku. Suluhisho linapatikana kwa kuhesabu njia ngapi unaweza kuagiza vitu 6 (njia) katika nafasi 6 (siku za wiki). Suluhisho linapatikana kama 6×5×4×3×2×1 = 120 Ona hii ni 6×120 (mara 6 ya ufumbuzi uliopita). Umegundua tu mali ya kujirudia ya factorials: n! = n×(n - 1)!.",
  "What if you had to go to school on Sundays as well and you also found four new paths so there are now 10 paths to choose from? In how many ways can you arrange your week such that every day you go to school walking on different paths?": "Je, ikiwa ulipaswa kwenda shuleni Jumapili pia na pia ukapata njia nne mpya kwa hivyo sasa kuna njia 10 za kuchagua? Je, unaweza kupanga wiki yako kwa njia ngapi ili kila siku uende shule ukitembea kwenye njia tofauti?",
  "You have now 7 possible days of the week and 10 different paths. You would like to have one different path per day. The solution is obtained by counting how many ways you can order 10 objects (paths) in 7 positions (days of the week). The solution is obtained by 10×9×8×7×6×5×4 =  604800. If you wanted to calculate this using factorials, 10! is close to the answer, but we don't want 3×2×1 at the end. 3×2×1 is 3! so we can do 10! ∕ 3! =604800.": "Sasa una siku 7 zinazowezekana za wiki na njia 10 tofauti. Ungependa kuwa na njia moja tofauti kwa siku. Suluhisho linapatikana kwa kuhesabu njia ngapi unaweza kuagiza vitu 10 (njia) katika nafasi 7 (siku za wiki). Suluhisho linapatikana kwa 10×9×8×7×6×5×4 = 604800. Ikiwa ungependa kuhesabu hii kwa kutumia factorials, 10! iko karibu na jibu, lakini hatutaki 3×2×1 mwishoni. 3×2×1 ni 3! kwa hivyo tunaweza kufanya 10! ∕ 3! =604800."
}