{
  "Going to School": "Kwenda Shule",
  "Start from home (H) and go to school (S). You can walk along the 2 by 5 grid by making steps only towards east or north. How many different paths can you take to reach your school?": "Anza kutoka nyumbani (H) na uende shule (S). Unaweza kutembea kwenye gridi ya 2 kwa 5 kwa kupiga hatua kuelekea mashariki au kaskazini pekee. Je! ni njia ngapi tofauti unaweza kuchukua ili kufikia shule yako?",
  "What is the total number of steps you have to make? Think about when you could make the two steps north.\nYou could first try to find the answer if the grid was 2 by 3 and 2 by 4.": "Je, ni idadi gani ya jumla ya hatua unazopaswa kufanya? Fikiria ni lini unaweza kupiga hatua mbili kaskazini.\nUnaweza kujaribu kwanza kupata jibu ikiwa gridi ya taifa ilikuwa 2 kwa 3 na 2 kwa 4.",
  "First of all, we can realise that, in order to get to school, you need to do a total of 2 steps north and 5 steps east. If we think about the sequence of 2 + 5 = 7 steps (S1, S2, S3, S4, S5, S6, and S7), then the problem is equivalent to counting how many ways you select 2 objects (the positions of the two steps towards north) from a total of 7 objects (the total number of positions of the steps). There are 7 possibilities to select the position for the first step towards north; then there are 7 - 1 = 6 possibilities to select the position of the second step towards north (\"-1\" because one position has already been selected), therefore you get 6×7 = 42. However, the order in which you selected the 2 positions of the steps towards north does not matter: you need to divide by 2, to give the final answer of 21.": "Kwanza kabisa, tunaweza kutambua kwamba, ili kupata shule, unahitaji kufanya jumla ya hatua 2 kaskazini na hatua 5 mashariki. Ikiwa tunafikiria juu ya mlolongo wa 2 + 5 = hatua 7 (S1, S2, S3, S4, S5, S6, na S7), basi shida ni sawa na kuhesabu ni njia ngapi unachagua vitu 2 (nafasi za hizo mbili. hatua kuelekea kaskazini) kutoka kwa jumla ya vitu 7 (jumla ya idadi ya nafasi za hatua). Kuna uwezekano 7 wa kuchagua nafasi kwa hatua ya kwanza kuelekea kaskazini; basi kuna 7 - 1 = 6 uwezekano wa kuchagua nafasi ya hatua ya pili kuelekea kaskazini (\"-1\" kwa sababu nafasi moja tayari imechaguliwa), kwa hiyo unapata 6×7 = 42. Hata hivyo, utaratibu ambao umechagua nafasi 2 za hatua kuelekea kaskazini haijalishi: unahitaji kugawanya na 2, kutoa jibu la mwisho la 21.",
  "Alternatively, we could look at smaller examples first.": "Vinginevyo, tunaweza kuangalia mifano ndogo kwanza.",
  "Let N be one step north and E be one step east.": "Acha N iwe hatua moja kaskazini na E iwe hatua moja mashariki.",
  "For a 2 by 2 grid we could have NNEE, NENE, NEEN, ENNE, ENEN, EENN  (6 ways)": "Kwa gridi ya 2 kwa 2 tunaweza kuwa na NNEE, NENE, NEEN, ENNE, ENEN, EENN (njia 6)",
  "For a 2 by 3 grid we need an extra move east. We could add an E onto all the options above. We would then just be missing all the routes that had N as the last move. There are 4 of these, corresponding to the other N in each one of the first four positions.": "Kwa gridi ya 2 kwa 3 tunahitaji hoja ya ziada ya mashariki. Tunaweza kuongeza E kwenye chaguzi zote hapo juu. Basi tungekuwa tunakosa njia zote ambazo zilikuwa na N kama hatua ya mwisho. Kuna 4 kati ya hizi, zinazolingana na N nyingine katika kila moja ya nafasi nne za kwanza.",
  "NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (6 ways) plus NEEEN, ENEEN, EENEN, EEENN (4 ways) = 10 ways": "NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (Njia 6) pamoja na NEEEN, ENEEN, EENEN, EEENN (njia 4) = njia 10",
  "For a 2 by 4 grid there are 10 + 5 = 15 ways": "Kwa gridi ya 2 kwa 4 kuna 10 + 5 = 15 njia",
  "For a 2 by 5 grid there are 15 + 6 = 21 ways": "Kwa gridi ya 2 kwa 5 kuna 15 + 6 = 21 njia",
  "In general, by counting from small examples, we can see that each time you increase by one the number n of total steps (while keeping the number of steps towards north to 2), the number of ways you can go to school increases by n - 1. This is because you have already counted the ways the steps towards north can be in all the previous positions from 1 to n - 1. Therefore you just need to add the possibility that the two steps towards north are in the position n and any other of the n - 1 remaining ones.": "Kwa ujumla, kwa kuhesabu kutoka kwa mifano ndogo, tunaweza kuona kwamba kila wakati unapoongeza kwa moja nambari n ya hatua zote (huku ukiweka idadi ya hatua kuelekea kaskazini hadi 2), idadi ya njia unazoweza kwenda shule huongezeka kwa n. - 1. Hii ni kwa sababu tayari umehesabu njia ambazo hatua kuelekea kaskazini zinaweza kuwa katika nafasi zote za awali kutoka 1 hadi n - 1. Kwa hiyo unahitaji tu kuongeza uwezekano kwamba hatua mbili kuelekea kaskazini ziko katika nafasi n na. nyingine yoyote ya n - 1 iliyobaki.",
  "This puzzle is all about finding the number of ways of choosing r items from a choice of n items when the order doesn't matter. The mathematical word for this is <strong>combinations</strong>, and there is a formula for finding them: ⁿCᵣ = n! ∕ (r!×(n - r)!)": "Kitendawili hiki kinahusu kutafuta idadi ya njia za kuchagua vitu r kutoka kwa chaguo la vitu n wakati mpangilio haujalishi. Neno la hisabati kwa hili ni<strong>michanganyiko</strong>, na kuna fomula ya kuzipata: ⁿCᵣ = n! ∕ (r!×(n - r)!)",
  "In this formula n! = n×(n - 1)×(n - 2)×...×1.": "Katika fomula hii n! = n×(n - 1)×(n - 2)×...×1.",
  "In how many ways could you reach your school if it were further away in the top right of a 2 by 10 grid?": "Je, ungeweza kufika shuleni kwa njia ngapi ikiwa iko mbali zaidi katika sehemu ya juu ya kulia ya gridi ya 2 kwa 10?",
  "Think about the strategy you used to answer the previous question and try to generalise in the case the school is in the top right (north-east) of a 2 by n grid.": "Fikiria kuhusu mkakati uliotumia kujibu swali lililotangulia na ujaribu kujumlisha ikiwa shule iko juu kulia (kaskazini-mashariki) mwa gridi ya 2 kwa n.",
  "You can come up with a formula generalising the reasoning in the previous part: there are n+2 possibilities to select the position for the first step towards north; then there are n+1 possibilities to select the position of the second step towards north (1 less because one position has already been selected), therefore you get (n + 2)×(n + 1). However, the order in which you selected the 2 positions of the steps towards north does not matter: you then need to divide by 2.": "Unaweza kuja na fomula inayojumuisha hoja katika sehemu iliyotangulia: kuna uwezekano n+2 wa kuchagua nafasi kwa hatua ya kwanza kuelekea kaskazini; basi kuna n+1 uwezekano wa kuchagua nafasi ya hatua ya pili kuelekea kaskazini (1 chini kwa sababu nafasi moja tayari imechaguliwa), kwa hivyo unapata (n + 2)×(n + 1). Walakini, mpangilio ambao umechagua nafasi 2 za hatua kuelekea kaskazini haijalishi: basi unahitaji kugawanya na 2.",
  "Alternatively, generalising what you found earlier, you might come up with the rule that for a 2×n grid you have 1 + 2 + ... + (n + 1) possible paths to school. There is a quick way of adding these numbers together - it is (n + 1)×(n + 2) ∕ 2.": "Vinginevyo, kwa kujumlisha kile ulichopata hapo awali, unaweza kuja na sheria kwamba kwa gridi ya 2×n una 1 + 2 + ... + (n + 1) njia zinazowezekana za shule. Kuna njia ya haraka ya kuongeza nambari hizi pamoja - ni (n + 1)×(n + 2) ∕ 2.",
  "So we can calculate the answer for a 2 by 10 grid by doing 12×11 ∕ 2 = 66.": "Kwa hivyo tunaweza kuhesabu jibu la gridi ya 2 kwa 10 kwa kufanya 12×11 ∕ 2 = 66.",
  "In how many ways could you reach your school if it were in the top right of a 4 by 5 grid?": "Je, ungeweza kufika shuleni kwa njia ngapi kama ingekuwa katika sehemu ya juu ya kulia ya gridi ya 4 kwa 5?",
  "We need to take four steps north and 5 steps east. One way to do this would be in the sequence NNNNEEEEE. We need to find all the different ways. Consider the position of the four steps north. Let's call them N₁, N₂, N₃, and N₄. N₁ could be in any one of 9 positions, then N₂ could go in any of the 8 that are left, then N₃ is one of the remaining 7 and finally N₄ in one of the remaining 6. This would give us 9×8×7×6 = 3024 ways. But we actually don't want to distinguish between the four north steps. N₁N₂N₃N₄EEEEE is the same as N₂N₁N₃N₄EEEEE for example. So the 126 has included all the different ways the N₁ up to N₄ could be arranged. We now need to work out how many ways this is. The N₁ could be in one of four positions, the N₂ then in one of three, the N₃ in one of two and the N₄ in the one left. This gives us 4×3×2×1 = 24 ways. So we overcounted by a factor of 24. The final answer is 3024 ∕ 24 = 126.": "Tunahitaji kuchukua hatua nne kaskazini na hatua 5 mashariki. Njia moja ya kufanya hivyo itakuwa katika mlolongo NNNNEEEEE. Tunahitaji kutafuta njia zote tofauti. Fikiria nafasi ya hatua nne za kaskazini. Hebu tuziite N₁, N₂, N₃, na N₄. N₁ inaweza kuwa katika nafasi yoyote kati ya 9, kisha N₂ inaweza kwenda katika yoyote kati ya 8 zilizosalia, kisha N₃ ni mojawapo ya 7 iliyobaki na hatimaye N₄ katika mojawapo ya 6 iliyobaki. Hii ingetupa 9×8×7 × 6 = 3024 njia. Lakini kwa kweli hatutaki kutofautisha kati ya hatua nne za kaskazini. N₁N₂N₃N₄EEEEE ni sawa na N₂N₁N₃N₄EEEEE kwa mfano. Kwa hivyo 126 imejumuisha njia zote tofauti N₁ hadi N₄ inaweza kupangwa. Tunahitaji sasa kujua ni njia ngapi hii ni. N₁ inaweza kuwa katika moja ya nafasi nne, N₂ kisha katika moja ya tatu, N₃ katika moja ya mbili na N₄ katika moja kushoto. Hii inatupa 4×3×2×1 = njia 24. Kwa hivyo tulizidisha kwa kipengele cha 24. Jibu la mwisho ni 3024 ∕ 24 = 126."
}