{
  "Honey Bees": "Nyuki wa Asali",
  "One gallon of honey provides fuel for one bee to fly for seven million miles.": "Galoni moja ya asali hutoa mafuta kwa nyuki mmoja kuruka maili milioni saba.",
  "How many bees could fly one thousand miles if they had ten gallons of honey?": "Ni nyuki wangapi wangeweza kuruka maili elfu moja ikiwa wangekuwa na galoni kumi za asali?",
  "How far can one bee travel with ten gallons of honey?": "Nyuki mmoja anaweza kusafiri umbali gani akiwa na galoni kumi za asali?",
  "10 gallons would allow one bee to travel for 70 million miles. 70000000 ∕ 1000 = 70000 so 70000 bees could travel 1000 miles each.": "Galoni 10 zingeruhusu nyuki mmoja kusafiri kwa maili milioni 70. 70000000 ∕ 1000 = 70000 ili nyuki 70000 waweze kusafiri maili 1000 kila mmoja.",
  "Problems such as \"If A people can dig a trench in B<strong> </strong>days, then how long will it take C<strong> </strong>people to dig the trench?\" can be solved by calculating (A×B  ∕ C). This ancient technique is called \"the rule of three\" and was written about in a nursery rhyme in 1570: <strong> \"</strong>Multiplication is vexation;": "Matatizo kama vile \"Ikiwa watu wanaweza kuchimba mtaro katika B<strong> </strong>siku, basi itachukua muda gani C<strong> </strong>watu kuchimba mtaro huo?\" inaweza kutatuliwa kwa kuhesabu (A×B ∕ C). Mbinu hii ya kale inaitwa \"kanuni ya tatu\" na iliandikwa juu ya wimbo wa kitalu mwaka wa 1570: <strong> \"</strong>Kuzidisha ni hasira;",
  "Division is as bad; The Rule of Three doth puzzle me, And Practice drives me mad.\"": "Mgawanyiko ni mbaya; Kanuni ya Tatu inanishangaza, Na Mazoezi yananitia wazimu.\"",
  "Now suppose 4 bees can each travel 6 million miles on 2 gallons of honey. How far could 8 bees each travel with 6 gallons of honey?": "Sasa tuseme nyuki 4 kila mmoja anaweza kusafiri maili milioni 6 kwa galoni 2 za asali. Nyuki 8 wangeweza kusafiri umbali gani kila mmoja na galoni 6 za asali?",
  "How far can one bee can travel on 1 gallon of honey?": "Je! Nyuki mmoja anaweza kusafiri umbali gani kwa galoni 1 ya asali?",
  "½×6000000×4 = 12000000. This is the number of miles one bee can travel on 1 gallon of honey. To find the answer, you can multiply this by 6 to find the total number of miles one bee can travel on 6 gallons of honey and then divide by 8 to find the distance per bee. The answer is 12000000×6 ∕ 8 = 9000000.": "½×6000000×4 = 12000000. Hii ni idadi ya maili nyuki mmoja anaweza kusafiri kwa galoni 1 ya asali. Ili kupata jibu, unaweza kuzidisha hili kwa 6 ili kupata jumla ya idadi ya maili nyuki mmoja anaweza kusafiri kwa galoni 6 za asali na kisha kugawanya na 8 ili kupata umbali kwa kila nyuki. Jibu ni 12000000×6 ∕ 8 = 9000000.",
  "A worker bee can make a hive of hexagons in 60 minutes, and a queen bee can make the same size hive in 40 minutes. How many minutes will it take them if they do it together?": "Nyuki kibarua anaweza kutengeneza mzinga wa hexagoni kwa dakika 60, na malkia wa nyuki anaweza kutengeneza mzinga wa ukubwa sawa kwa dakika 40. Je, itawachukua dakika ngapi wakifanya pamoja?",
  "We can see this with an example with the number of hexagons in the hive. If there are 120 hexagons, then the worker bee makes 2 per minute and the queen bee makes 3 per minute. So together they make 5 per minute. 120 ∕ 5 = 24 .": "Tunaweza kuona hili kwa mfano na idadi ya hexagoni kwenye mzinga. Ikiwa kuna hexagoni 120, basi nyuki mfanyakazi hufanya 2 kwa dakika na malkia wa nyuki hufanya 3 kwa dakika. Kwa hivyo pamoja wanafanya 5 kwa dakika. 120 ∕ 5 = 24 .",
  "The same argument works for any number of hexagons in a hive. Take the total number of hexagons as h. The worker bee will be working at a rate of (h  ∕ 60) hexagons per minute, and the queen bee at a rate of (h  ∕ 40) per minute. By simply adding the rates together,": "Hoja hiyo hiyo inafanya kazi kwa idadi yoyote ya hexagoni kwenye mzinga. Chukua jumla ya idadi ya heksagoni kama h. Nyuki mfanyakazi atakuwa akifanya kazi kwa kasi ya (h ∕ 60) hexagoni kwa dakika, na malkia wa nyuki kwa kiwango cha (h ∕ 40) kwa dakika. Kwa kuongeza viwango pamoja,",
  "(h  ∕ 60) + (h  ∕ 40) = 100×h  ∕ 2400 = h ∕ 24, we can find the answer, 24 minutes.": "(h ∕ 60) + (h ∕ 40) = 100×h ∕ 2400 = h ∕ 24, tunaweza kupata jibu, dakika 24."
}