{
  "Knockdown": "Mgongano",
  "Pegs numbered 1 to 50 are placed in order in a line, with number 1 on the left.": "Vigingi vilivyo na nambari 1 hadi 50 vimewekwa kwa mpangilio, na nambari 1 upande wa kushoto.",
  "They are then knocked over, one at a time, following these two rules:": "Kisha hupinduliwa, moja baada ya nyingine, kwa kufuata sheria hizi mbili:",
  "(1.) Starting with the first standing peg on the left, alternate pegs are knocked down, until the end of the row is reached.": "(1.) Kuanzia na kigingi cha kwanza kilichosimama upande wa kushoto, vigingi mbadala vinaangushwa chini, hadi mwisho wa safu kufikiwa.",
  "(2.) Each time the end of the row is reached, repeat the previous rule.": "(2.) Kila wakati mwisho wa safu unafikiwa, rudia sheria iliyopita.",
  "What is the number of the last peg to be knocked down?": "Ni nambari gani ya kigingi cha mwisho kuangushwa?",
  "What happens if you only had 5 pegs? What about 10 or 20? Can you spot the pattern?": "Nini kitatokea ikiwa ulikuwa na vigingi 5 tu? Vipi kuhusu 10 au 20? Je, unaweza kuona muundo?",
  "Start: 1 2 3 4 5 6 7 8 9 ...": "Anza: 1 2 3 4 5 6 7 8 9 ...",
  "First round:  ✕ 2 ✕ 4 ✕ 6 ✕ 8 ✕  ... only even numbers left": "Raundi ya kwanza: ✕ 2 ✕ 4 ✕ 6 ✕ 8 ✕ ... zimesalia nambari hata",
  "Second round: ✕ 4 ✕ 8 ✕ 12 ...  only multiples of 4 left": "Mzunguko wa pili: ✕ 4 ✕ 8 ✕ 12 ... mazidisho 4 pekee yaliyosalia",
  "Third round: ✕ 8 ✕ 16 ✕ 24  ...  only multiples of 8 left": "Raundi ya tatu: ✕ 8 ✕ 16 ✕ 24 ... mazidisho 8 pekee yaliyosalia",
  "Fourth round: Only multiples of 16 will be left": "Raundi ya nne: Vizidishi vya 16 pekee ndivyo vitasalia",
  "Fifth round: Only multiples of 32 will be left.": "Raundi ya tano: Vizidishi vya 32 pekee ndivyo vitasalia.",
  "32 is the only multiple of 32 under 50, so 32 is the last peg left.": "32 ndio kizidishio pekee cha 32 chini ya 50, kwa hivyo 32 ndio kigingi cha mwisho kilichosalia.",
  "This puzzle is actually about powers of 2 and binary numbers), and its second extension about powers of 10 and decimal numbers.": "Kitendawili hiki kwa hakika kinahusu nguvu za 2 na nambari jozi), na kiendelezi chake cha pili kuhusu nguvu za 10 na nambari za desimali.",
  "Pegs numbered 1 to 1050 are placed in order in a line, with number 1 on the left.": "Vigingi vilivyo na nambari 1 hadi 1050 vimewekwa kwa mpangilio, na nambari 1 upande wa kushoto.",
  "Can you find the closest power of 2 less than 1050?": "Je, unaweza kupata nguvu iliyo karibu zaidi ya 2 chini ya 1050?",
  "As before, after the first round we have only multiples of 2. The second leaves only multiples of 4, the pattern continues and each subsequent round leaves only multiples of 8, 16, 32, ..., 512, 1024. All of the multiples of 1024 (except 1024 itself) are bigger than 1050, which means 1024 will be the last peg left.": "Kama hapo awali, baada ya raundi ya kwanza tuna zidisha 2 pekee. Ya pili inaacha tu zidishi za 4, muundo unaendelea na kila duru inayofuata huacha tu zidishi za 8, 16, 32, ..., 512, 1024. mawimbi ya 1024 (isipokuwa 1024 yenyewe) ni kubwa kuliko 1050, ambayo inamaanisha 1024 itakuwa kigingi cha mwisho kilichosalia.",
  "Pegs numbered 1 to 10000050 are placed in order in a line, with number 1 on the left.": "Vigingi vya nambari 1 hadi 10000050 vimewekwa kwa mpangilio, na nambari 1 upande wa kushoto.",
  "(1.) Starting with the first standing peg on the left, this time <strong>9 pegs are knocked down and the tenth is left standing</strong>, until the end of the row is reached.": "(1.) Kuanzia na kigingi cha kwanza kilichosimama upande wa kushoto, safari hii<strong>vigingi 9 vinaangushwa na wa kumi huachwa vimesimama</strong>, mpaka mwisho wa safu ufikiwe.",
  "This puzzle is similar to the previous parts. In those cases, at each round we left the multiples of the increasing powers of 2. The sequence 2, 4, 8, 16,... can be written 2, 2², 2³, 2⁴,...": "Fumbo hili ni sawa na sehemu zilizopita. Katika visa hivyo, katika kila duru tuliacha vizidishio vya nguvu zinazoongezeka za 2. Mlolongo 2, 4, 8, 16,... unaweza kuandikwa 2, 2², 2³, 2⁴,...",
  "In the new puzzle we have multiples of powers of 10 left. Indeed, after the first round only multiples of 10 are left. After the second round only multiples of 100 = 10² are left, after the third round only leave multiples of 1000 = 10³, and so on. Thus 10000000 = 10⁷ will be the last peg left, as all other multiples of 10⁷ are larger than 10000050.": "Katika fumbo jipya tuna misururu ya nguvu za 10 zilizosalia. Hakika, baada ya raundi ya kwanza ni mafungu ya 10 pekee yaliyosalia. Baada ya mzunguko wa pili ni vizidishio vya 100 = 10² pekee vinavyosalia, baada ya raundi ya tatu acha tu vizidishio vya 1000 = 10³, na kadhalika. Kwa hivyo 10000000 = 10⁷ itakuwa kigingi cha mwisho kilichosalia, kwani vizidishi vingine vyote vya 10⁷ ni kubwa kuliko 10000050."
}