{
  "Lost cards": "Kadi zilizopotea",
  "A small number of cards has been lost from a complete pack of 52. I deal cards to players until all have the same number of cards and some cards are left. If I deal to four players, three cards remain. If I deal to three players, two cards remain and if I deal to five players, two cards remain. How many cards are there?": "Idadi ndogo ya kadi imepotea kutoka kwa pakiti kamili ya 52. Ninauza kadi kwa wachezaji hadi wote wawe na idadi sawa ya kadi na kadi zingine ziachwe. Nikishughulika na wachezaji wanne, kadi tatu zinabaki. Nikishughulika na wachezaji watatu, kadi mbili zinabaki na nikishughulika na wachezaji watano, kadi mbili zinabaki. Kuna kadi ngapi?",
  "Think about remainders when dividing. If there are two left when divided amongst five people then the number must be two more than a multiple of 5, e.g. 7 or 32": "Fikiria mabaki wakati wa kugawa. Iwapo zimesalia mbili zikigawanywa kati ya watu watano basi nambari lazima iwe mbili zaidi ya kizidishio cha 5, k.m. 7 au 32",
  "As only a small number of cards have been lost, let us start by listing the numbers that work that are close to 52.": "Kwa kuwa ni idadi ndogo tu ya kadi zimepotea, wacha tuanze kwa kuorodhesha nambari zinazofanya kazi zinazokaribia 52.",
  "If there were no cards remaining when dealt between four people we would know that the number of cards was in the four times table, i.e …, 36, 40, 44, 48. But there are three left over, so the number of cards must be in the sequence …, 39, 43, 47, 51.": "Kama hakungekuwa na kadi zilizobaki wakati wa kushughulikiwa kati ya watu wanne tungejua kwamba idadi ya kadi ilikuwa kwenye jedwali la mara nne, yaani ..., 36, 40, 44, 48. Lakini kuna tatu zilizobaki, kwa hivyo idadi ya kadi lazima. kuwa katika mlolongo …, 39, 43, 47, 51.",
  "For dealing among three people with two left over we get the sequence …, 41,44,47,50": "Kwa kushughulika kati ya watu watatu na wawili waliobaki tunapata mlolongo ..., 41,44,47,50",
  "For dealing among five people with two left over we get the sequence …,32, 37,42,47": "Kwa kushughulika kati ya watu watano na wawili waliobaki tunapata mlolongo …,32, 37,42,47",
  "The number that appears on all three lists is 47.": "Nambari inayoonekana kwenye orodha zote tatu ni 47.",
  "We could also solve the puzzle starting with the last two clues. There is the same number of cards leftover when dealing to three or five people, so the answer must be two more than a multiple of 15, so 17, 32 or 47. The only one of these numbers that fits with the first clue is 47.": "Tunaweza pia kutatua fumbo kwa kuanzia na vidokezo viwili vya mwisho. Kuna idadi sawa ya kadi zilizosalia wakati wa kushughulika na watu watatu au watano, kwa hivyo jibu lazima liwe mbili zaidi ya kizidishio cha 15, kwa hivyo 17, 32 au 47. Nambari moja pekee kati ya hizi zinazolingana na kidokezo cha kwanza ni 47.",
  "There is a special name for the operation of dividing by a number and finding the remainder in mathematics - it is called <strong>mod</strong>ular arithmetic. 47 mod 5 = 2 because when you divide 47 by 5 you have a remainder of 2. It is a powerful technique in mathematics to prove facts about numbers. We use it in everyday life when we tell the time with a 24 hour clock.": "Kuna jina maalum kwa ajili ya uendeshaji wa kugawanya kwa nambari na kutafuta salio katika hisabati - inaitwa <strong>mod</strong>hesabu ya ular. 47 mod 5 = 2 kwa sababu unapogawanya 47 kwa 5 una salio la 2. Ni mbinu yenye nguvu katika hisabati kuthibitisha ukweli kuhusu nambari. Tunaitumia katika maisha ya kila siku tunapotaja saa kwa saa 24.",
  "(18 + 8) mod 24 = 2 or in other words 8 hours after 6pm is 2am!": "(18 + 8) mod 24 = 2 au kwa maneno mengine masaa 8 baada ya 6pm ni 2am!",
  "Some cards have been lost from a complete pack of 52. If I deal among three or four people there are always two cards remaining. How many different options are there for the number of cards remaining?": "Kadi zingine zimepotea kutoka kwa pakiti kamili ya 52. Nikishughulika kati ya watu watatu au wanne daima kunabaki kadi mbili. Je, kuna chaguo ngapi tofauti kwa idadi ya kadi zilizosalia?",
  "Think about multiples of 12.": "Fikiria juu ya kuzidisha kwa 12.",
  "There must be two more than a multiple of 12, because there are two more than a multiple of 3 and two more than a multiple of 4. So there are four numbers … namely 14, 26, 38, 50.": "Lazima kuwe na mbili zaidi ya kizidishio cha 12, kwa sababu kuna mbili zaidi ya kizidishio cha 3 na mbili zaidi ya kizidishio cha 4. Kwa hivyo kuna nambari nne ... yaani 14, 26, 38, 50.",
  "Some cards have been lost from a complete pack of 52. If I deal among two people there is one card remaining, and if I deal among four people there are two cards remaining. How many different options are there for the number of cards remaining?": "Kadi zingine zimepotea kutoka kwa pakiti kamili ya 52. Nikishughulika kati ya watu wawili kuna kadi moja iliyobaki, na ikiwa nitashughulika kati ya watu wanne kuna kadi mbili zilizobaki. Je, kuna chaguo ngapi tofauti kwa idadi ya kadi zilizosalia?",
  "There are 0 options because it is impossible to have a number that is both one more than a multiple of 2 (must be odd) and two more than a multiple of 4 (must be even).": "Kuna chaguo 0 kwa sababu haiwezekani kuwa na nambari ambayo ni moja zaidi ya kizidishio cha 2 (lazima iwe isiyo ya kawaida) na mbili zaidi ya kizidishio cha 4 (lazima iwe sawa)."
}