{
  "Lychrel Numbers": "Nambari za Lychrel",
  "Take a positive integer (whole number). Reverse the digits to get a new number. Add the two numbers together. Repeat this process until you get a palindrome (a number that reads the same forwards and backwards).": "Chukua nambari chanya (nambari nzima). Badilisha tarakimu ili kupata nambari mpya. Ongeza nambari mbili pamoja. Rudia utaratibu huu hadi upate palindrome (nambari inayosoma sawa mbele na nyuma).",
  "Can you find a starting number that doesn't end up at a palindrome? Nobody knows if this is possible.": "Je, unaweza kupata nambari ya kuanzia ambayo haiishii kwenye palindrome? Hakuna mtu anajua kama hii inawezekana.",
  "Pick a positive integer (whole number), e.g. 57. Reverse the digits to get 75. Adding gives 57 +75 = 132. Then reverse this new number and add together. You get 132 + 231 = 353. This is a palindrome as it reads the same forwards as backwards, so we stop. Can you find a number that takes longer to reach a palindrome?": "Chagua nambari kamili chanya (nambari nzima), k.m. 57. Badilisha tarakimu ili kupata 75. Kuongeza inatoa 57 +75 = 132. Kisha geuza nambari hii mpya na uongeze pamoja. Unapata 132 + 231 = 353. Hii ni palindrome kwani inasoma mbele sawa na kurudi nyuma, kwa hivyo tunaacha. Je, unaweza kupata nambari inayochukua muda mrefu kufikia palindrome?",
  "Some numbers end up in a palindrome after one step, e.g. 243: 243 +342 = 585. Some take a bit longer, e.g. 87:": "Nambari zingine huishia kwenye palindrome baada ya hatua moja, k.m. 243: 243 +342 = 585. Wengine huchukua muda mrefu zaidi, k.m. 87:",
  "87 + 78 = 165,": "87 + 78 = 165,",
  "165 + 561 = 726,": "165 + 561 = 726,",
  "726 + 627 = 1353,": "726 + 627 = 1353,",
  "1353 + 3531 = 4884.": "1353 + 3531 = 4884.",
  "Some numbers take a very long time – 89 takes an unusually large 24 steps (the most of any number under 10,000) to reach the palindrome 8813200023188.": "Nambari zingine huchukua muda mrefu sana - 89 inachukua hatua kubwa isiyo ya kawaida 24 (zaidi ya nambari yoyote chini ya 10,000) kufikia palindrome 8813200023188.",
  "A number is called a Lychrel number if it never reaches a palindrome. No one has proved that a Lychrel number exists. One possibility is 196 - the first billion steps have been carried out by computers and it hasn't reached a palindrome… but this does not prove it never will!": "Nambari inaitwa nambari ya Lychrel ikiwa haifikii palindrome. Hakuna mtu amethibitisha kuwa nambari ya Lychrel ipo. Uwezekano mmoja ni 196 - hatua bilioni za kwanza zimetekelezwa na kompyuta na hazijafikia palindrome… lakini hii haithibitishi kamwe!",
  "If you change the base of the problem to binary then 10110 (22 in decimal) is a Lychrel number. The name Lychrel comes from a rough anagram of Wade Van Landingham's girlfriend Cheryl.": "Ukibadilisha msingi wa tatizo kuwa binary basi 10110 (22 katika decimal) ni nambari ya Lychrel. Jina Lychrel linatokana na anagram mbaya ya mpenzi wa Wade Van Landingham Cheryl.",
  "Can you find different 3-digit numbers that take 1, 2, 3, and 4 steps to become a palindrome?": "Je, unaweza kupata nambari tofauti za tarakimu 3 zinazochukua hatua 1, 2, 3, na 4 ili kuwa palindrome?",
  "Most smaller 3-digit numbers take only 1 step to become a palindrome, but try using bigger digits that will mean you have to carry when you add (e.g. 8 + 9 = 17 so you will have to carry the 1).": "Nambari nyingi ndogo zaidi za tarakimu 3 huchukua hatua 1 pekee ili kuwa palindrome, lakini jaribu kutumia tarakimu kubwa zaidi ambayo itamaanisha kwamba unapaswa kubeba unapoongeza (k.m. 8 + 9 = 17 kwa hivyo utalazimika kubeba 1).",
  "There are lots of options, but 122 takes 1 step, 109 takes 2 steps, 199 takes 3 steps and 192 takes 4 steps.": "Kuna chaguzi nyingi, lakini 122 inachukua hatua 1, 109 inachukua hatua 2, 199 inachukua hatua 3 na 192 inachukua hatua 4."
}