{
  "Mastermind": "Mwenye akili",
  "This is a two player game. Player 1 secretly chooses four cards and puts them in a row face down. Player 2 has seven attempts to guess the suits (clubs, diamonds, hearts, spades) of these cards, in order. Player 2 guesses by laying four cards in a row face up. Player 1 looks at the suits, and tells them how many suits they guessed in the correct position (x), and how many other suits they have guessed correctly but in the wrong position (o). Player 2 uses this information to make a better guess next time.": "This is a two player game. Player 1 secretly chooses four cards and puts them in a row face down. Player 2 has seven attempts to guess the suits (clubs, diamonds, hearts, spades) of these cards, in order. Player 2 guesses by laying four cards in a row face up. Player 1 looks at the suits, and tells them how many suits they guessed in the correct position (x), and how many other suits they have guessed correctly but in the wrong position (o). Player 2 uses this information to make a better guess next time.",
  "Here is how a game might work:": "Hivi ndivyo mchezo unavyoweza kufanya kazi:",
  "Player 1 chooses 1) 4 of Hearts, 2) 3 of Clubs, 3) 8 of Spades, 4) 10 of Spades and places them face down.": "Mchezaji 1 anachagua 1) 4 kati ya Hearts, 2) 3 za Vilabu, 3) 8 za Spades, 4) 10 za Spades na kuziweka chini chini.",
  "Player 2 lays down for example: 1) 6 of Hearts, 2) 4 of Spades, 3) J of Diamonds, 4) 3 of Spades.": "Mchezaji 2 anaweka chini kwa mfano: 1) 6 ya Hearts, 2) 4 ya Spades, 3) J ya Almasi, 4) 3 ya Spades.",
  "Player 2 has three correct suits (Heart, Spade and Spade) and two in the correct position - 1) and 4) so Player 1 would say \"you have two in the correct position and one in the wrong position\", but doesn't say which ones - an easy way to record this would be xxo. Then player 2 would guess again. They might think that it was the last two cards that were perfectly correct, so keep these and guess a different first two. Recording the results on pen and paper will be necessary and would look like this:": "Mchezaji 2 ana suti tatu sahihi (Moyo, Spade na Spade) na mbili katika nafasi sahihi - 1) na 4) hivyo Mchezaji 1 anaweza kusema \"una wawili katika nafasi sahihi na mmoja katika nafasi mbaya\", lakini hana. Usiseme ni zipi - njia rahisi ya kurekodi hii itakuwa xxo. Kisha mchezaji 2 angekisia tena. Wanaweza kufikiria kuwa ni kadi mbili za mwisho ambazo zilikuwa sahihi kabisa, kwa hivyo weka hizi na ubashiri mbili za kwanza tofauti. Kurekodi matokeo kwenye kalamu na karatasi itakuwa muhimu na itaonekana kama hii:",
  "HSDS  xxo": "HSDS  xxo",
  "CCDS  xoo": "CCDS  xoo",
  "Note that it is just the suits we are interested in, not the numbers. Player 1 is not saying which ones are correct, just saying how many are correct. Player 2 keeps guessing until all four are correct.": "Kumbuka kuwa ni suti tu ambazo tunavutiwa nazo, sio nambari. Mchezaji 1 hasemi zipi ni sahihi, anasema tu ni ngapi ambazo ni sahihi. Mchezaji 2 anaendelea kubahatisha hadi zote nne ziwe sahihi.",
  "For the guesser: Your first guess will be at random but after that you should be using logic to work out what the solution might be. One good strategy for beginners is just change one card at a time, but as you play more you may find a better optimal strategy.": "Kwa anayekisia: Nadhani yako ya kwanza itakuwa bila mpangilio lakini baada ya hapo unapaswa kutumia mantiki kujua suluhisho linaweza kuwa nini. Mbinu moja nzuri kwa wanaoanza ni kubadilisha kadi moja kwa wakati mmoja, lakini unapocheza zaidi unaweza kupata mkakati bora zaidi.",
  "For the setter: Think about whether it is best to have all the same suit, all different, or some the same.": "Kwa mpangaji: Fikiria ikiwa ni bora kuwa na suti zinazofanana, zote tofauti, au zingine sawa.",
  "This game can be played with numbers, letters, symbols or colours as in the popular board game.": "Mchezo huu unaweza kuchezwa kwa nambari, herufi, alama au rangi kama ilivyo kwenye mchezo maarufu wa ubao.",
  "Try playing the game by having to guess the numbers of the cards - 1 (A) to 10 - instead of the suits. There will be more options so it will be a lot harder. You could even use J, Q, K too.": "Jaribu kucheza mchezo kwa kubahatisha nambari za kadi - 1 (A) hadi 10 - badala ya suti. Kutakuwa na chaguzi zaidi kwa hivyo itakuwa ngumu zaidi. Unaweza hata kutumia J, Q, K pia."
}