{
  "Mean": "Wastani",
  "The average (mean) of 16 different positive integers is 16. What is the greatest possible value that any of these integers could have?": "Wastani (wastani) wa nambari kamili chanya 16 ni 16. Je, ni thamani gani kuu inayowezekana ambayo yoyote kati ya nambari kamili hizi inaweza kuwa nayo?",
  "Make the first 15 (different) numbers as small as possible. What does this tell us about the 16th number?": "Fanya nambari 15 za kwanza (tofauti) ziwe ndogo iwezekanavyo. Je, hii inatuambia nini kuhusu nambari ya 16?",
  "If the mean of 16 numbers is 16, then the total of all the numbers is 16×16 = 256. We want to make one of the numbers as big as possible, so we should make the other 15 numbers as small as possible. The integers have to be different so we should choose 1, 2, 3, ..., 15. If you add them up this gives 120 (a quick way to do it is ½×15×16 = 120). So the biggest number is 256 - 120 = 136.": "Ikiwa wastani wa nambari 16 ni 16, basi jumla ya nambari zote ni 16×16 = 256. Tunataka kufanya moja ya nambari kuwa kubwa iwezekanavyo, kwa hiyo tunapaswa kufanya namba nyingine 15 ndogo iwezekanavyo. Nambari kamili lazima ziwe tofauti kwa hivyo tunapaswa kuchagua 1, 2, 3, ..., 15. Ukizijumlisha hii inatoa 120 (njia ya haraka ya kuifanya ni ½×15×16 = 120). Kwa hivyo nambari kubwa ni 256 - 120 = 136.",
  "The mean is one way of describing a whole set of data with just one number. The median is another way describing the set of data with one number. If the puzzle had asked \"The median of 16 different positive integers is 16. What is the greatest possible value that any of these integers could have?\", then there would be no solution as you could choose any number as large as you like for the biggest number, as the value of the median of 16 numbers depends only on the eight and ninth biggest numbers!": "Wastani ni njia moja ya kuelezea seti nzima ya data na nambari moja tu. Wastani ni njia nyingine inayoelezea seti ya data na nambari moja. Ikiwa fumbo lingeuliza \"Wastani wa nambari 16 tofauti chanya ni 16. Ni thamani gani kubwa zaidi ambayo yoyote kati ya nambari hizi kamili inaweza kuwa nayo?\", basi kusingekuwa na suluhu kwani ungeweza kuchagua nambari yoyote kubwa upendavyo. idadi kubwa zaidi, kwani thamani ya wastani wa nambari 16 inategemea tu nambari nane na tisa kubwa!",
  "The average (mean) age of 7 people is 16. Given that all their ages are different positive integers, what is the maximum number of people that could be older than 16?": "Umri wa wastani (wastani) wa watu 7 ni 16. Kwa kuzingatia kwamba umri wao wote ni nambari chanya tofauti, ni idadi gani ya juu zaidi ya watu ambayo inaweza kuwa zaidi ya 16?",
  "Could everyone be older than 16? If not, can you try and find the maximum number of people that could be older than 16 if just one of the people is as young as possible?": "Je, kila mtu anaweza kuwa zaidi ya miaka 16? Ikiwa sivyo, unaweza kujaribu kupata idadi ya juu zaidi ya watu ambao wanaweza kuwa wakubwa zaidi ya 16 ikiwa ni mmoja tu wa watu ambaye ni mchanga iwezekanavyo?",
  "You cannot make all 7 people older than 16 because the average is 16. You could start with the youngest person being 1, and try to make the other 6 people older than 16 but the total must be 7×16 = 112. With this strategy, 112 - 1 = 111 and 16 + 17 + 18 + 19 + 20 + 21 = 111 so this only gives 5 people older than 16 as you can't count 16 itself. This shows that you cannot do it with 6 people older than 16, but because you have a possibility with 5, this is the largest number you can have.": "Huwezi kuwafanya watu wote 7 kuwa wakubwa zaidi ya 16 kwa sababu wastani ni 16. Unaweza kuanza na mtu mdogo kuwa 1, na kujaribu kuwafanya watu wengine 6 kuwa wakubwa zaidi ya 16 lakini jumla lazima iwe 7×16 = 112. Kwa mkakati huu., 112 - 1 = 111 na 16 + 17 + 18 + 19 + 20 + 21 = 111 hivyo hii inawapa watu 5 tu zaidi ya 16 kwani huwezi kuhesabu 16 yenyewe. Hii inaonyesha kuwa huwezi kuifanya ukiwa na watu 6 walio na umri zaidi ya miaka 16, lakini kwa sababu una uwezekano wa 5, hii ndiyo nambari kubwa zaidi unayoweza kuwa nayo.",
  "When Albert entered the room, the average age increased by 4 years. When Belinda then entered the room, the average age increased by another 3 years. Albert and Belinda are twins. How many people were in the room before Albert entered?": "Albert alipoingia chumbani, wastani wa umri uliongezeka kwa miaka 4. Wakati Belinda alipoingia chumbani, wastani wa umri uliongezeka kwa miaka 3 nyingine. Albert na Belinda ni mapacha. Ni watu wangapi walikuwa chumbani kabla ya Albert kuingia?",
  "There are different ways to solve this puzzle. For each method let n be the number of people in the room.": "Kuna njia tofauti za kutatua fumbo hili. Kwa kila njia basi n iwe idadi ya watu kwenye chumba.",
  "If Albert and Belinda walked in together, between them they would have added (n + 2)×7 onto the total of all the ages in the room. If just Albert walked in, then he would have added (n + 1)×4 to the total. It is the same for Belinda, so if they both walked in together it would be double this amount. So  (n + 2)×7 = 2×(n + 1)×4. Solving this gives n = 6.": "Ikiwa Albert na Belinda wangeingia pamoja, kati yao wangeongeza (n + 2)×7 kwenye jumla ya umri wote katika chumba. Ikiwa tu Albert aliingia, basi angeongeza (n + 1) × 4 kwa jumla. Ni sawa kwa Belinda, kwa hivyo ikiwa wote wawili wangeingia pamoja itakuwa ni mara mbili ya kiasi hiki. Hivyo (n + 2)×7 = 2×(n + 1)×4. Kutatua hii inatoa n = 6.",
  "Alternatively, let a be Albert and Belinda's age. The new mean after Albert walks in is (a - 4×n) because Albert has shared out 4 years to everyone in the room to make his age the same. After Belinda walks in the mean is (a - 3×(n + 1)) because she has given 3 years to everyone in the room including Albert. We know that this second expression must be 3 more than the first expression as the mean increased by 3 when Belinda walked in. So we can solve (a - 3×(n + 1)) = a - 4×n + 3  which gives n = 6.": "Vinginevyo, acha uwe na umri wa Albert na Belinda. Maana mpya baada ya Albert kuingia ni (a - 4×n) kwa sababu Albert ameshiriki miaka 4 kwa kila mtu kwenye chumba ili kufanya umri wake ufanane. Baada ya Belinda kutembea maana yake ni (a - 3×(n + 1)) kwa sababu ametoa miaka 3 kwa kila mtu chumbani akiwemo Albert. Tunajua kwamba usemi huu wa pili lazima uwe 3 zaidi ya usemi wa kwanza kwani maana iliongezeka kwa 3 wakati Belinda alipoingia. Kwa hivyo tunaweza kutatua (a - 3×(n + 1)) = a - 4×n + 3 ambayo inatoa. n = 6.",
  "Here is another way. Let the original mean be m. The sum of all the ages is originally (m×n). Let Albert's age be a. When Albert walks in, the new mean is (m + 4). This must be equal to (m×n + a) ∕ (n + 1). When Belinda walks in the room, the new mean is (m + 7). This must be equal to (m×n + 2×a) ∕ (n + 2). Rearranging these equations gives": "Hapa kuna njia nyingine. Acha maana ya asili iwe m. Jumla ya nyakati zote ni asili (m×n). Hebu umri wa Albert uwe a. Wakati Albert anaingia, maana mpya ni (m + 4). Hii lazima iwe sawa na (m×n + a) ∕ (n + 1). Wakati Belinda anatembea kwenye chumba, maana mpya ni (m + 7). Hii lazima iwe sawa na (m×n + 2×a) ∕ (n + 2). Kupanga upya milinganyo hii inatoa",
  "m×n + a = m×n + m + 4×n + 4": "m×n + a = m×n + m + 4×n + 4",
  "and": "and",
  "m×n + 2×a = m×n + 2×m + 7×n + 14": "m×n + 2×a = m×n + 2×m + 7×n + 14",
  "Which simplify to": "Ambayo kurahisisha",
  "a = m + 4×n + 4 and 2×a = 2×m + 7×n + 14.": "a = m + 4×n + 4 na 2×a = 2×m + 7×n + 14.",
  "Multiplying the first equation by 2 and subtracting the second one gives n = 6. So there are 6 people in the room at the start.": "Kuzidisha equation ya kwanza kwa 2 na kutoa ya pili inatoa n = 6. Kwa hivyo kuna watu 6 kwenye chumba mwanzoni."
}