{
  "Mixed-up Socks": "Soksi za Mchanganyiko",
  "You have a pair of red socks, a pair of blue socks, a pair of yellow socks, and a pair of green socks. In how many ways can you mix them up and form new pairs so that all the new pairs are mismatched (have different colours), and none of the new mismatched pairs is the same as another new mismatched pair?": "Una jozi ya soksi nyekundu, jozi ya soksi za bluu, jozi ya soksi za njano, na jozi ya soksi za kijani. Je, ni kwa njia ngapi unaweza kuzichanganya na kuunda jozi mpya ili jozi zote mpya zisifanane ( ziwe na rangi tofauti), na hakuna mojawapo ya jozi mpya zisizolingana ambayo ni sawa na nyingine mpya isiyolingana?",
  "Start with matching one of the red with one of the green, and the other red with a blue. You could write this as RB, RY. What would the other two pairs have to be?": "Anza kwa kulinganisha moja ya nyekundu na moja ya kijani, na nyingine nyekundu na bluu. Unaweza kuandika hii kama RB, RY. Je, jozi nyingine mbili zingepaswa kuwa nini?",
  "You can solve this problem by listing all the options. You could have RB, RY, YG, BG or RB, RG, GY, BY or RY, RG, YB, GB. You could also solve it by thinking that, starting with the red socks, there are three different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you can't then match BY together because that would leave GG for the last pair which isn't allowed. So once you have picked the two colours to go with red, there are no more choices to make. There are 3 ways to pick two colours from a choice of three, so the answer is 3.": "Unaweza kutatua tatizo hili kwa kuorodhesha chaguzi zote. Unaweza kuwa na RB, RY, YG, BG au RB, RG, GY, BY au RY, RG, YB, GB. Unaweza pia kutatua kwa kufikiri kwamba, kuanzia na soksi nyekundu, kuna rangi tatu tofauti ambazo soksi mbili zinaweza kuendana nazo. Ukichagua RB na RY kama jozi mbili za kwanza, basi huwezi kulinganisha BY pamoja kwa sababu hiyo itaacha GG kwa jozi ya mwisho ambayo hairuhusiwi. Kwa hivyo mara tu umechagua rangi mbili za kwenda na nyekundu, hakuna chaguo zaidi za kufanya. Kuna njia 3 za kuchagua rangi mbili kutoka kwa chaguo la tatu, kwa hivyo jibu ni 3.",
  "For four different pairs of socks, if they were loose in a drawer and you shut your eyes and matched them together at random there would be a 1% chance of matching them perfectly and a 46% chance of matching them completely wrongly as in the puzzle.": "Kwa jozi nne tofauti za soksi, ikiwa zingekuwa zimelegea kwenye droo na ukifunga macho yako na kuzilinganisha bila mpangilio kungekuwa na nafasi ya 1% ya kuzilingana kikamilifu na uwezekano wa 46% kuzilinganisha vibaya kama kwenye fumbo.",
  "You have five pairs of socks, each a different colour (red, blue, yellow, green, orange). Mix them up and form new pairs so that all the new pairs are mismatched, and none of the new (mismatched) pairs is the same as another new (mismatched) pair.": "Una jozi tano za soksi, kila rangi tofauti (nyekundu, bluu, njano, kijani, machungwa). Changanya na uunda jozi mpya ili jozi zote mpya zifanane, na hakuna jozi mpya (isiyo sawa) sawa na jozi nyingine mpya (isiyolingana).",
  "In how many ways can you mix them up and form new pairs in this way?": "Je, ni kwa njia ngapi unaweza kuzichanganya na kuunda jozi mpya kwa njia hii?",
  "Start off with the two red socks. Can you work out how many ways there are of choosing which two colours these two socks could be matched with?": "Anza na soksi mbili nyekundu. Je, unaweza kufahamu ni njia ngapi za kuchagua rangi mbili hizi soksi zinaweza kulinganishwa nazo?",
  "Starting with the red socks, there are four different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you cannot then have BY as a pair. This is because it would only leave two green and two orange socks and you can't have GG or OO and you can't have GO twice. You could match the second blue sock with green or orange. Once you choose one the other two pairs are fixed. For example RB, RY, BG then it must be OG and OY.": "Kuanzia na soksi nyekundu, kuna rangi nne tofauti ambazo soksi mbili zinaweza kuendana nazo. Ukichagua RB na RY kama jozi mbili za kwanza, basi huwezi kuwa na BY kama jozi. Hii ni kwa sababu ingeacha soksi mbili za kijani kibichi na mbili za chungwa pekee na huwezi kuwa na GG au OO na huwezi kuwa na GO mara mbili. Unaweza kulinganisha soksi ya pili ya bluu na kijani au machungwa. Mara tu unapochagua moja jozi zingine mbili zimewekwa. Kwa mfano RB, RY, BG basi lazima iwe OG na OY.",
  "There are 6 ways to pick two colours from a choice of four, and then 2 ways to pick one colour from a choice of two, so the answer is 6×2 = 12.": "Kuna njia 6 za kuchagua rangi mbili kutoka kwa chaguo nne, na kisha njia 2 za kuchagua rangi moja kutoka kwa chaguo mbili, kwa hivyo jibu ni 6 × 2 = 12.",
  "Imagine you have a bag with 3 red marbles, a bag with 3 blue marbles, a bag with 3 green marbles, and a bag with 3 yellow ones. If the order of the bags doesn't matter, in how many ways can we mix up and sort the marbles into the 4 different bags with 3 different coloured marbles each?": "Hebu fikiria una mfuko wenye marumaru 3 nyekundu, mfuko wenye marumaru 3 za bluu, mfuko wenye marumaru 3 za kijani kibichi, na mfuko wa manjano 3. Ikiwa mpangilio wa mifuko haujalishi, ni kwa njia ngapi tunaweza kuchanganya na kupanga marumaru kwenye mifuko 4 tofauti yenye marumaru 3 za rangi tofauti kila moja?",
  "It helps in a problem such as this one to think primarily about the colour of the marble that <em>doesn't</em> get picked to be included in the first bag. Since we have four colours and bags that hold three marbles, and since we can't have two of the same colour in the same bag, there are four ways in which we can fill the first bag (think: in each possible combination, one colour gets excluded, and with four colours of marbles, there are four potential colours to exclude from the first bag. Now, what does that mean for the colour that wasn't included in the first bag. Let's refer to the three colours included in the first bag as a, b, and c. That leaves d to denote the colour that was excluded. Because we cannot have two of the same colour marble in any given bag, each of the remaining bags must contain one d marble. Now let's move on to the second bag. The second bag already has a colour d in it, and only has room for two more. There are three colours left to choose from, so we once again arrive at a situation where it's best to think in terms of what colour we are excluding. We must pick 2 marbles from a list of 3, so we must exclude 1. Whatever colour we exclude will have two remaining that must go into the two remaining bags. The colours that were included in the second bag each have one remaining to be placed inside a bag. We now arrive at the third bag, which already has a marble of the colour excluded from the first bag, and a marble of the colour excluded from the second. We then have two options to pick from, and the one we don't pick will go into the fourth bag, whose makeup will already be decided. We thus have 4×3×2×1 = 24 ways of placing the marbles into the four bags. Because the order of the bags doesn't matter, we must divide this number by the number of ways that four bags can be ordered, which is equal to 4×3×2×1 = 24. We thus get 24 / 24 = 1.": "Inasaidia katika tatizo kama hili kufikiria kimsingi kuhusu rangi ya marumaru ambayo <em>haichaguliwi</em> ili kujumuishwa kwenye mfuko wa kwanza. Kwa kuwa tuna rangi nne na mifuko inayoshikilia marumaru tatu, na kwa kuwa hatuwezi kuwa na rangi mbili sawa katika mfuko huo, kuna njia nne ambazo tunaweza kujaza mfuko wa kwanza (fikiria: katika kila mchanganyiko unaowezekana, moja. rangi huondolewa, na kwa rangi nne za marumaru, kuna rangi nne zinazoweza kujumuishwa kwenye mfuko wa kwanza. Sasa, hiyo inamaanisha nini kwa rangi ambayo haikujumuishwa kwenye mfuko wa kwanza. Hebu turejelee rangi tatu zilizojumuishwa ndani mfuko wa kwanza kama a, b, na c. Hiyo inaacha d kuashiria rangi ambayo haikujumuishwa. Kwa sababu hatuwezi kuwa na marumaru mbili za rangi sawa kwenye mfuko wowote, kila mfuko uliobaki lazima uwe na marumaru d. Sasa hebu nenda kwenye begi la pili.Mfuko wa pili tayari una rangi d ndani yake, na una nafasi ya mbili tu zaidi.Zimesalia rangi tatu kuchagua, kwa hivyo tunafika tena katika hali ambayo ni bora kufikiria. ya rangi gani ambayo hatujumuishi.Lazima tuchukue marumaru 2 kutoka kwenye orodha ya 3, kwa hivyo lazima tuondoe 1. Rangi yoyote tutakayotenga itakuwa na mbili zilizobaki ambazo lazima ziingie kwenye mifuko miwili iliyobaki. Rangi ambazo zilijumuishwa kwenye mfuko wa pili kila moja ina moja iliyobaki ya kuwekwa ndani ya mfuko. Sasa tunafika kwenye mfuko wa tatu, ambao tayari una marumaru ya rangi isiyojumuishwa kwenye mfuko wa kwanza, na marumaru ya rangi isiyojumuishwa kutoka kwa pili. Kisha tuna chaguo mbili za kuchagua, na moja ambayo hatujachagua itaingia kwenye mfuko wa nne, ambao uundaji wake tayari utaamuliwa. Kwa hivyo tuna 4×3×2×1 = njia 24 za kuweka marumaru kwenye mifuko minne. Kwa sababu utaratibu wa mifuko haijalishi, ni lazima tugawanye nambari hii kwa idadi ya njia ambazo mifuko minne inaweza kuagizwa, ambayo ni sawa na 4×3×2×1 = 24. Kwa hivyo tunapata 24/24 = 1."
}