{
  "Nim": "Nim",
  "|": "|",
  "| | |": "| | |",
  "| | | | |": "| | | | |",
  "Arrange 9 sticks in 3 rows as shown. Two players take it in turn to remove one or more sticks from a single row. The loser is the person to take the last stick. Can you find a winning strategy?": "Panga vijiti 9 katika safu 3 kama inavyoonyeshwa. Wachezaji wawili huchukua kwa zamu kuondoa vijiti moja au zaidi kutoka kwa safu moja. Aliyeshindwa ni mtu wa kuchukua fimbo ya mwisho. Je, unaweza kupata mkakati wa kushinda?",
  "You can remove as many sticks as you like each turn as long as they come from the same row. For example an opening move could be to take all 5 sticks from the bottom row. You must take at least one stick each turn. You are trying to leave just one stick left for your opponent to be forced to take and therefore lose the game.": "Unaweza kuondoa vijiti vingi unavyopenda kila zamu mradi zinatoka kwenye safu moja. Kwa mfano hatua ya kufungua inaweza kuwa kuchukua vijiti vyote 5 kutoka safu ya chini. Lazima uchukue angalau kijiti kimoja kila zamu. Unajaribu kuacha fimbo moja tu ili mpinzani wako alazimishwe kuchukua na hivyo kupoteza mchezo.",
  "Try to think a few moves ahead. For example if you can remove a stick to leave this pattern": "Jaribu kufikiria hatua chache mbele. Kwa mfano ikiwa unaweza kuondoa kijiti ili kuacha muundo huu",
  "| |": "| |",
  "then you will be able to win.": "basi utaweza kushinda.",
  "Try to work out if it is better to go first or second.": "Jaribu kufanya kazi nje ikiwa ni bora kwenda kwanza au pili.",
  "This is an ancient game that owes its current name to Charles Bouton, who also developed a theory for how you can always play to win. His strategy involves binary numbers and can be found here <a href=\"https://plus.maths.org/content/play-win-nim\">https://plus.maths.org/content/play-win-nim</a>. You can play different variations of the game (also called drips) online here https://wild.maths.org/tags/fun-drips": "Huu ni mchezo wa zamani ambao una jina lake la sasa kwa Charles Bouton, ambaye pia alianzisha nadharia ya jinsi unavyoweza kucheza kila wakati ili kushinda. Mkakati wake unahusisha nambari jozi na inaweza kupatikana hapa <a href=\"https://plus.maths.org/content/play-win-nim\">https://plus.maths.org/content/play-win- nim</a>. Unaweza kucheza tofauti tofauti za mchezo (pia huitwa drips) mtandaoni hapa https://wild.maths.org/tags/fun-drips",
  "Try changing the starting number and pattern of sticks. You could try rows of 3,5,7 or 1,3,5,7 sticks.": "Jaribu kubadilisha nambari ya kuanzia na muundo wa vijiti. Unaweza kujaribu safu za vijiti 3,5,7 au 1,3,5,7."
}