{
  "Patience": "Subira",
  "This is a one player game of patience. Lay out a grid of 8 cards in 2 rows of 4 cards, face up and hold the remaining cards. If you find two cards in the grid that sum to 11 you can put new cards from your hand on top of them (here A = 1). If you find the J, Q or K cards you can also put a new card on top of each. The objective of the game is to put down all the cards.": "Huu ni mchezo wa mchezaji mmoja wa uvumilivu. Weka gridi ya kadi 8 katika safu 2 za kadi 4, tazama juu na ushikilie kadi zilizobaki. Ukipata kadi mbili kwenye gridi ambayo jumla yake ni 11 unaweza kuweka kadi mpya kutoka kwa mkono wako juu yao (hapa A = 1). Ukipata kadi za J, Q au K unaweza pia kuweka kadi mpya juu ya kila moja. Lengo la mchezo ni kuweka chini kadi zote.",
  "Remove the Jokers before starting. A has a value of 1 in this game. If you manage to play all your cards, the last stage of the game is to pick up pairs of piles of cards whose top cards add up to 11, or three piles whose top cards are J, Q, K. You have won the game if you can pick up all the cards. If you can't put down all your cards, count how many are left": "Ondoa Jokers kabla ya kuanza. A ina thamani ya 1 katika mchezo huu. Ukifaulu kucheza kadi zako zote, hatua ya mwisho ya mchezo ni kuchukua mirundo ya kadi ambazo kadi zake za juu hujumlisha hadi 11, au rundo tatu ambazo kadi zake za juu ni J, Q, K. Umeshinda mchezo. kama unaweza kuchukua kadi zote. Ikiwa huwezi kuweka chini kadi zako zote, hesabu ni ngapi zimesalia",
  "This game is mostly luck - but you need to think carefully about how many J, Q and K you cover to win the final stage!": "Mchezo huu mara nyingi ni wa bahati - lakini unahitaji kufikiria kwa makini kuhusu idadi ya J, Q na K unazocheza ili kushinda hatua ya fainali!",
  "These types of games are often called Patience or Solitaire. Patience because you need a lot of patience to try and win, and Solitaire because you can play them on your own. Although many variations of Patience are down to chance, it is interesting to use mathematics to analyse the probability of winning.": "Aina hizi za michezo mara nyingi huitwa Subira au Solitaire. Subira kwa sababu unahitaji uvumilivu mwingi kujaribu na kushinda, na Solitaire kwa sababu unaweza kuzicheza peke yako. Ingawa tofauti nyingi za Subira ni za kubahatisha, inafurahisha kutumia hisabati kuchanganua uwezekano wa kushinda.",
  "A similar game uses 10 cards face up and you have to remove pairs that add up to 13 (A = 1, J = 11, Q = 12, and K=13). The K can be removed on its own. Each time you remove cards you replace them with new ones. The aim is to finish playing all the cards in the deck.": "Mchezo kama huo hutumia kadi 10 zikitazama juu na lazima uondoe jozi zinazojumlisha hadi 13 (A = 1, J = 11, Q = 12, na K=13). K inaweza kuondolewa peke yake. Kila unapoondoa kadi unaweka mpya. Lengo ni kumaliza kucheza kadi zote kwenye staha.",
  "You could make up your own version of this type of game by choosing the number to sum to, how many cards are face up to start with and what to do with the face cards. Can you design a game that can be won about half of the time?": "Unaweza kutengeneza toleo lako mwenyewe la aina hii ya mchezo kwa kuchagua nambari ya kuongeza, ni kadi ngapi zinazokabiliwa kuanza nazo na nini cha kufanya na kadi za uso. Je, unaweza kubuni mchezo ambao unaweza kushinda takriban nusu ya muda?"
}