{
  "Paving Paths": "Njia za Kutengeneza",
  "In how many different ways can you lay 6 equal paving slabs, each 2 meters by 1 meter, to make a path 2 meters wide and 6 meters long from my back door into my garden, without cutting any of the paving slabs?": "Je, ni kwa njia ngapi tofauti unaweza kuweka vibao 6 sawa vya kutengeneza lami, kila mita 2 kwa mita 1, kutengeneza njia yenye upana wa mita 2 na urefu wa mita 6 kutoka kwenye mlango wangu wa nyuma hadi kwenye bustani yangu, bila kukata bamba zozote za kutengeneza?",
  "In how many different ways can you do that in case you had fewer paving slabs for a shorter path? Think about a good strategy to classify different ways. For example, how many ways can you have 2 pairs of slabs lengthwise?": "Ni kwa njia ngapi tofauti unaweza kufanya hivyo ikiwa ungekuwa na slabs chache za kutengeneza njia fupi? Fikiria juu ya mkakati mzuri wa kuainisha njia tofauti. Kwa mfano, ni njia ngapi unaweza kuwa na jozi 2 za slabs kwa urefu?",
  "This problem is firstly meant to make you think about a good strategy to count. You can draw all possibilities for shorter paths. However, this will soon become too lengthy. A first step towards finding an organizing principle could be classifying the paths accordingly to how many pairs of \nslabs placed lengthwise there are. Let us denote as n the number of paving slabs.\nFor n = 1, there is clearly only one possibility (no pairs); for n = 2 there are 2 possibilities (no pairs, and 1 pair); for n = 3 there are 1×(no pairs) + 2×(1 pair) = 3 ways; for n = 4 there are 1×(no pairs) + 3×(1 pair) + 1×(2 pairs)= 5. Using this strategy we can easily count n = 6: there are 1×(no pairs) + 5×(1 pair) + 6×(2 pairs) + 1×(3 pairs) = 13. Looking at the sequence 1, 2, 3, 5, 8, 13, …you might recognize the pattern!": "Tatizo hili kwanza linakusudiwa kukufanya ufikirie kuhusu mkakati mzuri wa kuhesabu. Unaweza kuchora uwezekano wote wa njia fupi. Walakini, hii itakuwa ndefu sana hivi karibuni. Hatua ya kwanza kuelekea kupata kanuni ya kupanga inaweza kuwa kuainisha njia ipasavyo kwa jozi ngapi za\nslabs kuwekwa kwa urefu kuna. Wacha tuonyeshe kama n idadi ya slabs za kutengeneza.\nKwa n = 1, kuna uwezekano mmoja tu (hakuna jozi); kwa n = 2 kuna uwezekano 2 (hakuna jozi, na jozi 1); kwa n = 3 kuna 1 × (hakuna jozi) + 2 × (1 jozi) = njia 3; kwa n = 4 kuna 1×(hakuna jozi) + 3×(jozi 1) + 1×(jozi 2)= 5. Kwa kutumia mkakati huu tunaweza kuhesabu kwa urahisi n = 6: kuna 1×(hakuna jozi) + 5. ×(jozi 1) + 6×(jozi 2) + 1×(jozi 3) = 13. Ukiangalia mlolongo 1, 2, 3, 5, 8, 13, …unaweza kutambua muundo!",
  "The sequence of numbers in this puzzle are part of the Fibonacci sequence:": "Mlolongo wa nambari katika fumbo hili ni sehemu ya mlolongo wa Fibonacci:",
  "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... It is easy to find the next number by adding the previous two numbers, but you can also find numbers in the sequence directly using this formula:": "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... Ni rahisi kupata nambari inayofuata kwa kuongeza nambari mbili zilizopita, lakini pia unaweza kupata nambari kwenye mlolongo moja kwa moja kwa kutumia hii. formula:",
  "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )": "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )",
  "How many different ways can you lay the 11 paving slabs of the same type to make a path 2 meters wide and 11 meters long, without cutting any of the paving slabs?": "Je! ni njia ngapi tofauti unaweza kuweka slabs 11 za kutengeneza za aina moja ili kutengeneza njia ya upana wa mita 2 na urefu wa mita 11, bila kukata slabs yoyote ya kutengeneza?",
  "Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted?": "Kuhesabu kwa uwazi kunaweza kuwa ndefu sana. Je, unaweza kuja na njia ya kupunguza tatizo katika kesi rahisi ambazo tayari umehesabu?",
  "Supposing you have to lay n slabs. Let us denote as F(n) the solution of the problem for n slabs. There are two ways you can end your path: either by laying the last pair of slabs lengthwise, or by laying the last slab across. In the first case, you are free to arrange the first (n - 2) slabs as you wish to make a path of length (n - 2) meters: there are exactly F(n - 2) ways of doing this. As far as the second case is concerned, you are then free to arrange the first (n - 1) slabs as you wish to make a path of length (n - 1) meters: there are exactly F(n - 1) ways of doing this. Therefore, you find that F(n) = F(n - 1) + F(n - 2): this is the proof for the recursion relation for your sequence of numbers! By previous experiments, it should be clear that F(1) = 1 and F(2) = 2.\nWe can now build the sequence easily: each term in the sequence can be found by adding the two previous terms. We can carry it on:": "Tuseme unapaswa kuweka n slabs. Wacha tuonyeshe kama F (n) suluhisho la shida kwa n slabs. Kuna njia mbili unazoweza kumaliza njia yako: ama kwa kuweka jozi ya mwisho ya slabs kwa urefu, au kwa kuwekea bamba la mwisho kuvuka. Katika kesi ya kwanza, uko huru kupanga slabs za kwanza (n - 2) kama unavyotaka kutengeneza njia ya urefu wa mita (n - 2): kuna njia za F (n - 2) za kufanya hivyo. Kwa kadiri kesi ya pili inavyohusika, basi uko huru kupanga slabs za kwanza (n - 1) unavyotaka kutengeneza njia ya urefu wa mita (n - 1): kuna njia za F(n - 1) za kufanya hivi. Kwa hivyo, unapata kwamba F(n) = F(n - 1) + F(n - 2): huu ndio uthibitisho wa uhusiano wa kujirudia kwa mlolongo wako wa nambari! Kwa majaribio ya awali, inapaswa kuwa wazi kuwa F(1) = 1 na F(2) = 2.\nSasa tunaweza kuunda mfuatano kwa urahisi: kila neno katika mfuatano linaweza kupatikana kwa kuongeza maneno mawili ya awali. Tunaweza kuendelea nayo:",
  "1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144": "1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144",
  "So there are 144 ways to lay the 11 paving slabs to make the path.": "Kwa hivyo kuna njia 144 za kuweka slabs 11 za kutengeneza njia.",
  "For all the paths built with a number of slabs between 1 and 30 inclusive, how many of these will have an odd number of ways of building them?": "Kwa njia zote zilizojengwa kwa idadi ya slabs kati ya 1 na 30 zikiwemo, ni ngapi kati ya hizi zitakuwa na idadi isiyo ya kawaida ya njia za kuzijenga?",
  "For the sequence 1, 2, 3, 5, 8, 13, 21, … we can see that there is a pattern odd-even-odd, odd-even-odd, odd- etc. This makes sense as even + odd = odd and odd + odd = even. So in a sequence of 30 numbers, there are 30 ∕ 3×2= 20 odd numbers.": "Kwa mfuatano wa 1, 2, 3, 5, 8, 13, 21, … tunaweza kuona kwamba kuna muundo odd-hata-odd, odd-hata-odd, odd- n.k. Hii inaleta mantiki kama hata + isiyo ya kawaida = isiyo ya kawaida na isiyo ya kawaida + isiyo ya kawaida = hata. Kwa hivyo katika mlolongo wa nambari 30, kuna 30 ∕ 3×2= nambari 20 zisizo za kawaida."
}