{
  "Pieces of Cake": "Vipande vya Keki",
  "What is the biggest number of pieces of a circular cake you can obtain with 5 straight cuts? Cuts must be made on the top of the cake.": "Ni idadi gani kubwa ya vipande vya keki ya mviringo unayoweza kupata kwa kupunguzwa 5 moja kwa moja? Kupunguzwa lazima kufanywe juu ya keki.",
  "Start with a small number of cuts, e.g. 1, 2, 3. How can you add another cut to get the biggest number of pieces? Remember it doesn't say that the pieces have to be the same size! What happens if many cuts pass through the same point?": "Anza na idadi ndogo ya kupunguzwa, k.m. 1, 2, 3. Unawezaje kuongeza kata nyingine ili kupata idadi kubwa ya vipande? Kumbuka haisemi kwamba vipande vinapaswa kuwa na ukubwa sawa! Je! ni nini hufanyika ikiwa mikato mingi itapita kwenye sehemu ile ile?",
  "With one cut you always get 2 pieces. With two cuts you can get 4 pieces. With three cuts, if all cuts pass through the same point you get 6 pieces. However, you can get 7 pieces if the third cut doesn't pass through the same point as the previous two. Use this idea to get the maximum number with four cuts. So to get the most pieces, make sure that no more than two cuts pass through the same point, otherwise you get less pieces. With four cuts you can get 11 pieces. Do the same again for five cuts, start with the four cuts that give 7 pieces and add a cut without passing through any meeting points (intersections) and you can get 16 pieces.": "Kwa kata moja kila wakati unapata vipande 2. Kwa kupunguzwa mbili unaweza kupata vipande 4. Kwa kupunguzwa mara tatu, ikiwa mikato yote itapita kwenye sehemu moja unapata vipande 6. Hata hivyo, unaweza kupata vipande 7 ikiwa kata ya tatu haipiti kwa hatua sawa na mbili zilizopita. Tumia wazo hili kupata nambari ya juu zaidi na kupunguzwa nne. Ili kupata vipande vingi, hakikisha kwamba hakuna zaidi ya kupunguzwa mbili hupitia hatua sawa, vinginevyo unapata vipande vidogo. Kwa kupunguzwa nne unaweza kupata vipande 11. Fanya vivyo hivyo tena kwa vipunguzi vitano, anza na vipunguzi vinne vinavyotoa vipande 7 na ongeza kata bila kupitia sehemu zozote za mikutano (makutano) na unaweza kupata vipande 16.",
  "If you were allowed to cut the cake in any direction, not just from the top, with just three cuts you could cut it into 8 pieces (rather than only 6)!": "Ikiwa uliruhusiwa kukata keki kwa mwelekeo wowote, sio tu kutoka juu, na kupunguzwa tatu tu unaweza kukata vipande 8 (badala ya 6 tu)!",
  "What is the biggest number of pieces of cake you can obtain with 7 cuts?": "Ni idadi gani kubwa ya vipande vya keki unaweza kupata kwa kupunguzwa 7?",
  "As the number of cuts increases, drawing and counting might be too complicated: can you spot the pattern in the sequence of numbers obtained from previous examples? For 7 cuts, first work out the answer for 6 cuts and then use this result.": "Kadiri idadi ya vipunguzi inavyoongezeka, kuchora na kuhesabu kunaweza kuwa ngumu sana: unaweza kuona muundo katika mlolongo wa nambari zilizopatikana kutoka kwa mifano iliyopita? Kwa kupunguzwa 7, kwanza tafuta jibu la kupunguzwa 6 na kisha utumie matokeo haya.",
  "You might realise that there is a formula for obtaining the next number in the sequence from the previous one. You can see this by working out the number of new pieces created when you add an extra cut. For example, adding a fourth cut to 7 pieces obtained from 3 cuts adds 4 new pieces (11). Adding a fifth cut to this adds 5 new pieces (16). (Can you see why this is true in general when thinking about how we cross the existing cuts to create the most pieces?)": "Unaweza kugundua kuwa kuna fomula ya kupata nambari inayofuata katika mlolongo kutoka kwa ile iliyotangulia. Unaweza kuona hili kwa kuhesabu idadi ya vipande vipya vilivyoundwa unapoongeza kata ya ziada. Kwa mfano, kuongeza kata ya nne kwa vipande 7 vilivyopatikana kutoka kwa kupunguzwa 3 huongeza vipande 4 vipya (11). Kuongeza kata ya tano kwa hii huongeza vipande 5 vipya (16). (Unaweza kuona ni kwa nini hii ni kweli kwa ujumla unapofikiria jinsi tunavyovuka vipunguzi vilivyopo ili kuunda vipande vingi zaidi?)",
  "So if C is the number of cuts and P(C) is the maximum number of pieces from C cuts, then the formula is:": "Kwa hivyo ikiwa C ndio nambari ya kupunguzwa na P (C) ndio idadi ya juu ya vipande kutoka kwa kupunguzwa kwa C, basi formula ni:",
  "P(C + 1) = P(C) + C + 1": "P(C + 1) = P(C) + C + 1",
  "Therefore:\nP(6) = P(5) + 5 + 1 = 16 + 6 = 22\nP(7) = P(6) + 6 + 1 = 22 + 7 = 29": "Kwa hivyo:\nP(6) = P(5) + 5 + 1 = 16 + 6 = 22\nP(7) = P(6) + 6 + 1 = 22 + 7 = 29",
  "Can you work out the biggest number of pieces you can get with 99 cuts?": "Je, unaweza kuhesabu idadi kubwa ya vipande unavyoweza kupata kwa kupunguzwa 99?",
  "We found the formula P(C + 1) = P(C) + C + 1 for the maximum number of pieces giving the cuts. However, this is not practical to use for the case of 99 cuts because we would first need to know the number of pieces for 98 cuts, and then the number of pieces for 97 cuts, and so on. You have to think how to get the explicit formula: P(C) = ½×C×(C + 1) + 1.": "Tulipata formula P (C + 1) = P (C) + C + 1 kwa idadi kubwa ya vipande vinavyotoa kupunguzwa. Hata hivyo, hii sio vitendo kutumia kwa kesi ya kupunguzwa 99 kwa sababu tungehitaji kwanza kujua idadi ya vipande kwa kupunguzwa 98, na kisha idadi ya vipande kwa kupunguzwa 97, na kadhalika. Lazima ufikirie jinsi ya kupata fomula iliyo wazi: P(C) = ½×C×(C + 1) + 1.",
  "Either by intuition or by using the formula to work back from P(C) to P(1):\nP(C) = P(C - 1) + C - 1 + 1": "Ama kwa angavu au kwa kutumia fomula kufanya kazi nyuma kutoka P(C) hadi P(1):\nP(C) = P(C - 1) + C - 1 + 1",
  "= P(C - 1) + C": "= P(C - 1) + C",
  "= P(C - 2) + (C - 1) + C": "= P(C - 2) + (C - 1) + C",
  "= P(C - 3) + (C - 2) + (C - 1)  + C": "= P(C - 3) + (C - 2) + (C - 1)  + C",
  "…": "…",
  "= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C": "= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C",
  "= 2 + (2 + 3 + … + C)": "= 2 + (2 + 3 + … + C)",
  "= 1 + (1 + 2 + 3 + … + C)": "= 1 + (1 + 2 + 3 + … + C)",
  "= 1 + ½×C×(C + 1)": "= 1 + ½×C×(C + 1)",
  "The last step is obtained from what we know about triangular numbers.\nTherefore, P(99) = ½×99×100 = 4951.": "Hatua ya mwisho inapatikana kutokana na kile tunachojua kuhusu nambari za pembetatu.\nKwa hiyo, P(99) = ½×99×100 = 4951.",
  "This problem is related to the number of regions (pieces of the cake) in a plane bounded by a generic configuration of lines (cuts). \"Generic\" means that there are no parallel lines and that no more than two lines intersect in the same points. This guarantees that the number of pieces of cake is maximal. Given C lines on a plane (in a generic configuration), then adding an extra line such that it intersects all the previous lines would create (C+1) new regions (around each intersection point of the new line with the previous ones, we add two new regions. However, one of the two is counted also in the next intersection point). This leads to P(C + 1) = P(C) + C + 1.": "Tatizo hili linahusiana na idadi ya mikoa (vipande vya keki) katika ndege iliyofungwa na usanidi wa generic wa mistari (kupunguzwa). \"Jenerali\" inamaanisha kuwa hakuna mistari inayofanana na kwamba hakuna zaidi ya mistari miwili inayokatiza katika sehemu sawa. Hii inahakikisha kwamba idadi ya vipande vya keki ni maximal. Kwa kuzingatia mistari ya C kwenye ndege (katika usanidi wa jumla), kisha kuongeza laini ya ziada ili inapita mistari yote iliyotangulia ingeunda (C+1) mikoa mipya (karibu na kila sehemu ya makutano ya laini mpya na ile iliyotangulia, sisi. ongeza mikoa miwili mipya.Hata hivyo, moja kati ya hiyo miwili imehesabiwa pia katika sehemu inayofuata ya makutano). Hii inasababisha P (C + 1) = P (C) + C + 1."
}