{
  "Restaurant": "Mkahawa",
  "At a restaurant each table has 3 legs, each chair has 4 legs and all the customers and the three members of staff have 2 legs each. There are four chairs at each table. Three quarters of the chairs are occupied by customers and there are 206 legs altogether in the restaurant. How many chairs does the restaurant have?": "Katika mgahawa kila meza ina miguu 3, kila kiti kina miguu 4 na wateja wote na wafanyikazi watatu wana miguu 2 kila mmoja. Kuna viti vinne kwenye kila meza. Robo tatu ya viti vinakaliwa na wateja na kuna miguu 206 kwa jumla katika mgahawa. Je, mgahawa una viti vingapi?",
  "Can you work out how many legs there are at each table if three quarters of the chairs have people on them?": "Je, unaweza kuhesabu ni miguu mingapi kwenye kila meza ikiwa robo tatu ya viti vina watu juu yake?",
  "The three members of staff have six legs so take this off the total, giving 206 - 6 = 200. Now the tables, chairs and customers have 200 legs. On average, at each table there are 3 table legs, 16 chair legs and 6 customer legs (as only three quarters of the chairs are taken).This gives 3 + 16 + 6 = 25 legs per table. The number of tables is therefore 200 ∕ 25 = 8, hence the number of chairs is 8×4 = 32.": "Wafanyikazi watatu wana miguu sita kwa hivyo ondoa jumla, ukitoa 206 - 6 = 200. Sasa meza, viti na wateja wana miguu 200. Kwa wastani, katika kila meza kuna miguu 3 ya meza, miguu 16 ya kiti na miguu 6 ya mteja (kama robo tatu tu ya viti huchukuliwa).Hii inatoa 3 + 16 + 6 = miguu 25 kwa meza. Kwa hiyo idadi ya meza ni 200 ∕ 25 = 8, hivyo idadi ya viti ni 8×4 = 32.",
  "This puzzle was originally a problem from a UKMT maths challenge": "Kitendawili hiki awali kilikuwa tatizo kutoka kwa changamoto ya hisabati ya UKMT",
  "I have 30 coins. Some of the coins are 1¢, some are 2¢ and some are 6¢. The value of the 6¢ coins is worth the same amount as the total value of the 1¢ coins and the 2¢ coins combined. Given that I have a different number of each type of coin, what is the total value of all of the coins (in ¢)?": "Nina sarafu 30. Baadhi ya sarafu ni 1¢, baadhi ni 2¢ na baadhi ni 6¢. Thamani ya sarafu 6¢ ina thamani ya kiasi sawa na thamani ya jumla ya sarafu 1¢ na sarafu 2¢ zikiunganishwa. Ikizingatiwa kuwa nina nambari tofauti ya kila aina ya sarafu, ni nini jumla ya thamani ya sarafu zote (katika ¢)?",
  "Start by considering how many 6¢ coins I could have...if I have too many, I won't be able to match their value with the 1¢ coins and the 2¢ coins.": "Anza kwa kuzingatia ni sarafu ngapi 6¢ ambazo ningeweza kuwa nazo...ikiwa ninazo nyingi sana, sitaweza kulinganisha thamani yake na sarafu 1¢ na sarafu 2¢.",
  "First we suppose we have 8×6¢ coins, this has a value of 48¢, with 22 coins remaining. The target value is always a multiple of six and therefore even, so we will require an even number of 1¢ to make the even number. The largest even total among the rest of the coins is 20x2¢ + 2x1¢  = 42¢, which is less than 48¢.": "Kwanza tuseme tuna sarafu 8 × 6 ¢, hii ina thamani ya 48 ¢, na sarafu 22 zilizobaki. Thamani inayolengwa kila wakati ni kizidishio cha sita na kwa hivyo hata, kwa hivyo tutahitaji nambari sawa ya 1¢ ili kufanya nambari sawa. Jumla kubwa hata kati ya sarafu zingine ni 20x2 ¢ + 2x1 ¢ = 42 ¢, ambayo ni chini ya 48¢.",
  "So at most we can have 7×6¢ = 42¢, with 23 coins remaining. In this case the largest even total is  21x2¢ + 2x1¢  = 44¢. Our target was 42¢, thus we include more 1¢ coins, and fewer 2¢ coins. The next highest even total is 19x2¢ + 4x1¢  = 42¢, hitting our target.": "Kwa hivyo zaidi tunaweza kuwa na 7×6¢ = 42¢, na sarafu 23 zilizosalia. Katika kesi hii jumla kubwa hata ni 21x2 ¢ + 2x1 ¢ = 44¢. Lengo letu lilikuwa 42¢, kwa hivyo tunajumuisha sarafu zaidi 1, na sarafu 2¢ chache. Jumla inayofuata ya juu kabisa ni 19x2¢ + 4x1¢ = 42¢, ikifikia lengo letu.",
  "Therefore the total value of all coins is 7×6¢ + 19x2¢ + 4x1¢ = 84¢.": "Kwa hiyo thamani ya jumla ya sarafu zote ni 7 × 6 ¢ + 19x2 ¢ + 4x1 ¢ = 84¢.",
  "For completeness, the smallest number of 6¢ coins is 5 (choosing 4 gives a total of  24¢ with 26 coins remaining). The solution with 5×6¢ is 5×2¢ and 10×1¢. The solution for 6×6¢ is 12×2¢ and 12×1¢. However neither of these solutions have a different amount of each coin.": "Kwa ukamilifu, nambari ndogo kabisa ya sarafu 6¢ ni 5 (kuchagua 4 kunatoa jumla ya 24¢ na sarafu 26 zilizobaki). Suluhisho na 5 × 6 ¢ ni 5 × 2 ¢ na 10 × 1 ¢. Suluhisho la 6 × 6 ¢ ni 12 × 2 ¢ na 12 × 1 ¢. Walakini, hakuna suluhisho hizi zilizo na kiwango tofauti cha kila sarafu."
}