{
  "Table Handshakes": "Kushikana mikono kwa meza",
  "If 8 people are seated around a circular table, in how many ways can all of them be simultaneously shaking hands with one other person at the table in such a way that none of the arms cross each other? (They have very long arms).": "Ikiwa watu 8 wameketi karibu na meza ya duara, ni kwa njia ngapi wote wanaweza kupeana mikono kwa wakati mmoja na mtu mwingine kwenye meza kwa njia ambayo hakuna mkono unaovuka kila mmoja? (Wana mikono mirefu sana).",
  "What is the answer if there are just 2 people, or 4 people, or 6 people. Can you find a way of making the cases with fewer people help you count the cases with more people?": "Jibu ni nini ikiwa kuna watu 2 tu, au watu 4, au watu 6. Je, unaweza kutafuta njia ya kufanya kesi na watu wachache kukusaidia kuhesabu kesi na watu wengi zaidi?",
  "For the case with 2 people there is just 1 way:": "Kwa kesi na watu 2 kuna njia 1 tu:",
  "For 4 people there are 2 ways:": "Kwa watu 4 kuna njia 2:",
  "For 6 people, we can consider the options for who number 1 shakes hands with. Number 1 cannot shake hands with number 3 or 5 as that would leave someone cut off from the group. If number 1 shakes hands with number 2 like this:": "Kwa watu 6, tunaweza kuzingatia chaguzi kwa nani nambari 1 anapeana mikono. Nambari ya 1 haiwezi kupeana mikono na nambari 3 au 5 kwani hiyo inaweza kumwacha mtu asiye na kikundi. Ikiwa nambari 1 inapeana mikono na nambari 2 kama hii:",
  "Then we know that the other four people can shake hands in 2 different ways (using our result from before). Number 1 could shake hands with number 6 and there would also be 2 different ways for the other four to shake hands. Finally number 1 could shake hands with number 4, and that would just leave one option:": "Kisha tunajua kwamba watu wengine wanne wanaweza kupeana mikono kwa njia 2 tofauti (kwa kutumia matokeo yetu kutoka hapo awali). Nambari 1 inaweza kupeana mikono na nambari 6 na pia kungekuwa na njia 2 tofauti za wengine wanne kupeana mikono. Mwishowe nambari ya 1 inaweza kupeana mikono na nambari 4, na hiyo ingeacha chaguo moja tu:",
  "So the result for 6 people is: 5 = 2 + 1 + 2.": "Kwa hivyo matokeo kwa watu 6 ni: 5 = 2 + 1 + 2.",
  "For eight people number 1 could shake hands with number 2 (leaving a group of 6 people which we now know there are 5 ways to shake hands), number 4 (leaving a group of 4, so 2 ways) number 6 (leaving a group of 4, so 2 ways) or number 6 (leaving a group of 6 so 5 ways). So the answer for eight people is 5 + 2 + 2 + 5.": "Kwa watu wanane nambari 1 inaweza kupeana mikono na nambari 2 (ikiacha kundi la watu 6 ambao sasa tunajua kuna njia 5 za kupeana mikono), nambari 4 (kuacha kundi la 4, kwa hivyo njia 2) nambari 6 (kuondoka kwenye kikundi ya 4, hivyo njia 2) au nambari 6 (kuacha kundi la 6 hivyo njia 5). Kwa hivyo jibu la watu wanane ni 5 + 2 + 2 + 5.",
  "The sequence of numbers we have discovered 1, 2, 5, 14, 42, ... are called <em>Catalan numbers</em> and they are crucial in the world of combinatorics. There is evidence of their use in China as far back as 1730, but they are named after the Belgian mathematician Eugène Charles Catalan (1814–1894).": "Mlolongo wa nambari ambazo tumegundua 1, 2, 5, 14, 42, ... zinaitwa <em>nambari za Kikatalani</em> na ni muhimu katika ulimwengu wa combinatorics. Kuna ushahidi wa matumizi yao nchini Uchina hadi 1730, lakini yanaitwa baada ya mwanahisabati wa Ubelgiji Eugène Charles Catalan (1814-1894).",
  "What if we have 10 people at the table? It may be useful to use previous results to help you!": "Je, ikiwa tuna watu 10 kwenye meza? Inaweza kuwa muhimu kutumia matokeo ya awali ili kukusaidia!",
  "Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted? Focus on when a fixed person shakes hands with another one: the problem splits into a left part and a right part where a lower number of people have to shake their hands.": "Kuhesabu kwa uwazi kunaweza kuwa ndefu sana. Je, unaweza kuja na njia ya kupunguza tatizo katika kesi rahisi ambazo tayari umehesabu? Kuzingatia wakati mtu fasta anapeana mikono na mwingine: tatizo linagawanyika katika sehemu ya kushoto na sehemu ya kulia ambapo idadi ya chini ya watu wanapaswa kupeana mikono yao.",
  "Let us number people from 1 to 10 counter-clockwise. Let us focus our attention on a fixed person, say person 1. When person 1 shakes hands with person number 2 there are 10 - 2 = 8 people on their left that have to shake hands. For them this is the problem we had before, with 8 people at the table they can shake hands in 14 different ways. Now imagine person 1 wants to shake hands with person 3: this would leave person 2 alone, since every attempt of the latter to shake hands with others would cross the handshaking of people 1 and 3. Therefore person 1 has to skip person 3 and shake hands with person 4. On their right they have people 2 and 3 who can only shake hands themselves in one way, whereas on their left they have 10 - 2 - 2 = 6 people who can shake hands in 5 ways (as calculated before), therefore we have 1×5 = 5 possibility in this case. Let us now consider people 1 and 5: there will be a person among people 2, 3, 4 who will remain alone, therefore person 1 has to move to person 6. In this case we will have 4 people on the right (people 2, 3, 4, 5) and four people on the left (people 7, 8, 9, 10). Each group can independently shake hands in 2 ways, therefore the total is 2×2 = 4. We continue with person 1 shaking hands with person 8 (obtaining 1×5 = 5 ways) and then with person 10 (obtaining 14 ways). We have exhausted all possible ways person 1 can shake hands, therefore above we have covered all possible cases, which add up to: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.": "Wacha tuhesabu watu kutoka 1 hadi 10 kinyume na saa. Wacha tuelekeze umakini wetu kwa mtu aliyewekwa, sema mtu 1. Wakati mtu 1 anapeana mikono na mtu nambari 2 kuna watu 10 - 2 = 8 upande wao wa kushoto ambao wanapaswa kupeana mikono. Kwao hili ndilo tatizo tulilokuwa nalo hapo awali, wakiwa na watu 8 kwenye meza wanaweza kupeana mikono kwa njia 14 tofauti. Sasa hebu fikiria mtu 1 anataka kupeana mikono na mtu wa 3: hii ingemwacha mtu wa 2 peke yake, kwani kila jaribio la mwisho la kupeana mikono na wengine lingevuka kupeana mikono kwa watu 1 na 3. Kwa hivyo mtu wa 1 lazima aruke mtu wa 3 na kutikisa mikono na mtu wa 4. Kwa upande wao wa kulia wana watu 2 na 3 ambao wanaweza tu kushikana mikono wenyewe kwa njia moja, ambapo upande wao wa kushoto wana 10 - 2 - 2 = watu 6 ambao wanaweza kupeana mikono kwa njia 5 (kama ilivyohesabiwa hapo awali) , kwa hiyo tuna 1 × 5 = 5 uwezekano katika kesi hii. Hebu sasa tuzingatie mtu 1 na watu 5: kutakuwa na mtu kati ya watu 2, 3, 4 ambaye atabaki peke yake, kwa hiyo mtu 1 anapaswa kuhamia mtu 6. Katika kesi hii tutakuwa na watu 4 upande wa kulia (watu 2 , 3, 4, 5) na watu wanne upande wa kushoto (watu7,8,9,10). Kila kikundi kinaweza kujitegemea kushikana mikono kwa njia 2, kwa hiyo jumla ni 2 × 2 = 4. Tunaendelea na mtu 1 kushikana mikono na mtu 8 (kupata 1 × 5 = njia 5) na kisha kwa mtu 10 (kupata njia 14). Tumetumia njia zote zinazowezekana mtu 1 anaweza kupeana mikono, kwa hivyo hapo juu tumeshughulikia kesi zote zinazowezekana, ambazo zinaongeza hadi: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.",
  "Thinking about the problem in this way leads to a formula to calculate the number of handshakes Hₙ where n is the (even) number of people at the table:": "Kufikiria juu ya shida kwa njia hii husababisha fomula ya kuhesabu idadi ya kupeana mikono Hₙ ambapo n ni idadi (hata) ya watu kwenye meza:",
  "Hₙ = Hₙ₋₂ + H₂×Hₙ₋₄ + H₄×Hₙ₋₆ + … + Hₙ₋₄×H₂ + Hₙ₋₂": "Hₙ = Hₙ₋₂ + H₂×Hₙ₋₄ + H₄×Hₙ₋₆ + … + Hₙ₋₄×H₂ + Hₙ₋₂",
  "For example, for 10 people at the table:": "Kwa mfano, kwa watu 10 kwenye meza:",
  "H₁₀ = H₈ + H₂×H₆+ H₄×H₄ + H₆×H₂ + H₈ = 14 + 1×5 + 2×2 + 5×1 + 14 = 42": "H₁₀ = H₈ + H₂×H₆+ H₄×H₄ + H₆×H₂ + H₈ = 14 + 1×5 + 2×2 + 5×1 + 14 = 42",
  "What if we have 14 people at the table? Can you use previous results to calculate the number of ways they can shake hands?": "Je, ikiwa tuna watu 14 kwenye meza? Je, unaweza kutumia matokeo ya awali kukokotoa idadi ya njia wanazoweza kupeana mikono?",
  "Let Hₙ be the number of ways n people shake hands. In the previous solutions we have calculated the numbers H₂, H₄,  H₆, H₈, and H₁₀. We know the formula for 14 people requires us to calculate for 12 people first. We therefore calculate": "Acha Hₙ iwe idadi ya njia n watu kupeana mikono. Katika masuluhisho yaliyotangulia tumekokotoa nambari H₂, H₄, H₆, H₈, na H₁₀. Tunajua fomula ya watu 14 inatuhitaji tuhesabu watu 12 kwanza. Kwa hivyo tunahesabu",
  "H₁₂ = H₁₀ + H₂×H₈ + … + H₈×H₂ + H₁₀ = 132": "H₁₂ = H₁₀ + H₂×H₈ + … + H₈×H₂ + H₁₀ = 132",
  "And likewise we can then calculate H₁₄ = 429.": "Na vivyo hivyo tunaweza kuhesabu H₁₄ = 429."
}