{
  "Triangular Slices": "Vipande vya pembetatu",
  "Consider the cake below – a six-sided hexagon. Now split it into triangles by cutting along diagonals that don't cross each other, one example is given in red. This splitting into triangles is called a triangulation, in how many ways can you do this?": "Fikiria keki hapa chini - hexagon ya upande sita. Sasa ugawanye katika pembetatu kwa kukata pamoja na diagonal ambazo hazivukani, mfano mmoja hutolewa kwa nyekundu. Kugawanyika huku katika pembetatu kunaitwa pembetatu, ni kwa njia ngapi unaweza kufanya hivi?",
  "In how many ways could you do it if the cake were a square? What if it were a five-sided pentagon? Can you use the symmetries of your cake to count faster?": "Je, ungeweza kufanya hivyo kwa njia ngapi ikiwa keki ingekuwa mraba? Je, ikiwa ni pentagoni yenye pande tano? Je, unaweza kutumia ulinganifu wa keki yako kuhesabu haraka?",
  "It is best to start with a simpler question and look for patterns. Start by looking at a square. There are two different ways we could slice the cake.": "Ni bora kuanza na swali rahisi na kutafuta mifumo. Anza kwa kuangalia mraba. Kuna njia mbili tofauti tunaweza kukata keki.",
  "For a pentagon there are five ways:": "Kwa pentagon kuna njia tano:",
  "For a hexagon there are 14 ways as you can see below:": "Kwa hexagon kuna njia 14 kama unaweza kuona hapa chini:",
  "In this diagram you can see the solution is found by thinking of 6 + 3 + 2 + 3 = 14, but you can arrive at the solution by doing 5 + 2 + 2 + 5 = 14 where 5 is the answer for a pentagon and 2 is the answer for a square. The equivalent combination for the pentagon is 2 + 1 + 2 = 5, where 1 is the result of the triangle (which has of course only one option) and 2 is the result for a square.": "Katika mchoro huu unaweza kuona suluhisho linapatikana kwa kufikiria 6 + 3 + 2 + 3 = 14, lakini unaweza kufikia suluhisho kwa kufanya 5 + 2 + 2 + 5 = 14 ambapo 5 ni jibu la pentagon na 2 ni jibu la mraba. Mchanganyiko sawa wa pentagon ni 2 + 1 + 2 = 5, ambapo 1 ni matokeo ya pembetatu (ambayo bila shaka ina chaguo moja tu) na 2 ni matokeo ya mraba.",
  "This is a more useful technique for moving on to thinking of polygons with more vertices.": "Hii ni mbinu muhimu zaidi ya kuendelea na kufikiria poligoni zilizo na wima zaidi.",
  "These Cₙ are called <em>Catalan numbers</em> and they are crucial in the world of combinatorics. There is an explicit formula for them, but finding it goes much beyond our scopes: the above recursive definition is more than enough for now! Interestingly there are many different puzzles that lead to these numbers (more than 200!) … perhaps you have seen another puzzle with the same answers?": "Cₙ hizi huitwa <em>Nambari za Kikatalani</em> na ni muhimu katika ulimwengu wa mchanganyiko. Kuna fomula wazi kwao, lakini kuipata kunapita zaidi ya upeo wetu: ufafanuzi wa kujirudia ulio hapo juu unatosha kwa sasa! Inashangaza kwamba kuna mafumbo mengi tofauti ambayo husababisha nambari hizi (zaidi ya 200!) ... labda umeona fumbo lingine lenye majibu sawa?",
  "Can you find the answer to the same question if the cake has the shape of a seven-sided heptagon?": "Je, unaweza kupata jibu la swali sawa ikiwa keki ina sura ya heptagon ya pande saba?",
  "Can you reuse previous results to compute this number? Counting explicitly might be too long. Can you come up with a way to reduce the problem in simpler cases you have already counted? Focus on when a fixed edge of the heptagon is present in a certain triangle. The heptagon is then split into two parts, the one at the left of the above triangle and the one at the right. Both parts are smaller...": "Je, unaweza kutumia tena matokeo ya awali kukokotoa nambari hii? Kuhesabu kwa uwazi kunaweza kuwa ndefu sana. Je, unaweza kuja na njia ya kupunguza tatizo katika kesi rahisi ambazo tayari umehesabu? Kuzingatia wakati makali ya kudumu ya heptagon iko katika pembetatu fulani. Kisha heptagoni imegawanywa katika sehemu mbili, moja upande wa kushoto wa pembetatu hapo juu na moja upande wa kulia. Sehemu zote mbili ni ndogo...",
  "Let us number the vertices of the heptagon from 1 to 7 counter-clockwise. Let us focus our attention on a fixed edge, say the one with vertices 1 and 2. When the edge is present in the triangle with the extra vertex 3, then the heptagon is split in that triangle and the hexagon at its left (with vertices 1, 3, 4, 5, 6, and 7). For the latter, the problem is the exact same you solved before, e.g. you get 14 ways of triangulating it. Then consider when the fixed edge forms a triangle with vertex 4. At the right of that triangle you have one triangle (with vertices 2, 3, and 4), whereas at the left you have a pentagon (with vertices 1, 4, 5, 6, and 7) for which we know you can do 5 triangulations. Therefore, this case provides you with 5×1 = 5 triangulations.\nLet us consider the case when the fixed edge forms a triangle with a vertex 5. Both at the right of that triangle and at the left you have one square: one with vertices 2, 3, 4, and 5, and the other with vertices 1, 5, 6, and 7. Each square can be independently triangulated in 2 ways, therefore, this case provides you with 2×2 = 4 triangulations.\nWe continue with the fixed edge forming a triangle with vertices 6 and then 7.\nWe have exhausted all possible ways the fixed edge can appear in a triangulation. Moreover in every possible triangulation every edge has to be part of a triangle. Therefore above we have covered all possible cases, which are adding up: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.": "Hebu tuhesabu wima ya heptagon kutoka 1 hadi 7 kinyume na saa. Wacha tuelekeze umakini wetu kwenye ukingo uliowekwa, sema ile iliyo na vipeo 1 na 2. Wakati ukingo upo kwenye pembetatu yenye kipeo cha ziada cha 3, basi heptagoni inagawanywa katika pembetatu hiyo na hexagon upande wake wa kushoto (pamoja na vipeo. 1, 3, 4, 5, 6, na 7). Kwa hili la mwisho, shida ni ile ile uliyosuluhisha hapo awali, k.m. unapata njia 14 za kuipanga pembetatu. Kisha zingatia wakati makali yasiyohamishika yanapotengeneza pembetatu yenye kipeo cha 4. Katika upande wa kulia wa pembetatu hiyo una pembetatu moja (yenye vipeo 2, 3, na 4), ambapo upande wa kushoto una pentagoni (yenye vipeo 1, 4, 5, 6, na 7) ambayo tunajua unaweza kufanya pembetatu 5. Kwa hiyo, kesi hii inakupa 5 × 1 = 5 triangulations.\nHebu tuzingatie kisa wakati makali yasiyohamishika yanaunda pembetatu yenye kipeo cha 5. Zote upande wa kulia wa pembetatu hiyo na upande wa kushoto una mraba mmoja: moja yenye vipeo 2, 3, 4, na 5, na nyingine ikiwa na vipeo. 1, 5, 6, na 7. Kila mraba inaweza kujitegemea triangulated kwa njia 2, kwa hiyo, kesi hii inakupa 2 × 2 = 4 triangulations.\nTunaendelea na makali yaliyowekwa kutengeneza pembetatu na wima 6 na kisha 7.\nTumetumia njia zote zinazowezekana kwamba makali yasiyobadilika yanaweza kuonekana katika utatuzi. Kwa kuongezea, katika kila pembetatu inayowezekana, kila kingo lazima kiwe sehemu ya pembetatu. Kwa hivyo hapo juu tumeshughulikia kesi zote zinazowezekana, ambazo zinaongeza: 14 + 1×5 + 2×2 + 5×1 + 14 = 42.",
  "We can find a formula for the number Cₙ of triangulations of the (n + 2)-gon. Generalising what we did before we have that:\nCₙ = Cₙ₋₁ + C₁×Cₙ₋₂ + C₂×Cₙ₋₃ + … + Cₙ₋₂×C₁ + Cₙ₋₁\nThe iᵗʰ summand corresponds to the number of triangulations possible when the fixed edge forms a triangle with the vertex (i + 2), where i is a number from 1 to n. By what we saw: C₁ = 1, C₂ = 2, C₃ = 5, C₄ = 14, C₅ = 42, … .": "Tunaweza kupata fomula ya nambari Cₙ ya pembetatu ya (n + 2)-gon. Kujumlisha kile tulichofanya kabla ya kuwa na hiyo:\nCₙ = Cₙ₋₁ + C₁×Cₙ₋₂ + C₂×Cₙ₋₃ + … + Cₙ₋₂×C₁ + Cₙ₋₁\nMuhtasari wa iᵗʰ unalingana na idadi ya pembetatu inayowezekana wakati ukingo uliowekwa hutengeneza pembetatu yenye kipeo (i + 2), ambapo i ni nambari kutoka 1 hadi n. Kwa kile tulichoona: C₁ = 1, C₂ = 2, C₃ = 5, C₄ = 14, C₅ = 42, ... .",
  "Can you find the answer to the same question if the cake has the shape of a nine-sided nonagon?": "Je, unaweza kupata jibu la swali lile lile ikiwa keki ina umbo la nonagon yenye pande tisa?",
  "So far, the result for 3, 4, 5, 6, and 7 sides, the results of which are 1, 2, 5, 14, and 42 respectively). To find 8 sides we can do 42 + 1×14 + 2×5 + 5×2 + 14×1 + 42 = 132. Finally for 9 sides we have 132 + 1×42 + 2×14 + 5×5 + 14×2 + 42×1+132 = 429": "Kufikia sasa, matokeo ya pande 3, 4, 5, 6 na 7, matokeo yake ni 1, 2, 5, 14 na 42 mtawaliwa). Ili kupata pande 8 tunaweza kufanya 42 + 1×14 + 2×5 + 5×2 + 14×1 + 42 = 132. Hatimaye kwa pande 9 tuna 132 + 1×42 + 2×14 + 5×5 + 14 ×2 + 42×1+132 = 429"
}