{
  "Twenty-one": "Ishirini na moja",
  "Two players take it in turn to count up, starting from 1 and counting 1, 2, or 3 numbers at a time. Each player continues counting from where the other player stops. The player who says 21 loses.": "Wachezaji wawili huchukua kwa zamu kuhesabu juu, kuanzia 1 na kuhesabu nambari 1, 2, au 3 kwa wakati mmoja. Kila mchezaji anaendelea kuhesabu kutoka ambapo mchezaji mwingine anasimama. Mchezaji anayesema 21 hupoteza.",
  "An example game: P1 = Player 1, P2 = Player 2.": "Mfano wa mchezo: P1 = Mchezaji 1, P2 = Mchezaji 2.",
  "P1: 1,2,3       P2: 4": "P1: 1,2,3       P2: 4",
  "P1: 5,6          P2: 7,8,9": "P1: 5,6          P2: 7,8,9",
  "P1: 10           P2: 11,12,13": "P1: 10           P2: 11,12,13",
  "P1: 14,15,16 P2:17,18,19": "P1: 14,15,16 P2:17,18,19",
  "P1: 20           P2: 21": "P1: 20           P2: 21",
  "Player 1 wins!": "Mchezaji 1 ameshinda!",
  "The person who says 20 wins, as they force the next person to say 21. How can you make sure you say 20? Try to work backwards. After you have played several times you might work out who is going to win before you reach 20 - think about how you know this. Can you work out if it is better to go first or second? Can you make sure you always win?": "Mtu anayesema 20 anashinda, kwani wanamlazimisha anayefuata kusema 21. Unawezaje kuhakikisha unasema 20? Jaribu kufanya kazi nyuma. Baada ya kucheza mara kadhaa unaweza kujua nani atashinda kabla ya kufikisha 20 - fikiria jinsi unavyojua hili. Je, unaweza kufanya kazi kama ni bora kwenda kwanza au pili? Je, unaweza kuhakikisha kuwa unashinda kila wakati?",
  "21 is a simple version of the set of games, Nim. It is sometimes called a Misère game - meaning a game that you play to lose. It is thought to have originated in China and is first mentioned in European history at the start of the 16ᵗʰ century. The game was originally played with 21 stones, and you have to pick 1, 2, or 3 stones at a time and the loser is the last one to pick a stone.": "21 ni toleo rahisi la seti ya michezo, Nim. Wakati mwingine huitwa mchezo wa Misère - kumaanisha mchezo ambao unacheza ili kupoteza. Inafikiriwa kuwa ilitoka Uchina na inatajwa mara ya kwanza katika historia ya Uropa mwanzoni mwa karne ya 16ᵗʰ. Mchezo huo ulichezwa kwa mawe 21, na lazima uchague mawe 1, 2, au 3 kwa wakati mmoja na aliyeshindwa ndiye wa mwisho kuchukua jiwe.",
  "There are many ways to change this game. You could be allowed to say up to 4 consecutive numbers instead of 3, or change the goal number of 21 to something different, or change the rule so that the player who says 21 is now the winner, not the loser. Can you still work out how to win when the rules are changed?": "Kuna njia nyingi za kubadilisha mchezo huu. Unaweza kuruhusiwa kusema hadi nambari 4 mfululizo badala ya 3, au kubadilisha nambari ya lengo la 21 hadi kitu tofauti, au kubadilisha sheria ili mchezaji anayesema 21 sasa ndiye mshindi, sio aliyeshindwa. Bado unaweza kufikiria jinsi ya kushinda wakati sheria zinabadilishwa?",
  "The original game can be changed to a group of players who play in a circle, starting clockwise. Just for fun you can have new rules that if someone says two numbers in a row, the direction is reversed. If someone says three numbers in a row you skip one person in the circle. The person to say 21 makes up a new rule e.g. \"Instead of the number 5 you have to say potato\". The game starts again at number 1 but you have to remember the new rule! If anyone makes a mistake you start again at 1. You can play that if someone makes two mistakes they are out of the game. The last person still playing is the winner!": "Mchezo wa asili unaweza kubadilishwa kuwa kikundi cha wachezaji wanaocheza kwenye mduara, kuanzia saa. Kwa kujifurahisha tu unaweza kuwa na sheria mpya ambazo mtu akisema nambari mbili mfululizo, mwelekeo unabadilishwa. Ikiwa mtu atasema nambari tatu mfululizo, unaruka mtu mmoja kwenye duara. Mtu wa kusema 21 anatunga sheria mpya k.m. \"Badala ya nambari 5 unapaswa kusema viazi.\" Mchezo unaanza tena kwa nambari 1 lakini lazima ukumbuke sheria mpya! Mtu yeyote akikosea unaanza tena saa 1. Unaweza kucheza kwamba mtu akifanya makosa mawili yuko nje ya mchezo. Mtu wa mwisho bado anacheza ndiye mshindi!"
}