{
  "Two Distances": "Umbali Mbili",
  "How many ways are there to draw four dots on a piece of paper such that whichever two dots you choose, the distance between these two points is one of only two possible values?": "Je, kuna njia ngapi za kuchora nukta nne kwenye kipande cha karatasi hivi kwamba hata nukta mbili utakazochagua, umbali kati ya nukta hizi mbili ni mojawapo ya thamani mbili zinazowezekana?",
  "Here is one correct example:": "Hapa kuna mfano mmoja sahihi:",
  "Try drawing an equilateral triangle. That will give you three points that are all the same distance from each other. Where could you put the fourth point?": "Jaribu kuchora pembetatu ya usawa. Hiyo itakupa pointi tatu ambazo zote ziko umbali sawa kutoka kwa kila mmoja. Unaweza kuweka wapi hoja ya nne?",
  "If we call the two distances \"short\" and \"long\", then any such drawing of points must have a triangle with one long and two short edges (it's not quite obvious, but if you think about it a bit you can eliminate all other possibilities). Now where does the last point go? To each of the other 3 points, it's connected either via a long or a short edge, giving 8 possibilities. Try out each of them, you will notice that 2 of them do not work out, leaving 6 solutions.": "Ikiwa tunaita umbali mbili \"fupi\" na \"nde\", basi mchoro wowote kama huo wa alama lazima uwe na pembetatu na kingo moja ndefu na mbili fupi (sio dhahiri kabisa, lakini ukifikiria kidogo unaweza kuondoa zingine zote. uwezekano). Sasa hoja ya mwisho inaenda wapi? Kwa kila moja ya alama zingine 3, imeunganishwa ama kupitia ukingo mrefu au mfupi, ikitoa uwezekano 8. Jaribu kila mmoja wao, utaona kuwa 2 kati yao haifanyi kazi, na kuacha suluhisho 6.",
  "Short edges are represented by <strong>blue</strong> while long edges are represented by <strong>green</strong>. One of these solutions can be extended to 5 points that only use two distances, see bottom right picture.": "Kingo fupi zinawakilishwa na <strong>bluu</strong> huku kingo ndefu zikiwakilishwa na <strong>kijani</strong>. Mojawapo ya suluhu hizi inaweza kupanuliwa hadi pointi 5 zinazotumia umbali mbili pekee, angalia picha ya chini kulia.",
  "Alex Bellos featured this puzzle in his column in the Guardian newspaper in the UK after hearing about it from maths juggler Colin Wright, who heard it from puzzle maven Peter Winkler.": "Alex Bellos aliangazia fumbo hili katika safu yake katika gazeti la Guardian nchini Uingereza baada ya kusikia kulihusu kutoka kwa mwanahisabati Colin Wright, ambaye alisikia kutoka kwa maven maven Peter Winkler.",
  "In how many different ways can you draw 4 points in the plane whose pairwise distances are √2, √2, 2, √10, √10 and 4?": "Je, unaweza kuchora pointi 4 kwa njia ngapi tofauti katika ndege ambayo umbali wa pande mbili ni √2, √2, 2, √10, √10 na 4?",
  "Try to figure out what kind of triangles you can make that use 3 of the 6 distances. If you have squared paper, it helps that it is possible to put all the vertices on the grid.": "Jaribu kubaini ni aina gani ya pembetatu unaweza kutumia kutumia umbali 3 kati ya 6. Ikiwa una karatasi ya mraba, inasaidia kwamba inawezekana kuweka wima zote kwenye gridi ya taifa.",
  "This set of distances is quite special! For most sets of pairwise distances, there is only one solution, but here there are two.": "Seti hii ya umbali ni maalum kabisa! Kwa seti nyingi za umbali wa jozi, kuna suluhisho moja tu, lakini hapa kuna mbili."
}