{
  "WinTwoThreeFour": "ShindaMbiliTatuNne",
  "Remove the 10, J, Q, K, and Jokers. Deal each player 9 cards (A = 1 here). Players secretly arrange their cards to make a 4-digit number, a 3-digit number and a 2-digit number. All at once, the players show their three numbers.": "Ondoa 10, J, Q, K, na Jokers. Shughulikia kila mchezaji kadi 9 (A = 1 hapa). Wachezaji hupanga kadi zao kwa siri ili kutengeneza nambari yenye tarakimu 4, nambari yenye tarakimu 3 na nambari yenye tarakimu 2. Wote mara moja, wachezaji wanaonyesha nambari zao tatu.",
  "The biggest 2-digit number gets 2 points, biggest 3-digit gets 3 points, biggest 4-digit gets 4 points. If there is a tie then the points are split between the players.": "Nambari kubwa zaidi ya tarakimu 2 inapata pointi 2, nambari 3 kubwa zaidi inapata pointi 3, kubwa zaidi ya tarakimu 4 inapata pointi 4. Ikiwa kuna sare basi pointi zinagawanywa kati ya wachezaji.",
  "You could play a certain number of rounds or play until a player gets to a certain score, e.g. 25.": "Unaweza kucheza idadi fulani ya raundi au kucheza hadi mchezaji afikie alama fulani, k.m. 25.",
  "It is tempting to focus on making your 4 digit number as big as possible, but maybe everyone else is trying to do this too! It is important to watch how your opponents are playing and try and adapt your strategy to beat them.": "Inajaribu kuzingatia kufanya nambari yako ya tarakimu 4 iwe kubwa iwezekanavyo, lakini labda kila mtu anajaribu kufanya hivi pia! Ni muhimu kutazama jinsi wapinzani wako wanavyocheza na ujaribu kurekebisha mkakati wako kuwashinda.",
  "This game featured in Andrew Jeffrey's Leader of the Pack book - which has 52 games and activities to do with a deck of cards. It is simple to understand the rules but very interesting to try and find a strategy to win.": "Mchezo huu umeangaziwa katika kitabu cha Kiongozi wa Kifurushi cha Andrew Jeffrey - ambacho kina michezo 52 na shughuli za kufanya na safu ya kadi. Ni rahisi kuelewa sheria lakini inavutia sana kujaribu na kutafuta mkakati wa kushinda.",
  "Try playing this so that the smallest 2-digit number gets 2 points, smallest 3-digit number gets 3 points and smallest 4-digit number gets 4 points.": "Jaribu kucheza hivi ili nambari ndogo kabisa yenye tarakimu 2 ipate pointi 2, nambari ndogo kabisa yenye tarakimu 3 ipate pointi 3 na nambari ndogo kabisa yenye tarakimu 4 ipate pointi 4."
}