{
  "Kaprekar's Number": "Nambari ya jina la Kaprekar",
  "Choose a four digit number where the digits are not all the same.": "Chagua nambari ya tarakimu nne ambapo tarakimu zote hazifanani.",
  "Rearrange the digits to get the largest and smallest possible numbers these digits can make.": "Panga upya tarakimu ili kupata nambari kubwa zaidi na ndogo zaidi zinazowezekana ambazo tarakimu hizi zinaweza kutengeneza.",
  "Subtract the smallest number from the largest to get a new number, and carry on repeating the operation for each new number. You will always end up at the same number.": "Ondoa nambari ndogo zaidi kutoka kwa kubwa zaidi ili kupata nambari mpya, na uendelee kurudia operesheni kwa kila nambari mpya. Utaishia kwa nambari sawa kila wakati.",
  "For example if you start with 4252, you should do the calculation 5422 - 2245 = 3177. Then do 7731 - 1377 and keep going.": "Kwa mfano ukianza na 4252, unapaswa kufanya hesabu 5422 - 2245 = 3177. Kisha fanya 7731 - 1377 na uendelee.",
  "You always end up with the number 6174. This is known as Kaprekar's number. For example 5432 – 2345 = 3087": "Kila mara unaishia na nambari 6174. Hii inajulikana kama nambari ya Kaprekar. Kwa mfano 5432 - 2345 = 3087",
  "8730 – 0378 = 8352": "8730 – 0378 = 8352",
  "8532 – 2358 = 6174": "8532 – 2358 = 6174",
  "7641 – 1467 = 6174": "7641 – 1467 = 6174",
  "What happens when you do this process with 3 digit numbers (where not all the digits are the same)? Can you explain why you always end up at the same number? Note that if you find 99 as an answer at any stage, this would then give 099 as the smallest number and 990 as the biggest.": "Ni nini hufanyika unapofanya mchakato huu na nambari za nambari 3 (ambapo sio nambari zote zinazofanana)? Je, unaweza kueleza kwa nini kila mara unaishia kwenye nambari sawa? Kumbuka kwamba ukipata 99 kama jibu katika hatua yoyote, hii ingetoa 099 kama nambari ndogo na 990 kama kubwa zaidi.",
  "For example, if you start with 792, the first calculation you have to do is 972 - 279 = 693. ": "Kwa mfano, ukianza na 792, hesabu ya kwanza unapaswa kufanya ni 972 - 279 = 693. ",
  "We can write a three digit number abc (imagine it is as big as possible) as 100×a + 10×b + c. If we rearrange the digits to make it as small as possible it would be cba which we can write as 100×c + 10×b + a. We then subtract to give 100×a + 10×b + c - (100×c + 10×b + a) = 99×a - 99×c = 99×(a - c). So after one step, the number will be a multiple of 99. The only 3 digit numbers that are multiples of 99 are 099, 198, 297, 396, 495, 594, 693, 792, 891, and 990. We only need to check the first five of these (as we will be rearranging the digits anyway) and we can verify that all of them end up giving the answer 495.": "Tunaweza kuandika nambari ya tarakimu tatu abc (fikiria ni kubwa iwezekanavyo) kama 100×a + 10×b + c. Ikiwa tutapanga upya tarakimu ili kuifanya iwe ndogo iwezekanavyo itakuwa cba ambayo tunaweza kuandika kama 100×c + 10×b + a. Kisha tunaondoa kutoa 100×a + 10×b + c - (100×c + 10×b + a) = 99×a - 99×c = 99×(a - c). Kwa hivyo baada ya hatua moja, nambari itakuwa kizidishio cha 99. Nambari 3 pekee ambazo ni zidishi za 99 ni 099, 198, 297, 396, 495, 594, 693, 792, 891, na 990. Tunahitaji tu angalia tano za kwanza kati ya hizi (kwani tutakuwa tukipanga nambari tena) na tunaweza kuthibitisha kuwa zote zinaishia kutoa jibu 495.",
  "D. R. Kaprekar (1905 - 1986) was an Indian school maths teacher who loved playing with numbers. He discovered a number of results in number theory and described various properties of numbers.": "D. R. Kaprekar (1905 - 1986) alikuwa mwalimu wa hesabu wa shule ya Kihindi ambaye alipenda kucheza na namba. Aligundua idadi ya matokeo katika nadharia ya nambari na akaelezea sifa mbalimbali za nambari."
}