{
  "Palindrome Cube": "Mchemraba wa Palindrome",
  "10662526601 = 2201³ is the only known palindromic cube whose cube root is not palindromic (a palindrome is a number that reads the same backwards as forwards).": "10662526601 = 2201³ ndio mchemraba pekee unaojulikana wa palindromic ambao mzizi wake wa mchemraba si palindromic (palindrome ni nambari inayosomeka kwa kurudi nyuma na mbele).",
  "Take the number 1030301. It is a palindrome. It's cube root is 101, which is also a palindrome. Can you find other examples that are both palindromes? (Remember that all one digit numbers are palindromes!)   ": "Chukua nambari 1030301. Ni palindrome. Mzizi wake wa mchemraba ni 101, ambayo pia ni palindrome. Je, unaweza kupata mifano mingine ambayo ni palindromes zote mbili? (Kumbuka kwamba nambari zote za tarakimu moja ni palindromes!)   ",
  "According to the On-line Encyclopedia of Integer Sequences, The sequence of positive integers whose cube is palindromic begins:": "Kulingana na Encyclopedia On-line of Integer Sequences, Mlolongo wa nambari kamili ambazo mchemraba wake ni palindromic huanza:",
  "1, 2, 7, 11, 101, 111, 1001, 2201, 10001, 10101, …": "1, 2, 7, 11, 101, 111, 1001, 2201, 10001, 10101, …",
  "The corresponding sequence of palindromic cubes begins:": "Mlolongo sambamba wa cubes palindromic huanza:",
  "1, 8, 343, 1331, 1030301, 1367631, 1003003001, 10662526601, 1000300030001, …": "1, 8, 343, 1331, 1030301, 1367631, 1003003001, 10662526601, 1000300030001, …",
  "2201 is the smallest (and only one known so far) which is itself non-palindromic. ": "2201 ndio ndogo zaidi (na moja tu inayojulikana hadi sasa) ambayo yenyewe sio ya ugonjwa wa ugonjwa. ",
  "There are 5 palindromic square numbers between 1 and 100 (inclusive) whose square root is also a palindrome. Can you find them all?": "Kuna nambari 5 za mraba za palindromic kati ya 1 na 100 (pamoja) ambazo mizizi yake ya mraba pia ni palindrome. Je, unaweza kuwapata wote?",
  "Remember all one digit numbers are palindromes.": "Kumbuka nambari zote za tarakimu moja ni palindromes.",
  "The five numbers are 1²=1, 2²=4, 3²=9, 11²=121, 22²=484": "Nambari tano ni 1²=1, 2²=4, 3²=9, 11²=121, 22²=484",
  "People have used computers to try and find another palindromic number whose cube root is not palindromic but no one has found one. This might be because there exists one that is bigger than the numbers that have been tested so far, or it might be that no more exist. ": "Watu wametumia kompyuta kujaribu kupata nambari nyingine ya palindromic ambayo mchemraba wake sio palindromic lakini hakuna mtu aliyeipata. Hii inaweza kuwa kwa sababu kuna moja ambayo ni kubwa kuliko nambari ambazo zimejaribiwa hadi sasa, au inaweza kuwa kwamba hazipo tena. "
}