{
  "Four Colours": "Rangi Nne",
  "It takes at most four colours to colour every map such that no two adjacent regions (regions that share a border) are the same colour.": "Inachukua angalau rangi nne kupaka kila ramani ili hakuna maeneo mawili ya karibu (maeneo ambayo yanashiriki mpaka) yana rangi sawa.",
  "Can you colour a map of Africa with five colours so that no two countries that touch are filled in with the same colour? Can you also succeed with four colours? How about three colours?": "Je, unaweza kupaka rangi kwenye ramani ya Afrika yenye rangi tano ili nchi mbili zinazogusa zisijazwe na rangi moja? Unaweza pia kufanikiwa kwa rangi nne? Vipi kuhusu rangi tatu?",
  "The four color theorem says that given any separation of a plane into contiguous regions, producing a figure called a map, no more than four colours are required to colour the regions of the map so that no two adjacent regions have the same colour. We can see why it is not possible with three colours by looking at the situation around Rwanda: ": "Nadharia hiyo ya rangi nne inasema kwamba kutokana na mgawanyiko wowote wa ndege katika maeneo yanayokaribiana, na kutoa kielelezo kinachoitwa ramani, si zaidi ya rangi nne zinazohitajika kupaka rangi maeneo ya ramani ili maeneo mawili ya karibu yasiwe na rangi sawa. Tunaweza kuona kwa nini haiwezekani kwa rangi tatu kwa kuangalia hali inayozunguka Rwanda: ",
  "If we try using red, blue and green we can get this far:": "Tukijaribu kutumia nyekundu, bluu na kijani tunaweza kufika hapa:",
  "But we can't colour Rwanda using red (because it shares a border with Uganda and Burundi) green (because of Tanzania) or blue (Democratic Republic of Congo). We definitely need another colour. ": "Lakini hatuwezi kuipaka rangi Rwanda kwa kutumia nyekundu (kwa sababu inapakana na Uganda na Burundi) kijani kibichi (kwa sababu ya Tanzania) au bluu (Jamhuri ya Kidemokrasia ya Kongo). Hakika tunahitaji rangi nyingine. ",
  "The proof that only four colours are needed is very tricky, but the extension will give you an insight into how it is done.": "Uthibitisho kwamba rangi nne tu zinahitajika ni gumu sana, lakini ugani utakupa ufahamu wa jinsi inafanywa.",
  "Can you draw a map with 12 countries such that every country has exactly five neighbours, and then colour it in using only 4 colours?": "Je, unaweza kuchora ramani na nchi 12 hivi kwamba kila nchi ina majirani watano, na kisha kuipaka rangi kwa kutumia rangi 4 pekee?",
  "Your map should essentially look like this:": "Ramani yako inapaswa kuonekana kama hii:",
  "The idea of the proof of the four colour theorem is to find necessary conditions for being a minimal counterexample (this means a minimal non-4-colourable map) and thus to concentrate on maps with these necessary conditions. One of these many necessary conditions is to show that in a minimal counterexample with 12 countries, all countries must have exactly five neighbours. However this can be coloured in like this:": "Wazo la uthibitisho wa nadharia ya rangi nne ni kupata masharti muhimu ya kuwa kielelezo kidogo zaidi (hii inamaanisha ramani ndogo isiyo na rangi 4) na hivyo kuzingatia ramani zilizo na masharti haya muhimu. Mojawapo ya masharti haya mengi muhimu ni kuonyesha kwamba kwa mfano mdogo na nchi 12, nchi zote lazima ziwe na majirani watano haswa. Walakini hii inaweza kupakwa rangi kama hii:",
  "The proof involves checking around 1500 maps like this!": "Uthibitisho unahusisha kuangalia karibu ramani 1500 kama hii!",
  "The proof of the four colour theorem was famously tricky, and comes from graph theory, where mathematicians investigate an equivalent problem of colouring vertices of a network so that no edge has endpoints the same colour. The original four-colour proof was attempted by<a href=\"https://en.wikipedia.org/wiki/Alfred_Kempe\"> </a>Alfred Kempe in 1879, but unfortunately Percy John Heawood found an error 11 years later. However his work was not useless, as Percy was able to prove the five-colour theorem (that one can colour a map with no two adjacent regions the sample colour using at most 5 colours) based on Kempe's work. The four colour theorem was finally proved in 1976 by Kenneth Appel, Wolfgang Haken, and John Koch using a computer to check it. This was the first major theorem to be proved using a computer. They checked around 1500 configurations using about 1200 hours of computer time. Some people were sceptical about a proof using a computer but independent verification soon convinced everyone that the four colour theorem had finally been proved.": "Uthibitisho wa nadharia ya rangi nne ulikuwa wa hila, na unatokana na nadharia ya grafu, ambapo wataalamu wa hisabati huchunguza tatizo sawa la kupaka rangi wima ya mtandao ili kusiwe na makali yenye ncha za rangi sawa. Uthibitisho wa awali wa rangi nne ulijaribiwa na<a href=\"https://en.wikipedia.org/wiki/Alfred_Kempe\"> </a>Alfred Kempe mwaka wa 1879, lakini kwa bahati mbaya Percy John Heawood alipata hitilafu miaka 11 baadaye. Walakini kazi yake haikuwa bure, kwani Percy aliweza kudhibitisha nadharia ya rangi tano (kwamba mtu anaweza kupaka rangi kwenye ramani bila maeneo mawili ya karibu sampuli ya rangi kwa kutumia zaidi ya rangi 5) kulingana na kazi ya Kempe. Nadharia hiyo ya rangi nne hatimaye ilithibitishwa mwaka wa 1976 na Kenneth Appel, Wolfgang Haken, na John Koch kwa kutumia kompyuta kuiangalia. Hii ilikuwa nadharia kuu ya kwanza kuthibitishwa kwa kutumia kompyuta. Walikagua karibu usanidi 1500 kwa kutumia takriban saa 1200 za wakati wa kompyuta. Baadhi ya watu walikuwa na mashaka kuhusu uthibitisho wa kutumia kompyuta lakini uthibitishaji wa kujitegemea upesi ulisadikisha kila mtu kwamba nadharia ya rangi nne hatimaye imethibitishwa."
}