{
  "Ramanujan": "Ramanujan",
  "1729 is the smallest number that can be written as a sum of two cubed numbers in two different ways.": "1729 ndio nambari ndogo zaidi inayoweza kuandikwa kama jumla ya nambari mbili za mraba kwa njia mbili tofauti.",
  "72 can be expressed as 2³ + 4³ but it is the only way with two positive cubes. Can you find the two ways to make 1729?": "72 inaweza kuonyeshwa kama 2³ + 4³ lakini ndiyo njia pekee yenye cubes mbili chanya. Unaweza kupata njia mbili za kutengeneza 1729?",
  "1³ + 12³ = 1 + 1728 = 1729 and also 9³ + 10³ = 729 + 1000 = 1729": "1³ + 12³ = 1 + 1728 = 1729 na pia 9³ + 10³ = 729 + 1000 = 1729",
  "If you change the problem to allow the cube of a negative number e.g. (-3)³=27 then the smallest number you can make is under a 100. Can you find the number and the two ways to make it?": "Ukibadilisha tatizo ili kuruhusu mchemraba wa nambari hasi k.m. (-3)³=27 basi nambari ndogo kabisa unayoweza kutengeneza iko chini ya 100. Je, unaweza kupata nambari na njia mbili za kuifanya?",
  "The number is between 90 and 100.": "Idadi ni kati ya 90 na 100.",
  "91 can be written as 6³+(-5)³ = 216 - 125 =91 or 4³+3³=64+27=91": "91 inaweza kuandikwa kama 6³+(-5)³ = 216 - 125 =91 au 4³+3³=64+27=91",
  "Bernard Frénicle de Bessy wrote about the number 1729 in 1657, but it was made popular by G. H. Hardy telling a story about Srinivasa Ramanujan in about 1919: \"I remember once going to see him when he was ill at Putney. I had ridden in taxi cab number 1729 and remarked that the number seemed to me rather a dull one, and that I hoped it was not an unfavourable omen. \"No,\" he replied, \"it is a very interesting number; it is the smallest number expressible as the sum of two cubes in two different ways.\" 1729 is now called a \"taxicab\" number. It is the second taxi cab number. The first is 2 because it is the smallest number that can be written in one way as the sum of two cubes. 87539319 is the third taxi cab number because it is the smallest number that can be written in three different ways as the sum of two cubes. No one knows what the taxicab numbers are above the 6th one. ": "Bernard Frénicle de Bessy aliandika kuhusu nambari 1729 mnamo 1657, lakini ilifanywa kuwa maarufu na G. H. Hardy akisimulia hadithi kuhusu Srinivasa Ramanujan mnamo 1919: \"Nakumbuka wakati mmoja nilienda kumwona alipokuwa mgonjwa huko Putney. Nilikuwa nimepanda teksi. cab namba 1729 na alisema kuwa idadi ilionekana kwangu badala ya mwanga mdogo, na kwamba nilitumaini haikuwa ishara mbaya. \"Hapana,\" alijibu, \"ni namba ya kuvutia sana; ni nambari ndogo zaidi inayoweza kuelezeka kama jumla ya cubes mbili kwa njia mbili tofauti.\" 1729 sasa inaitwa nambari ya \"taxicab\". Ni nambari ya pili ya teksi. Ya kwanza ni 2 kwa sababu ndiyo nambari ndogo zaidi inayoweza kuandikwa. kwa njia moja kama jumla ya cubes mbili 87539319 ni nambari ya tatu ya teksi kwa sababu ni nambari ndogo ambayo inaweza kuandikwa kwa njia tatu tofauti kama jumla ya cubes mbili. Hakuna anayejua nambari za teksi ziko juu ya 6. "
}