{
  "Abundant Numbers": "Hesabu Nyingi",
  "The integer 12 is the first <strong>abundant number</strong>. Its proper divisors (factors not including 12 itself)  are 1, 2, 3, 4, and 6 which add up to 16 which is more than 12. ": "Nambari kamili ya 12 ndiyo <strong>nambari tele</strong> ya kwanza. Vigawanyiko vyake vinavyofaa (sababu zisizojumuisha 12 yenyewe) ni 1, 2, 3, 4, na 6 ambayo hujumlisha hadi 16 ambayo ni zaidi ya 12. ",
  "You could make a 10 by 10 grid of the numbers 1 to 100 and colour in the abundant numbers.": "Unaweza kutengeneza gridi ya 10 kwa 10 ya nambari 1 hadi 100 na rangi katika nambari nyingi.",
  "The next abundant number is 20, because the proper divisors of 20 are 1,2,4,5, and 10 which add up to 22. Can you explain why prime numbers can never be abundant?   ": "Nambari kubwa inayofuata ni 20, kwa sababu vigawanyiko sahihi vya 20 ni 1,2,4,5, na 10 ambavyo vinajumlisha hadi 22. Unaweza kueleza kwa nini nambari kuu haziwezi kuwa nyingi?   ",
  "Numbers whose proper divisors add up to less than the number are called deficient numbers. ": "Nambari ambazo vigawanyiko sahihi vinajumlisha hadi chini ya nambari huitwa nambari zenye upungufu. ",
  "You could make a 10 by 10 grid of the numbers 1 to 100 and colour in the deficient numbers.": "Unaweza kutengeneza gridi ya 10 kwa 10 ya nambari 1 hadi 100 na upake rangi katika nambari zenye upungufu.",
  "An example of a deficient number is 15, because 1,3, and 5 add up to 9 which is less than 15.": "Mfano wa nambari yenye upungufu ni 15, kwa sababu 1,3, na 5 zinaongeza hadi 9 ambayo ni chini ya 15.",
  "Take the proper divisors of 6, they are 1,2, and 3 which adds up perfectly to 6.": "Chukua vigawanyo vinavyofaa vya 6, ni 1,2, na 3 ambavyo vinajumlisha kikamilifu hadi 6.",
  "6 is the smallest perfect number. Can you find the only other perfect number below 100?": "6 ndio nambari ndogo kabisa kamili. Je, unaweza kupata nambari nyingine kamili chini ya 100?",
  "The first known classification of numbers as deficient, perfect or abundant was by Nicomachus in his Introductio Arithmetica (circa 100)": "Uainishaji wa kwanza unaojulikana wa nambari kama pungufu, kamili au nyingi uliwekwa na Nikomachus katika Introductio Arithmetica yake (takriban 100)"
}