{
  "Collatz Conjecture": "Dhana ya Collatz",
  "Think of a positive integer (whole number). If it is even, divide it by 2. It if is odd, multiply it by 3 and add 1. Repeat the process with your new number and keep going. Stop if you get to the number 1. Nobody knows if a number exists that doesn't end up at 1.": "Fikiria nambari chanya (nambari nzima). Ikiwa ni sawa, igawanye kwa 2. Ikiwa ni isiyo ya kawaida, izidishe kwa 3 na uongeze 1. Rudia mchakato huo na nambari yako mpya na uendelee. Simamisha ukifika nambari 1. Hakuna anayejua kama kuna nambari ambayo haiishii 1.",
  "For example, if you choose the number 6 you would get this sequence 6, 3, 10, 5, 16, 8, 4, 2, 1. So it took 8 steps to get to 1. Try some numbers of your own.": "Kwa mfano, ukichagua nambari 6 utapata mfuatano huu 6, 3, 10, 5, 16, 8, 4, 2, 1. Kwa hivyo ilichukua hatua 8 kufikia 1. Jaribu nambari zako mwenyewe.",
  "This activity is interesting because it is easy to understand the rules and start generating sequences, but no one knows whether all numbers end up at 1; it is an unsolved problem in mathematics. The longest sequence for a number smaller than 100 is for 97, which takes 118 steps but finally gets to 1. The number just before, 96, only takes 12 steps! Using computers, all numbers up to roughly 2.95×10²⁰ have been checked and they all go to 1.": "Shughuli hii inavutia kwa sababu ni rahisi kuelewa sheria na kuanza kutoa mfuatano, lakini hakuna anayejua ikiwa nambari zote zinaishia 1; ni tatizo ambalo halijatatuliwa katika hisabati. Mfuatano mrefu zaidi wa nambari ndogo kuliko 100 ni 97, ambayo inachukua hatua 118 lakini hatimaye inafika 1. Nambari iliyotangulia, 96, inachukua hatua 12 tu! Kwa kutumia kompyuta, nambari zote hadi takriban 2.95×10²⁰ zimeangaliwa na zote huenda kwa 1.",
  "What is the biggest number that takes exactly 8 steps to get to 1?": "Ni nambari gani kubwa inayochukua hatua 8 kufikia 1?",
  "Which type of numbers go very quickly towards 1 because they always follow the halving rule?": "Ni aina gani ya nambari zinazoenda haraka sana kuelekea 1 kwa sababu daima hufuata kanuni ya kugawanya nusu?",
  "The shortest sequences are the ones where you can always half the numbers. That means they are powers of 2, e.g. 1, 2, 4, 8, 16, 32 etc. as these numbers \"snowball\" to 1. 256 gets to 1 to 8 steps, always by halving: 256, 128, 64, 32, 16, 8, 4, 2, 1.": "Mlolongo mfupi zaidi ni wale ambapo unaweza daima nusu ya nambari. Hiyo ina maana ni nguvu za 2, k.m. 1, 2, 4, 8, 16, 32 n.k. kwani nambari hizi \"mpira wa theluji\" hadi 1. 256 hufikia hatua 1 hadi 8, kila mara kwa kupunguza nusu: 256, 128, 64, 32, 16, 8, 4, 2, 1.",
  "The conjecture is named after Lothar Collatz, who introduced the idea in 1937, two years after receiving his doctorate. Many people since Collatz have tried to find a sequence that doesn't go to 1, or to prove that all sequences go to 1 and no one has succeeded. There are several prizes if you succeed! On the 8th of September 2019, Terence Tao produced a proof, using sampling of numbers, that almost all numbers eventually reach a value that is quite close to 1. Roughly speaking he proved that 99% of starting values greater than 1 quadrillion eventually reach a value below 200. This is a huge step forward for such a difficult problem! ": "Dhana hiyo imepewa jina la Lothar Collatz, ambaye alianzisha wazo hilo mnamo 1937, miaka miwili baada ya kupata udaktari wake. Watu wengi tangu Collatz wamejaribu kutafuta mlolongo ambao hauendi kwa 1, au kuthibitisha kuwa mfuatano wote unaenda 1 na hakuna aliyefaulu. Kuna zawadi kadhaa ikiwa utafanikiwa! Mnamo tarehe 8 Septemba 2019, Terence Tao alitoa uthibitisho, kwa kutumia sampuli za nambari, kwamba karibu nambari zote hatimaye hufikia thamani ambayo ni karibu kabisa na 1. Kwa kusema alithibitisha kwamba 99% ya maadili ya kuanzia yaliyo zaidi ya quadrillion hatimaye hufikia thamani chini ya 200. Hii ni hatua kubwa mbele kwa tatizo hilo gumu! "
}