{
  "Stop or Dare": "Acha au Uthubutu",
  "This is a game for two or three players. Shuffle the deck and place it face down. The first player turns over the top card and continues turning over cards, adding together the value of each card, until they decide to stop and record their score. J = 11 and Q = 12.": "Huu ni mchezo wa wachezaji wawili au watatu. Changanya staha na kuiweka uso chini. Mchezaji wa kwanza anageuza kadi ya juu na kuendelea kugeuza kadi, na kuongeza pamoja thamani ya kila kadi, hadi anaamua kuacha na kurekodi alama zao. J = 11 na Q = 12.",
  "If an A or a K is turned over, no points are scored in that turn and the turn is finished.": "Ikiwa A au K imegeuzwa, hakuna pointi zinazopatikana katika zamu hiyo na zamu imekamilika.",
  "Players take turns until someone reaches 100 or more - this player is the winner.": "Wachezaji hupokezana hadi mtu afikishe 100 au zaidi - mchezaji huyu ndiye mshindi.",
  "If the cards are all turned over before the target is reached, just reshuffle the pack and continue. ": "Ikiwa kadi zote zimegeuzwa kabla ya lengo kufikiwa, changanya tu pakiti na uendelee. ",
  "Try and keep count of how many K and A cards have come up already. This could change how daring you are feeling. If someone else is close to 100 it might be best to turn over more cards than you would normally.": "Jaribu na uhesabu ni kadi ngapi za K na A ambazo tayari zimepatikana. Hii inaweza kubadilisha jinsi unavyohisi kuthubutu. Ikiwa mtu mwingine anakaribia 100 inaweza kuwa bora kugeuza kadi zaidi kuliko kawaida.",
  "You could try changing the target number, or changing how many cards wipe out your score for that turn. You could also try having K as resetting your <strong>entire</strong> score to zero to make it more daring.": "Unaweza kujaribu kubadilisha nambari inayolengwa, au kubadilisha ni kadi ngapi kufuta alama zako kwa zamu hiyo. Unaweza pia kujaribu kuwa na K kama kuweka upya alama zako za <strong>zima</strong> hadi sufuri ili kuifanya iwe ya kuthubutu zaidi.",
  "This game can also be played with Dice and is sometimes called Pig. There are one and two dice versions, and even a version where you can choose how many dice to throw rather than how many times to throw a set number of dice.": "Mchezo huu pia unaweza kuchezwa na Kete na wakati mwingine huitwa Nguruwe. Kuna matoleo ya kete moja na mbili, na hata toleo ambapo unaweza kuchagua ni kete ngapi za kutupa badala ya mara ngapi kurusha seti ya kete."
}