{
  "Sim": "Sim",
  "Draw six points in a hexagonal arrangement. Players take turns to draw a straight line between any two points, trying to avoid making a triangle. Each player should use a different colour. The player that completes a triangle with their colour first loses the game.": "Chora pointi sita katika mpangilio wa hexagonal. Wachezaji hubadilishana kuchora mstari wa moja kwa moja kati ya pointi zozote mbili, wakijaribu kuzuia kutengeneza pembetatu. Kila mchezaji anapaswa kutumia rangi tofauti. Mchezaji anayekamilisha pembetatu kwa rangi yake kwanza hupoteza mchezo.",
  "You might want to draw all the possible lines between the points to start with and then colour over them. This would make the game a bit easier to play. If you don't have two different colours you could use solid and dotted lines for the two players. ": "Unaweza kutaka kuchora mistari yote inayowezekana kati ya alama za kuanza na kisha upake rangi juu yao. Hii itafanya mchezo kuwa rahisi kucheza. Ikiwa huna rangi mbili tofauti unaweza kutumia mistari thabiti na yenye vitone kwa wachezaji hao wawili. ",
  "Try to make moves in a way that removes options from your opponent. You might want to try and complete triangles that are of mixed colour.": "Jaribu kufanya hatua kwa njia ambayo huondoa chaguo kutoka kwa mpinzani wako. Unaweza kutaka kujaribu na kukamilisha pembetatu ambazo ni za rangi mchanganyiko.",
  "Draw a 5 by 5 grid of dots. Two players take it in turn to colour a dot (use different colours or an x and a +). The winner is the first player to make a square with four of their points. Squares can be tilted as well as straight.": "Chora gridi ya 5 kwa 5 ya nukta. Wachezaji wawili huchukua kwa zamu kupaka rangi ya nukta (tumia rangi tofauti au x na +). Mshindi ndiye mchezaji wa kwanza kutengeneza mraba na alama nne kati ya hizo. Mraba inaweza kuinamishwa pamoja na moja kwa moja.",
  "The Sim pencil game was invented in 1969 by Gustavus Simmons, a cryptographer, who described it in the Journal of Recreational Mathematics. Frank P. Ramsey proved that there always has to be a winner in this game by the \"Theorem on Friends and Strangers\". He showed that on completing all the edges of the graph, there must be one triangle that is all the same colour.": "Mchezo wa penseli wa Sim ulivumbuliwa mnamo 1969 na Gustavus Simmons, mwandishi wa maandishi, ambaye aliuelezea katika Jarida la Hisabati ya Burudani. Frank P. Ramsey alithibitisha kwamba lazima kuwe na mshindi katika mchezo huu kwa \"Theorem on Friends and Strangers\". Alionyesha kwamba wakati wa kukamilisha kingo zote za grafu, lazima kuwe na pembetatu moja ambayo ni rangi sawa."
}