{
  "Twenty-four": "Ishirini na nne",
  "Remove the 10, J, Q, K, and Joker cards from the deck. Shuffle the rest and deal four cards face up on the table so that every player can see them. Each player attempts to make the number 24 silently using all four numbers (A count as 1), and as many operations +, −, × and ÷ and brackets () as needed. The first person to give an answer with an explanation wins and keeps the 4 cards. Keep playing until there are no cards left.": "Ondoa kadi 10, J, Q, K, na Joker kutoka kwenye staha. Changanya zilizosalia na ushughulikie kadi nne zikitazama kwenye meza ili kila mchezaji aweze kuziona. Kila mchezaji anajaribu kufanya nambari 24 kimya kwa kutumia nambari zote nne (Hesabu A kama 1), na shughuli nyingi +, −, × na ÷ na mabano () inavyohitajika. Mtu wa kwanza kutoa jibu kwa maelezo atashinda na kubakisha kadi 4. Endelea kucheza hadi hakuna kadi zilizobaki.",
  "This is a game for two or more players. ": "Huu ni mchezo wa wachezaji wawili au zaidi. ",
  "A few combinations might be impossible. In this case, put the cards back and shuffle again to choose another 4. ": "Mchanganyiko machache inaweza kuwa haiwezekani. Katika kesi hii, rudisha kadi nyuma na uchanganye tena ili kuchagua nyingine 4. ",
  "Think of the factors of 24 to cover i.e, 1×24, 2×12, 3×8, and 4×6. If you have either of the factors in your list, say 1, 2, 3, 4, 6, 8, …  use the remaining numbers to make the other number, or use your numbers to create combinations.": "Fikiria vipengele vya 24 vya kufunika yaani, 1×24, 2×12, 3×8, na 4×6. Ikiwa una mojawapo ya vipengele kwenye orodha yako, sema 1, 2, 3, 4, 6, 8, … tumia nambari zilizosalia kutengeneza nambari nyingine, au tumia nambari zako kuunda michanganyiko.",
  "You can play this game like Snap, with 2 or 4 players. Deal the cards (without the 10, J, Q, K, or Jokers) equally to all players. For two players, on the count of three, they each turn over the top two cards from their pile. For four players, they each just turn over one card. Everyone tries to make 24 using all four cards. The first person to do so takes the cards and puts them at the bottom of their pile. Play continues until one player has run out of cards - then the player with the most cards is the winner.": "Unaweza kucheza mchezo huu kama Snap, na wachezaji 2 au 4. Tumia kadi (bila 10, J, Q, K, au Jokers) kwa usawa kwa wachezaji wote. Kwa wachezaji wawili, kwa hesabu ya watatu, kila mmoja hugeuza kadi mbili za juu kutoka kwenye rundo lao. Kwa wachezaji wanne, kila mmoja anageuza kadi moja. Kila mtu anajaribu kutengeneza 24 kwa kutumia kadi zote nne. Mtu wa kwanza kufanya hivyo huchukua kadi na kuziweka chini ya rundo lao. Mchezo unaendelea hadi mchezaji mmoja ameishiwa na kadi - basi mchezaji aliye na kadi nyingi ndiye mshindi.",
  "The number 24 is used because it has so many factors. However, an analysis of all the possible combinations of 4 cards shows that the number 2 would have been the best target number! 99.19% of the combinations could be solved, compared to 80.20% for 24. If you are allowed to use factorials (e.g. 3! = 3×2×1 = 6), then you can solve many more combinations for 24.": "Nambari 24 inatumika kwa sababu ina mambo mengi. Hata hivyo, uchanganuzi wa michanganyiko yote inayowezekana ya kadi 4 unaonyesha kuwa nambari 2 ingekuwa nambari bora zaidi inayolengwa! 99.19% ya michanganyiko inaweza kutatuliwa, ikilinganishwa na 80.20% kwa 24. Ikiwa unaruhusiwa kutumia factorials (k.m. 3! = 3×2×1 = 6), basi unaweza kutatua michanganyiko mingi zaidi kwa 24."
}