{
  "Card Sums": "Somme des cartes",
  "Remove the 10, J, Q, K, and Joker cards and shuffle the rest of the pack.": "Retirez les cartes 10, J, Q, K et Joker et mélangez le reste du paquet.",
  "Any number of players can play. Deal 6 cards face up on a table. Everyone has 1 minute to decide how to set them out in the layout above to make the biggest total of the two multiplications. A counts as 1. The player with the highest score wins.": "N'importe quel nombre de joueurs peut jouer. Distribuez 6 cartes face visible sur une table. Chacun a 1 minute pour décider comment les disposer dans le schéma ci-dessus afin d'obtenir le plus grand total des deux multiplications. A compte pour 1. Le joueur avec le score le plus élevé gagne.",
  "It might help if everyone has pen and paper. After one minute, everyone says their highest total. The person who says the highest number explains how they came to that number, by arranging the cards. If they are correct they win a point, if incorrect, the person with the next highest total attempts to justify their answer. If two people have the same answer they get a point each.": "Cela pourrait aider si tout le monde avait un stylo et du papier. Après une minute, chacun annonce son total le plus élevé. La personne qui prononce le nombre le plus élevé explique comment elle est parvenue à ce nombre, en disposant les cartes. S'ils ont raison, ils gagnent un point, s'ils sont incorrects, la personne ayant le total suivant le plus élevé tente de justifier sa réponse. Si deux personnes ont la même réponse, elles gagnent chacune un point.",
  "Think about where it is going to be best to place the biggest numbers.": "Pensez à l’endroit où il sera préférable de placer les plus grands nombres.",
  "These games feature in Andrew Jeffrey's Leader of the Pack book - which has 52 games and activities to do with a deck of cards. There is a perfect strategy to the main game.": "Ces jeux figurent dans le livre Leader of the Pack d'Andrew Jeffrey, qui propose 52 jeux et activités à réaliser avec un jeu de cartes. Il existe une stratégie parfaite pour le jeu principal.",
  "With the J, Q, K, and Joker cards removed, deal 4 cards to each player. Each player has to make two fractions with their cards which can be added, subtracted, multiplied or divided to try to make the answer as close to 1 as possible. Anyone who can make 1 exactly gets 2 points. If no one can make 1 then the closest to 1 gets 1 point.": "Une fois les cartes J, Q, K et Joker retirées, distribuez 4 cartes à chaque joueur. Chaque joueur doit faire deux fractions avec ses cartes qui peuvent être additionnées, soustraites, multipliées ou divisées pour essayer de rendre la réponse la plus proche possible de 1. Quiconque parvient à en faire 1 obtient exactement 2 points. Si personne ne peut faire 1, alors le plus proche de 1 obtient 1 point."
}