{
  "Colouring": "Coloriage",
  "How many possible three-stripe flags similar to the one below are there if only 5 colours are available and two touching stripes must NOT have the same colour.": "Combien de drapeaux tricolores similaires à celui ci-dessous y a-t-il si nous disposons seulement de 5 couleurs. Deux bandes juxtaposées ne peuvent PAS être de la même couleur.",
  "Think about how many different colours could go in the first section, then the second ...": "Pensez au nombre de couleurs différentes qui pourraient être utilisées dans la première bande, puis la deuxième, ...",
  "There is a choice of 5 colours for the first section. Once a colour has been chosen, the second section cannot be the same. So there are only four colours to choose from for the second section. For the third section, there are four colours to choose from, as it cannot be the same colour as the second one yet it can be the same colour as the first one. Thus, the number of tricolour flags with 5 colours to choose from are 5×4×4 = 80.": "Il y a 5 choix possibles pour la première bande. Dès qu’une couleur a été choisie, la deuxième bande ne peut être de la même couleur. Il n’y a donc que quatre couleurs à choisir pour la deuxième bande. Pour la troisième bande, il y a 4 couleurs au choix, car elle ne peut pas être de la même couleur que la deuxième, mais elle peut être de la même couleur que la première. Ainsi, le nombre de drapeaux tricolores avec 5 couleurs au choix vaut 5 × 4 × 4 = 80.",
  "In a room with an even number of walls, two colors are always enough. For rooms with an odd number of walls, you will need three colors.": "Dans une pièce comportant un nombre pair de murs, deux couleurs sont suffisantes. Pour les pièces avec un nombre impair de murs, vous aurez besoin de trois couleurs.",
  "In how many different ways can I paint the five walls of a pentagonal room using red, blue and green paint so that no two neighbouring walls are the same colour?": "De combien de manières différentes puis-je peindre les cinq murs d'une pièce pentagonale avec de la peinture rouge, bleue et verte de sorte que deux murs voisins ne soient de la même couleur ?",
  "Fix one colour, say start with the top wall red, and try to list all the different options for the other walls.": "Choisissez une couleur, par exemple, peignez le toit en rouge et essayez de lister toutes les différentes options pour les autres murs.",
  "First of all you start with either red, blue or green and use one of the other colours for the second side and so on around the pentagon. When you get to the last side it cannot be the same as the fourth side or the first one.": "Tout d'abord, vous pouvez commencer par le rouge, le bleu ou le vert et utilisez l'une des autres couleurs pour le deuxième côté et ainsi de suite autour du pentagone. Lorsque vous arrivez au dernier côté, il ne peut pas être de même couleur que le quatrième ou le premier côté.",
  "We can represent the choices of colours in a tree diagram, At the top (known as the root of the tree) we paint the first side. Here we choose red). The first split is the choice of either green or blue for the second side. The next split is the choice for the third side which depends on your choice of the second side. Any path from the root to end of the tree (known as a leaf) gives you a choice for all of the five edges. We see if we started with red, we have 10 different colourings.": "Nous pouvons représenter les choix de couleurs dans un diagramme d'arbre, au sommet (connu comme la racine de l'arbre) nous peignons le premier côté. Ici, nous choisissons le rouge. La première ramification est le choix du vert ou du bleu pour le deuxième côté. La prochaine ramification est le choix du troisième côté qui dépend de votre choix du deuxième côté. Tout chemin allant de la racine à la fin de l'arbre (appelé feuille) vous donne un choix pour les cinq côtés. Nous voyons que si nous commençons par le rouge, nous avons 10 colorations différentes.",
  "As we can make similar diagrams if we had chosen green or blue in the first position, we have a total of 3×10 = 30 different colourings.": "Comme nous pouvons obtenir des diagrammes similaires si nous avions choisi le vert ou le bleu en première position, nous avons un total de 3 × 10 = 30 colorations différentes."
}