{
  "Dealing Cards": "Dealing Cards",
  "Children are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, and a Queen to every third child.": "Les enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant et une Reine à chaque troisième enfant.",
  "After going around four times, the sixth child in the circle from where the teacher started has two Jacks and two Queens.": "Après avoir fait quatre fois le tour, le sixième enfant dans le cercle, à partir d'où l'enseignant a commencé, a deux Valets et deux Dames.",
  "What is the smallest possible number of children in the circle?": "Quel est le plus petit nombre possible d’enfants dans le cercle ?",
  "Must there be an even or an odd number of children in the circle?": "Doit-il y avoir un nombre pair ou impair d'enfants dans le cercle ?",
  "The teacher goes round the circle four times. If there was an even number of children, the sixth child would always receive a Jack each time and would have four Jacks by the end. Since they only have two Jacks, there must be an odd number of children in the circle.": "L'enseignant fait le tour du cercle quatre fois. S'il y avait un nombre pair d'enfants, le sixième enfant recevrait toujours un Valet à chaque fois et aurait quatre Valets à la fin. Puisqu'ils n'ont que deux Valets, il doit y avoir un nombre impair d'enfants dans le cercle.",
  "The sixth child receives a Queen in the first round because 6 is a multiple of 3. She only receives one more Queen so the answer can't be a multiple of 3.": "Le sixième enfant reçoit une Reine lors du premier tour parce que 6 est un multiple de 3. Elle ne reçoit qu'une seule Reine de plus, la réponse ne peut donc pas être un multiple de 3.",
  "The options are 7, 11, 13, 17, 19 … and so 7 is the fewest number of children.": "Les options sont 7, 11, 13, 17, 19 … et donc 7 est le plus petit nombre d'enfants.",
  "This puzzle was written by a student at the Lycee Francais Charles de Gaulle for a Christmas puzzle involving handing out red and blue presents.": "Cette énigme a été écrite par un étudiant au Lycée français Charles de Gaulle pour une énigme de Noël impliquant la distribution de cadeaux rouges et bleus.",
  "Children are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, a Queen to every third child and a King to every fifth child.": "Les enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant, une Reine à chaque troisième enfant et un Roi à chaque cinquième enfant.",
  "After going around four times, the sixth child from where the teacher started has four Jacks, two Queens and no Kings.": "Après avoir fait quatre tours, le sixième enfant, d’où l'enseignant a commencé, a quatre Valets, deux Reines et pas de Rois.",
  "What is the fewest amount of children could there be?": "Quel devrait être le plus petit nombre d'enfants ?",
  "Think about whether the number needs to be odd or even and if it needs to be divisible by 3 or 5.": "Imaginez si le nombre doit être impair ou pair et s'il doit être divisible par 3 ou 5.",
  "The child receives four Jacks so there must be an even number of children, but only receives two queens so the number of children cannot be a multiple of 3. As the child receives no Kings, 6 and 10 would both be options (try these out with cards or with pen and paper to check). But 6 is a multiple of 3 so the answer must be 10.": "L'enfant a reçu quatre Valets, il doit donc y avoir un nombre pair d'enfants, mais il n'a reçu que deux Reines, le nombre d'enfants ne peut donc pas être un multiple de 3. Comme l'enfant n'a pas reçu de Rois, 6 et 10 restent les deux possibilités (essayez de vérifier ceci avec des cartes ou un crayon et du papier). Mais 6 étant un multiple de 3, la réponse doit être 10.",
  "1000 students are sitting in a circle, and a teacher walks around the circle, dealing cards. The teacher gives a Jack to every second child, and a Queen to every third child": "1000 enfants sont assis en cercle et un enseignant fait le tour du cercle en distribuant des cartes. L'enseignant donne un Valet à chaque deuxième enfant et une Reine à chaque troisième enfant",
  "After the teacher goes around 1000 times, how many cards in total will the sixth child have?": "Après que l'enseignant ait fait 1000 tours, combien de cartes aura au total le sixième enfant ?",
  "There are an even number of children so the sixth child will always be in a position on each turn to receive a Jack. So she will have 1000 cards from that rule. For the Queens in the first round the students to receive one will be in position 3, 6, 9, 12, 15, ..., 999, then it will be 2, 5, 8, ..., 998 and then 1,4,7, ..., 997, 1000, and back to 3, 6, 9, ..., 999.  So every third time she will get a Queen. Because 1000 ∕ 3 is 333 with a remainder of 1, she will get one on the 1000ᵗʰ turn too. So 1000 + 334 = 1334 is the total number of cards.": "Il y a un nombre pair d'enfants de sorte que le sixième enfant sera toujours en position de recevoir un Valet à chaque tour. Il aura donc 1000 cartes de cette règle. Pour les Reines, au premier tour, les élèves, qui en recevront une, seront en position 3, 6, 9, 12, 15, ..., 999, puis ce sera 2, 5, 8, ..., 998, ensuite 1, 4, 7, ..., 997, 1000, et puis de retour à 3, 6, 9, ..., 999.  Ainsi, à chaque troisième tour, il recevra une Reine. Comme 1000 ∕ 3 fait 333 avec un reste de 1, il en recevra une au 1000ᵉ tour également. Alors 1000 + 334 = 1334 est le nombre total de cartes."
}