{
  "Different Paths": "Different Paths",
  "There are 5 different paths you could take to get from home to school. In a week (from Monday to Friday) you would like to try a different path every day. In how many different ways can you organise your walk to school for the week?": "Il y a 5 différents chemins que vous pouvez emprunter pour vous rendre de la maison à l'école. Dans une semaine (de lundi à vendredi) vous aimeriez essayer un chemin différent chaque jour. De combien de façons différentes pouvez-vous organiser votre trajet vers l'école pour la semaine ?",
  "Think about how many options you have to select the first path, then how many you have for the second and so on. Be careful that you can not choose the same path twice in a week.": "Pensez au nombre d'options dont vous disposez pour choisir le premier chemin, puis au nombre d'options dont vous disposez pour le second et ainsi de suite. Attention, vous ne pouvez pas choisir le même chemin deux fois dans la même semaine.",
  "You have 5 possible days of the week and you would like to have one different path per day. ON the first day you have a choice of 5 paths. On the second day, you only have 4 paths left to choose from because you can't take the one you took on Monday. On the third day you have 3 to choose from and so on. The solution is therefore 5×4×3×2×1 =120. This is counting how many ways you can order 5 objects (paths) in 5 positions (days of the week). This is a problem on <em>permutations</em> (without repetition).": "Vous avez 5 jours possibles de la semaine et vous souhaitez avoir un chemin différent par jour. Le premier jour, vous avez le choix entre 5 chemins. Le deuxième jour, il ne vous reste que 4 chemins à choisir, car vous ne pouvez pas prendre celui du lundi. Le troisième jour, vous avez le choix entre 3 chemins et ainsi de suite. La solution est donc 5×4×3×2×1 =120. Il s'agit de compter combien de façons vous pouvez ordonner 5 objets (chemins) dans 5 positions (jours de la semaine). Il s'agit d'un problème de <em>permutations</em> (sans répétition).",
  "The mathematical symbol ! is called <em>factorial</em> and represents multiplying by decreasing integers until you reach 1. So 5×4×3×2×1 can be written as 5!": "Le symbole mathématique ! est appelé <em>factoriel</em> et représente la multiplication par des entiers décroissants jusqu'à atteindre 1. Donc 5×4×3×2×1 s'écrit 5!",
  "Factorials were used to count permutations at least as early as the 12th century, by Indian scholars. The notation n! was introduced by the French mathematician Christian Kramp in 1808.": "Les factoriels ont été utilisés pour compter les permutations, au moins dès le Xiie siècle, par des savants indiens. La notation n! a été introduite par le mathématicien français Christian Kramp en 1808.",
  "Factorials get big very quickly. 5! = 120, but 20! = 2432902008176640000.": "Les factoriels deviennent grands très rapidement. 5! = 120, mais 20! = 2432902008176640000.",
  "What if you had to go to school on Saturdays as well and you also found a new path? In how many ways can you arrange your week such that every day you go to school walking on different paths?": "Et si vous deviez aller à l'école le samedi et que vous trouviez un nouveau chemin ? De combien de façons pouvez-vous organiser votre semaine de telle sorte que chaque jour vous allez à l'école en empruntant des chemins différents ?",
  "Is there a way to use the result of the previous problem? Think about how many ways you can now walk to school on Monday.": "Y a-t-il un moyen d'utiliser le résultat du problème précédent ? Pensez maintenant à combien de façons vous pouvez marcher jusqu'à l'école le lundi.",
  "You have now 6 possible days of the week and 6 different paths. You would like to have one different path per day. The solution is obtained by counting how many ways you can order 6 objects (paths) in 6 positions (days of the week). The solution is obtained as 6×5×4×3×2×1 = 120  Notice this is 6×120 (6 times the previous solution). You have just discovered a recursive property of factorials: n! = n×(n - 1)!.": "Vous avez maintenant 6 jours possibles de la semaine et 6 chemins différents. Vous aimeriez avoir un chemin différent par jour. La solution est obtenue en comptant combien de façons vous pouvez ordonner 6 objets (chemins) en 6 positions (jours de la semaine). La solution est obtenue sous la forme 6×5×4×3×2×1 = 720. Remarquez que cela fait 6×120 (6 fois la solution précédente). Vous venez de découvrir une propriété récursive de factoriels : n! = n×(n - 1)!.",
  "What if you had to go to school on Sundays as well and you also found four new paths so there are now 10 paths to choose from? In how many ways can you arrange your week such that every day you go to school walking on different paths?": "Et si vous deviez aller à l'école les dimanches et que vous trouviez quatre nouveaux chemins ? Il y a maintenant 10 chemins à choisir. De combien de façons pouvez-vous organiser votre semaine de telle sorte que chaque jour vous allez à l'école en empruntant des chemins différents ?",
  "You have now 7 possible days of the week and 10 different paths. You would like to have one different path per day. The solution is obtained by counting how many ways you can order 10 objects (paths) in 7 positions (days of the week). The solution is obtained by 10×9×8×7×6×5×4 =  604800. If you wanted to calculate this using factorials, 10! is close to the answer, but we don't want 3×2×1 at the end. 3×2×1 is 3! so we can do 10! ∕ 3! =604800.": "Vous avez maintenant 7 jours possibles de la semaine et 10 chemins différents. Vous aimeriez avoir un chemin différent par jour. La solution est obtenue en comptant le nombre de façons dont vous pouvez ordonner 10 objets (chemins) dans 7 positions (jours de la semaine). La solution est obtenue par 10×9×8×7×6×5×4 = 604800. Si vous vouliez calculer ceci en utilisant les factoriels, 10! est proche de la réponse, mais nous ne désirons pas 3×2×1 à la fin. 3×2×1 est 3 ! nous pouvons donc faire 10 ! ∕ 3 ! =604800."
}