{
  "Going to School": "Aller à l'école",
  "Start from home (H) and go to school (S). You can walk along the 2 by 5 grid by making steps only towards east or north. How many different paths can you take to reach your school?": "En quittant la maison (H) pour vous rendre à l'école (S), vous pouvez vous deplacer sur la grille 2 fois 5 qu'en faisant des pas vers l'est ou le nord. Combien de différents chemins pouvez-vous emprunter pour atteindre votre école ?",
  "What is the total number of steps you have to make? Think about when you could make the two steps north.\nYou could first try to find the answer if the grid was 2 by 3 and 2 by 4.": "Quel est le nombre total de pas que vous devez faire ? Pensez à quel moment vous pourriez faire les deux pas vers le nord.\nVous pouvez d'abord essayer de trouver la réponse pour une grille 2 fois 3 puis 2 fois 4.",
  "First of all, we can realise that, in order to get to school, you need to do a total of 2 steps north and 5 steps east. If we think about the sequence of 2 + 5 = 7 steps (S1, S2, S3, S4, S5, S6, and S7), then the problem is equivalent to counting how many ways you select 2 objects (the positions of the two steps towards north) from a total of 7 objects (the total number of positions of the steps). There are 7 possibilities to select the position for the first step towards north; then there are 7 - 1 = 6 possibilities to select the position of the second step towards north (\"-1\" because one position has already been selected), therefore you get 6×7 = 42. However, the order in which you selected the 2 positions of the steps towards north does not matter: you need to divide by 2, to give the final answer of 21.": "Tout d'abord, nous pouvons nous rendre compte que, pour aller à l'école, vous devez faire au total, 2 pas vers le nord et 5 pas vers l'est. Si l'on considère la séquence de 2 + 5 = 7 pas (S1, S2, S3, S4, S5, S6 et S7), le problème revient à compter le nombre de façons de sélectionner 2 objets (les positions des deux pas vers le nord) parmi un total de 7 objets (le nombre total de positions des pas). Il y a 7 possibilités de choisir la position du premier pas vers le nord ; puis il y a 7 - 1 = 6 possibilités de choisir la position du deuxième pas vers le nord (\"-1\" parce qu'une position a déjà été choisie), donc vous obtenez 6×7 = 42. Cependant, l'ordre dans lequel vous avez choisi les 2 positions des pas vers le nord n'a pas d'importance : vous devez diviser par 2, pour obtenir la réponse finale de 21.",
  "Alternatively, we could look at smaller examples first.": "Autrement, nous pourrions d'abord nous pencher sur des exemples plus simples.",
  "Let N be one step north and E be one step east.": "Supposons que N représente un pas vers le nord et E un pas vers l'est.",
  "For a 2 by 2 grid we could have NNEE, NENE, NEEN, ENNE, ENEN, EENN  (6 ways)": "Pour une grille 2 fois 2, nous pourrions avoir NNEE, NENE, NEEN, ENNE, ENEN, EENN (6 choix)",
  "For a 2 by 3 grid we need an extra move east. We could add an E onto all the options above. We would then just be missing all the routes that had N as the last move. There are 4 of these, corresponding to the other N in each one of the first four positions.": "Pour une grille de 2 fois 3, nous avons besoin d'un pas supplémentaire vers l'est. Nous pourrions ajouter un E à toutes les options ci-dessus. Nous manquerions alors toutes les routes qui ont eu N comme dernier pas. Il y en a 4, correspondant à l'autre N dans chacune des quatre premières positions.",
  "NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (6 ways) plus NEEEN, ENEEN, EENEN, EEENN (4 ways) = 10 ways": "NNEE(E), NENE(E), NEEN(E), ENNE(E), ENEN(E), EENN(E) (6 choix) plus NEEEN, ENEEN, EENEN, EEENN (4 choix) = 10 choix",
  "For a 2 by 4 grid there are 10 + 5 = 15 ways": "Pour une grille 2 fois 4 il y a 10 + 5 = 15 choix",
  "For a 2 by 5 grid there are 15 + 6 = 21 ways": "Pour une grille 2 fois 5 il y a 15 + 6 = 21 choix",
  "In general, by counting from small examples, we can see that each time you increase by one the number n of total steps (while keeping the number of steps towards north to 2), the number of ways you can go to school increases by n - 1. This is because you have already counted the ways the steps towards north can be in all the previous positions from 1 to n - 1. Therefore you just need to add the possibility that the two steps towards north are in the position n and any other of the n - 1 remaining ones.": "En général, en comptant à partir de simples exemples, nous pouvons voir que chaque fois que vous augmentez de 1 le nombre total de pas n (tout en maintenant le nombre de pas vers le nord à 2), le nombre de façons d'aller à l'école augmente de n - 1. Cela est dû au fait que vous avez déjà compté les façons dont les pas vers le nord peuvent se trouver dans toutes les positions précédentes, de 1 à n - 1. Par conséquent, il vous suffit d'ajouter la possibilité que les deux pas vers le nord se trouvent dans la position n et dans n'importe quelle autre des n - 1 positions restantes.",
  "This puzzle is all about finding the number of ways of choosing r items from a choice of n items when the order doesn't matter. The mathematical word for this is <strong>combinations</strong>, and there is a formula for finding them: ⁿCᵣ = n! ∕ (r!×(n - r)!)": "Cette énigme consiste à trouver le nombre de façons de choisir r objets parmi n lorsque l'ordre n'a pas d'importance. Le mot mathématique pour cela est <strong>combinaisons</strong>, et il y a une formule pour les trouver : ⁿCᵣ = n! ∕ (r!×(n - r)!)",
  "In this formula n! = n×(n - 1)×(n - 2)×...×1.": "Dans cette formule n! = n×(n - 1)×(n - 2)×...×1.",
  "In how many ways could you reach your school if it were further away in the top right of a 2 by 10 grid?": "De combien de façons pourriez-vous atteindre votre école si elle était plus éloignée dans le coin supérieur droit d'une grille 2 fois 10 ?",
  "Think about the strategy you used to answer the previous question and try to generalise in the case the school is in the top right (north-east) of a 2 by n grid.": "Pensez à la stratégie que vous avez utilisée pour répondre à la question précédente et essayez de généraliser dans le cas où l'école est dans le coin supérieur droit (nord-est) d'une grille 2 fois n.",
  "You can come up with a formula generalising the reasoning in the previous part: there are n+2 possibilities to select the position for the first step towards north; then there are n+1 possibilities to select the position of the second step towards north (1 less because one position has already been selected), therefore you get (n + 2)×(n + 1). However, the order in which you selected the 2 positions of the steps towards north does not matter: you then need to divide by 2.": "Vous pouvez trouver une formule généralisant le raisonnement de la partie précédente : il y a n+2 possibilités de choisir la position du premier pas vers le nord ; puis il y a n+1 possibilités de choisir la position du deuxième pas vers le nord (1 de moins car une position a déjà été choisie), vous obtenez donc (n + 2)×(n + 1). Cependant, l'ordre dans lequel vous avez choisi les 2 positions des pas vers le nord n'a pas d'importance : vous devez alors diviser par 2.",
  "Alternatively, generalising what you found earlier, you might come up with the rule that for a 2×n grid you have 1 + 2 + ... + (n + 1) possible paths to school. There is a quick way of adding these numbers together - it is (n + 1)×(n + 2) ∕ 2.": "Alternativement, en généralisant ce que vous avez trouvé précédemment, vous pourriez trouver la règle selon laquelle, pour une grille 2 fois n, vous avez 1 + 2 + .... + (n + 1) chemins possibles vers l'école. Il existe un moyen rapide d'additionner ces nombres : (n + 1)×(n + 2) ∕ 2.",
  "So we can calculate the answer for a 2 by 10 grid by doing 12×11 ∕ 2 = 66.": "On peut donc calculer la réponse pour une grille 2 fois 10 en faisant 12×11/2 = 66.",
  "In how many ways could you reach your school if it were in the top right of a 4 by 5 grid?": "De combien de façons pourriez-vous atteindre votre école si elle se trouvait dans le coin supérieur à droit d'une grille 4 fois 5 ?",
  "We need to take four steps north and 5 steps east. One way to do this would be in the sequence NNNNEEEEE. We need to find all the different ways. Consider the position of the four steps north. Let's call them N₁, N₂, N₃, and N₄. N₁ could be in any one of 9 positions, then N₂ could go in any of the 8 that are left, then N₃ is one of the remaining 7 and finally N₄ in one of the remaining 6. This would give us 9×8×7×6 = 3024 ways. But we actually don't want to distinguish between the four north steps. N₁N₂N₃N₄EEEEE is the same as N₂N₁N₃N₄EEEEE for example. So the 126 has included all the different ways the N₁ up to N₄ could be arranged. We now need to work out how many ways this is. The N₁ could be in one of four positions, the N₂ then in one of three, the N₃ in one of two and the N₄ in the one left. This gives us 4×3×2×1 = 24 ways. So we overcounted by a factor of 24. The final answer is 3024 ∕ 24 = 126.": "Nous devons faire quatre pas vers le nord et cinq vers l'est. Une façon de le faire serait de suivre la séquence NNNNEEEEE. Nous devons trouver toutes les différentes façons de procéder. Considérons la position des quatre pas au nord. Appelons-les N₁, N₂, N₃, et N₄. N₁ pourrait être dans l'une des 9 positions, puis N₂ pourrait aller dans l'une des 8 qui restent, puis N₃ est l'une des 7 restantes et enfin N₄ dans l'une des 6 restantes. Cela nous donnerait 9×8×7×6 = 3024 choix. Mais en fait, nous ne voulons pas distinguer les quatre pas vers le nord. N₁N₂N₃N₄EEEEE est le même que N₂N₁N₃N₄EEEEE par exemple. Le 126 a donc inclus toutes les différentes façons dont les N₁ jusqu'à N₄ pourraient être arrangés. Nous devons maintenant déterminer combien de façons cela représente. Le N₁ pourrait être dans une des quatre positions, le N₂ dans une des trois, le N₃ dans une des deux et le N₄ dans celle de gauche. Cela nous donne 4×3×2×1 = 24 façons. On a donc surcompté d'un facteur 24. La réponse finale est 3024 ∕ 24 = 126."
}