{
  "Lost cards": "Lost cards",
  "A small number of cards has been lost from a complete pack of 52. I deal cards to players until all have the same number of cards and some cards are left. If I deal to four players, three cards remain. If I deal to three players, two cards remain and if I deal to five players, two cards remain. How many cards are there?": "Un petit nombre de cartes ont été perdues à partir d'un pack complet de 52. Je distribue des cartes aux joueurs jusqu'à ce que tous aient le même nombre de cartes et certaines cartes sont restantes. Si je donne à quatre joueurs, trois cartes restent. Si je distribue à trois joueurs, deux cartes restent et si je distribue à cinq joueurs, il reste deux cartes. Combien y a-t-il de cartes ?",
  "Think about remainders when dividing. If there are two left when divided amongst five people then the number must be two more than a multiple of 5, e.g. 7 or 32": "Pensez aux restes lors de la division. S'il y a deux restants lors de la division entre cinq personnes\nalors le nombre doit être deux fois plus qu'un\nmultiple de 5, par ex. 7 ou 32",
  "As only a small number of cards have been lost, let us start by listing the numbers that work that are close to 52.": "Comme seul un petit nombre de cartes ont été perdues, commençons par lister les nombres qui fonctionnent et qui sont proches de 52.",
  "If there were no cards remaining when dealt between four people we would know that the number of cards was in the four times table, i.e …, 36, 40, 44, 48. But there are three left over, so the number of cards must be in the sequence …, 39, 43, 47, 51.": "S'il ne restait plus de cartes lorsqu'elles étaient distribuées entre quatre personnes, nous saurions que le nombre de cartes était dans la table de multiplication par quatre, c'est-à-dire …, 36, 40, 44, 48. Mais il en reste trois, donc le nombre de cartes doit être dans la séquence …, 39, 43, 47, 51.",
  "For dealing among three people with two left over we get the sequence …, 41,44,47,50": "Pour distribuer entre trois personnes les deux restants, nous obtenons la séquence …, 41,44,47,50",
  "For dealing among five people with two left over we get the sequence …,32, 37,42,47": "Pour distribuer entre cinq personnes les deux restants, nous obtenons la séquence …, 32, 37,42,47",
  "The number that appears on all three lists is 47.": "Le nombre qui apparaît sur toutes les trois listes est 47.",
  "We could also solve the puzzle starting with the last two clues. There is the same number of cards leftover when dealing to three or five people, so the answer must be two more than a multiple of 15, so 17, 32 or 47. The only one of these numbers that fits with the first clue is 47.": "On pourrait aussi résoudre l'énigme en commençant par les deux derniers indices. Il reste le même nombre de cartes lorsqu'on distribue à trois ou cinq personnes, donc la réponse doit être deux de plus qu'un multiple de 15, donc 17, 32 ou 47. Le seul de ces nombres qui correspond au premier indice est 47 .",
  "There is a special name for the operation of dividing by a number and finding the remainder in mathematics - it is called <strong>mod</strong>ular arithmetic. 47 mod 5 = 2 because when you divide 47 by 5 you have a remainder of 2. It is a powerful technique in mathematics to prove facts about numbers. We use it in everyday life when we tell the time with a 24 hour clock.": "Il existe un nom spécial pour l'opération consistant à diviser par un nombre et à trouver le reste en mathématiques - c'est ce qu'on appelle l'arithmétique <strong>mod</strong>ulaire. 47 mod 5 = 2 car lorsque vous divisez 47 par 5 vous avez un reste de 2. C'est une technique puissante en mathématiques pour prouver des faits sur les nombres. Nous l'utilisons dans la vie de tous les jours lorsque nous donnons l'heure avec une horloge de 24 heures.",
  "(18 + 8) mod 24 = 2 or in other words 8 hours after 6pm is 2am!": "(18 + 8) mode 24 = 2 soit 8h après 18h c'est 2h du matin !",
  "Some cards have been lost from a complete pack of 52. If I deal among three or four people there are always two cards remaining. How many different options are there for the number of cards remaining?": "Certaines cartes ont été perdues dans un paquet complet de 52. Si je distribue entre trois ou quatre personnes, il reste toujours deux cartes. Combien d'options différentes existe-t-il pour le nombre de cartes restantes ?",
  "Think about multiples of 12.": "Pensez aux multiples de 12.",
  "There must be two more than a multiple of 12, because there are two more than a multiple of 3 and two more than a multiple of 4. So there are four numbers … namely 14, 26, 38, 50.": "Il doit y avoir deux de plus qu'un multiple de 12, car il y a deux de plus qu'un multiple de 3 et deux de plus qu'un multiple de 4. Il y a donc quatre nombres... à savoir 14, 26, 38, 50.",
  "Some cards have been lost from a complete pack of 52. If I deal among two people there is one card remaining, and if I deal among four people there are two cards remaining. How many different options are there for the number of cards remaining?": "Certaines cartes ont été perdues dans un paquet complet de 52. Si je distribue entre deux personnes, il reste une carte, et si je distribue entre quatre personnes, il reste deux cartes. Combien d'options différentes existe-t-il pour le nombre de cartes restantes ?",
  "There are 0 options because it is impossible to have a number that is both one more than a multiple of 2 (must be odd) and two more than a multiple of 4 (must be even).": "Il y a 0 options car il est impossible d'avoir un nombre qui soit à la fois un de plus qu'un multiple de 2 (doit être impair) et deux de plus qu'un multiple de 4 (doit être pair)."
}