{
  "Mean": "Moyen",
  "The average (mean) of 16 different positive integers is 16. What is the greatest possible value that any of these integers could have?": "La moyenne (moyen) de 16 entiers positifs différents est 16. Quelle est la plus grande valeur possible que l'un de ces entiers puisse avoir ?",
  "Make the first 15 (different) numbers as small as possible. What does this tell us about the 16th number?": "Faites en sorte que les 15 premiers nombres (différents) soient aussi petits que possible. Qu'est-ce que cela nous apprend sur le 16ème nombre ?",
  "If the mean of 16 numbers is 16, then the total of all the numbers is 16×16 = 256. We want to make one of the numbers as big as possible, so we should make the other 15 numbers as small as possible. The integers have to be different so we should choose 1, 2, 3, ..., 15. If you add them up this gives 120 (a quick way to do it is ½×15×16 = 120). So the biggest number is 256 - 120 = 136.": "Si la moyenne de 16 nombres est 16, alors le total de tous les nombres est 16 × 16 = 256. Nous voulons rendre l'un des nombres aussi grand que possible, nous devons donc rendre les 15 autres nombres aussi petits que possible. Les nombres entiers doivent être différents, nous devons donc choisir 1, 2, 3, ..., 15. Si vous les additionnez, cela donne 120 (un moyen rapide de le faire est ½ × 15 × 16 = 120). Donc le plus grand nombre est 256 - 120 = 136.",
  "The mean is one way of describing a whole set of data with just one number. The median is another way describing the set of data with one number. If the puzzle had asked \"The median of 16 different positive integers is 16. What is the greatest possible value that any of these integers could have?\", then there would be no solution as you could choose any number as large as you like for the biggest number, as the value of the median of 16 numbers depends only on the eight and ninth biggest numbers!": "La moyenne est une façon de décrire tout un ensemble de données avec un seul chiffre. La médiane est une autre façon de décrire l'ensemble de données avec un nombre. Si le puzzle avait demandé \"La médiane de 16 nombres entiers positifs différents est 16. Quelle est la plus grande valeur possible que l'un de ces nombres entiers pourrait avoir ?\", alors il n'y aurait pas de solution car vous pourriez choisir n'importe quel nombre aussi grand que vous le souhaitez pour le plus grand nombre, car la valeur de la médiane de 16 nombres ne dépend que des huit et neuvième plus grands nombres !",
  "The average (mean) age of 7 people is 16. Given that all their ages are different positive integers, what is the maximum number of people that could be older than 16?": "L'âge moyen (la moyenne) de 7 personnes est de 16 ans. Étant donné que tous leurs âges sont des nombres entiers positifs différents, quel est le nombre maximum de personnes qui pourraient avoir plus de 16 ans ?",
  "Could everyone be older than 16? If not, can you try and find the maximum number of people that could be older than 16 if just one of the people is as young as possible?": "Est-ce que tout le monde pourrait avoir plus de 16 ans ? Sinon, pouvez-vous essayer de trouver le nombre maximum de personnes qui pourraient avoir plus de 16 ans si une seule des personnes est aussi jeune que possible ?",
  "You cannot make all 7 people older than 16 because the average is 16. You could start with the youngest person being 1, and try to make the other 6 people older than 16 but the total must be 7×16 = 112. With this strategy, 112 - 1 = 111 and 16 + 17 + 18 + 19 + 20 + 21 = 111 so this only gives 5 people older than 16 as you can't count 16 itself. This shows that you cannot do it with 6 people older than 16, but because you have a possibility with 5, this is the largest number you can have.": "Vous ne pouvez pas faire en sorte que les 7 personnes aient plus de 16 ans car la moyenne est de 16 ans. Vous pouvez commencer avec la plus jeune personne ayant 1 an et essayer de faire en sorte que les 6 autres personnes aient plus de 16 ans, mais le total doit être de 7 × 16 = 112. Avec cette stratégie, 112 - 1 = 111 et 16 + 17 + 18 + 19 + 20 + 21 = 111 donc cela ne donne que 5 personnes de plus de 16 ans car vous ne pouvez pas compter 16 lui-même. Cela montre que vous ne pouvez pas le faire avec 6 personnes de plus de 16 ans, mais parce que vous avez une possibilité avec 5, c'est le plus grand nombre que vous puissiez avoir.",
  "When Albert entered the room, the average age increased by 4 years. When Belinda then entered the room, the average age increased by another 3 years. Albert and Belinda are twins. How many people were in the room before Albert entered?": "Quand Albert est entré dans la salle, l'âge moyen a augmenté de 4 ans. Lorsque Belinda est ensuite entrée dans la pièce, l'âge moyen a encore augmenté de 3 ans. Albert et Belinda sont jumeaux. Combien de personnes étaient dans la pièce avant qu'Albert n'entre ?",
  "There are different ways to solve this puzzle. For each method let n be the number of people in the room.": "Il existe différentes manières de résoudre ce casse-tête. Pour chaque méthode, soit n le nombre de personnes dans la pièce.",
  "If Albert and Belinda walked in together, between them they would have added (n + 2)×7 onto the total of all the ages in the room. If just Albert walked in, then he would have added (n + 1)×4 to the total. It is the same for Belinda, so if they both walked in together it would be double this amount. So  (n + 2)×7 = 2×(n + 1)×4. Solving this gives n = 6.": "Si Albert et Belinda étaient entrés ensemble, à eux deux ils auraient ajouté (n + 2)×7 au total de tous les âges de la pièce. Si seul Albert était entré, il aurait ajouté (n + 1) × 4 au total. C'est la même chose pour Belinda, donc s'ils entraient tous les deux ensemble, ce serait le double de ce montant. Donc (n + 2)×7 = 2×(n + 1)×4. La résolution de ceci donne n = 6.",
  "Alternatively, let a be Albert and Belinda's age. The new mean after Albert walks in is (a - 4×n) because Albert has shared out 4 years to everyone in the room to make his age the same. After Belinda walks in the mean is (a - 3×(n + 1)) because she has given 3 years to everyone in the room including Albert. We know that this second expression must be 3 more than the first expression as the mean increased by 3 when Belinda walked in. So we can solve (a - 3×(n + 1)) = a - 4×n + 3  which gives n = 6.": "Alternativement, soit a l'âge d'Albert et Belinda. La nouvelle moyenne après l'entrée d'Albert est (a - 4 × n) parce qu'Albert a partagé 4 ans avec tout le monde dans la pièce pour que son âge soit le même. Après Belinda marche dans la moyenne est (a - 3 × (n + 1)) parce qu'elle a donné 3 ans à tout le monde dans la salle, y compris Albert. Nous savons que cette deuxième expression doit être supérieure de 3 à la première expression car la moyenne a augmenté de 3 lorsque Belinda est entrée. On peut donc résoudre (a - 3×(n + 1)) = a - 4×n + 3 ce qui donne n = 6.",
  "Here is another way. Let the original mean be m. The sum of all the ages is originally (m×n). Let Albert's age be a. When Albert walks in, the new mean is (m + 4). This must be equal to (m×n + a) ∕ (n + 1). When Belinda walks in the room, the new mean is (m + 7). This must be equal to (m×n + 2×a) ∕ (n + 2). Rearranging these equations gives": "Voici une autre façon. Soit m la moyenne originale. La somme de tous les âges est à l'origine (m×n). Soit l'âge d'Albert soit a. Quand Albert arrive, la nouvelle moyenne est (m + 4). Celle-ci doit être égale à (m×n + a) ∕ (n + 1). Lorsque Belinda entre dans la pièce, la nouvelle moyenne est (m + 7). Celle-ci doit être égale à (m×n + 2×a) ∕ (n + 2). La réorganisation de ces équations donne",
  "m×n + a = m×n + m + 4×n + 4": "m×n + a = m×n + m + 4×n + 4",
  "and": "et",
  "m×n + 2×a = m×n + 2×m + 7×n + 14": "m×n + 2×a = m×n + 2×m + 7×n + 14",
  "Which simplify to": "Qui simplifient à",
  "a = m + 4×n + 4 and 2×a = 2×m + 7×n + 14.": "a = m + 4×n + 4 et 2×a = 2×m + 7×n + 14.",
  "Multiplying the first equation by 2 and subtracting the second one gives n = 6. So there are 6 people in the room at the start.": "Multiplier la première équation par 2 et soustraire un de la seconde donne  n = 6. Il y a donc 6 personnes dans la pièce au départ."
}