{
  "Monkey business": "Affaires de singe(quelque chose de louche)",
  "A large room has 1000 light bulbs in it, all are switched off. 1000 monkeys enter the room and decide to press the light switches in a very particular way.": "Une grande pièce contient 1000 ampoules, toutes éteintes. 1000 singes entrent dans la pièce et décident d'appuyer sur les interrupteurs d'une manière très particulière.",
  "The 1<sup>st</sup> monkey presses every multiple of 1.": "Le 1<sup>er</sup> singe appuie sur chaque multiple de 1.",
  "The 2<sup>nd</sup> monkey presses every multiple of 2.": "Le second singe appui sur tout les multiples de 2.",
  "The 3<sup>rd</sup> monkey presses every multiple of 3.": "Le troisième singe appui sur tout les multiples de 3.",
  "Etc., until the 1000<sup>th</sup> monkey. After all the monkeys have finished pressing switches, how many lights in total will be on?": "Etc., jusqu'au 1000<sup>ème</sup> singe. Une fois que tous les singes ont fini d'appuyer sur les interrupteurs, combien de lumières au total seront allumées ?",
  "Can you work out whether number 8 will be on or off? How about number 9? What is it about the factors of these two numbers that means one of them is on and one of them is off?": "Pouvez-vous déterminer si le numéro 8 sera allumé ou éteint ? Et le numéro 9 ? Qu'y a-t-il dans les facteurs de ces deux nombres qui signifient que l'un d'eux est allumé et l'autre est éteint ?",
  "Most numbers will be pressed by an even number of monkeys, e.g. 24 has factors (1×24, 2×12, 3×8, 4×6), so monkeys 1, 2, 3, 4, 6, 8, 12, 24 will press the switch, and as this is an even number the light will be off.": "La plupart des nombres seront pressés par un nombre pair de singes, par ex. 24 a des facteurs (1×24, 2×12, 3×8, 4×6), donc les singes 1, 2, 3, 4, 6, 8, 12, 24 appuieront sur l'interrupteur, et comme c'est un nombre pair la lumière sera éteinte.",
  "Square numbers are the only ones which do not have an even number of factors, e.g. 16 has factors (1×16, 2×8, 4×4). Monkeys 1, 2, 4, 8, 16 will press the switch, and as this is an odd number that the switch has been pressed, the light will stay on (monkey 4 won't press it twice!).": "Les nombres carrés sont les seuls qui n'ont pas un nombre pair de facteurs, par ex. 16 a des facteurs (1×16, 2×8, 4×4). Les singes 1, 2, 4, 8, 16 appuieront sur l'interrupteur, et comme il s'agit d'un nombre impair d'appuis sur l'interrupteur, la lumière restera allumée (le singe 4 n'appuiera pas deux fois !).",
  "So we just need to work out how many square numbers there are between 1 and 1000.": "Nous avons donc juste besoin de déterminer combien de nombres carrés il y a entre 1 et 1000.",
  "We find the largest square number less than 1000: 31×31 = 961, 32×32 = 1024": "On trouve le plus grand nombre carré inférieur à 1000 : 31×31 = 961, 32×32 = 1024",
  "So there will be 31 switches left on! (switch numbers 1, 4, 9, 16, 25, 36, … , 900, 961)": "Il restera donc 31 interrupteurs allumés ! (commutateurs numéros 1, 4, 9, 16, 25, 36, … , 900, 961)",
  "This is a very famous puzzle that can be found in different contexts - opening and closing lockers is another common one. It is designed to make you think about the properties of different numbers.": "Il s'agit d'un casse-tête très célèbre qui peut être trouvé dans différents contextes - l'ouverture et la fermeture des casiers est un autre problème courant. Il est conçu pour vous faire réfléchir sur les propriétés de différents nombres.",
  "How many lights switches will be touched by exactly three monkeys?": "Combien d'interrupteurs d'éclairage seront touchés par exactement trois singes ?",
  "Light switch number 9 will be touched by three monkeys:1, 3, and 9. Can you find other numbers that will?": "L'interrupteur numéro 9 sera touché par trois singes : 1, 3 et 9. Pouvez-vous trouver d'autres chiffres qui le feront ?",
  "The switches which are touched by only three monkeys are the squares of prime numbers (because these are the only numbers which have exactly three factors.) The numbers are 4,9, 25, 49, 121, 169, 289, 361, 529, 841 and 961 which is 11 in total.": "Les interrupteurs qui ne sont touchés que par trois singes sont les carrés des nombres premiers (car ce sont les seuls nombres qui ont exactement trois facteurs.) Les nombres sont 4,9, 25, 49, 121, 169, 289, 361, 529, 841 et 961 soit 11 au total.",
  "Which light bulb will be touched by the most monkeys?": "Quelle ampoule sera touchée par le plus de singes ?",
  "A number will have the most number of factors if its prime factor decomposition has the most numbers in it. For example 24 = 2³×3 has 8 factors (1, 2, 3, 4, 6, 8, 12, 24) compared to 25 = 5² which only has 3 (1, 5, 25).": "Un nombre aura le plus grand nombre de facteurs si sa décomposition en facteurs premiers contient le plus de nombres. Par exemple 24 = 2³×3 a 8 facteurs (1, 2, 3, 4, 6, 8, 12, 24) contre 25 = 5² qui n'en a que 3 (1, 5, 25).",
  "To find the number less than 1000 that has the most factors, we start with as many of the smallest primes as we can, then multiply to less than 1000 (2×3×5×7) and then we can multiply by 2 until the number is as close to 1000 as possible.": "Pour trouver le nombre inférieur à 1000 qui a le plus de facteurs, nous commençons avec autant de plus petits nombres premiers que possible, puis multiplions à moins de 1000 (2 × 3 × 5 × 7) puis nous pouvons multiplier par 2 jusqu'à ce que le nombre est aussi proche que possible de 1000.",
  "Therefore, the answer is 2³×3×5×7 = 840.": "Par conséquent, la réponse est 2³×3×5×7 = 840.",
  "The number of factors of 840 is 32, so light switch 840 has been touched by 32 monkeys.": "Le nombre de facteurs de 840 est 32, donc l'interrupteur 840 a été touché par 32 singes."
}