{
  "Newspaper": "Newspaper",
  "Below is a single sheet from a newspaper. Given that each sheet has four pages, how many sheets are there altogether?": "Ci-dessous, une seule feuille d'un journal. Étant donné que chaque feuille comporte quatre pages, combien y a-t-il de feuilles en tout ?",
  "Can you work backwards from 8 to work out how many sheets would be underneath this one? You might want to use bits of paper and number them to help.": "Pouvez-vous travailler à rebours à partir de 8 pour déterminer combien de feuilles il y aurait sous celle-ci ? Vous pouvez utiliser des morceaux de papier et les numéroter pour vous aider.",
  "On the back of the number 8 there must be the number 7. The sheet below must have the numbers 6 and 5. Keeping going there will be 4 and 3 and finally 2 and 1. So there are three sheets underneath. Adding on 7 to the 61 gives the last page as 68. Given each sheet has four pages, there are 68 ∕ 4 = 17 sheets.": "Au verso du numéro 8 il doit y avoir le numéro 7. La feuille en dessous doit avoir les chiffres 6 et 5. En continuant il y aura 4 et 3 et enfin 2 et 1. Il y a donc trois feuilles en dessous. Ajouter 7 au 61 donne la dernière page comme 68. Étant donné que chaque feuille a quatre pages, il y a 68 ∕ 4 = 17 feuilles.",
  "You can try this puzzle with a real newspaper - take out one of the sheets and look at the numbers on it. Work out how many sheets there should be and then see if you are correct.": "Vous pouvez essayer ce puzzle avec un vrai journal - sortez l'une des feuilles et regardez les chiffres dessus. Déterminez le nombre de feuilles qu'il devrait y avoir et voyez ensuite si vous avez raison.",
  "If it takes 852 digits to number all the pages of a book, in the usual order, what is the number on the last page of the book?": "S'il faut 852 chiffres pour numéroter toutes les pages d'un livre, dans l'ordre habituel, quel est le numéro de la dernière page du livre ?",
  "How many 1 digit numbers are there? How many 2 digit numbers?": "Combien y a-t-il de nombres à 1 chiffre ? Combien de nombres à 2 chiffres ?",
  "There are 9 one-digit numbers (the numbers 1 - 9), 90 two-digit numbers (the numbers 10 - 99) and 900 three-digits numbers (the numbers 100 - 999). Altogether this would make 9×1 + 90×2 + 900×3 = 9 + 180 + 2700 = 2889 digits, so the number of pages is less than 999. There are 852 - 9 - 180 = 663 digits used in three digit numbers. 663 ∕ 3 = 221, so there are 221 pages with three digit numbers. 99 + 221 = 320 gives us the answer.": "Il existe 9 nombres à un chiffre (les nombres 1 à 9), 90 nombres à deux chiffres (les nombres 10 à 99) et 900 nombres à trois chiffres (les nombres 100 à 999). Au total, cela ferait 9 × 1 + 90 × 2 + 900 × 3 = 9 + 180 + 2700 = 2889 chiffres, donc le nombre de pages est inférieur à 999. Il y a 852 - 9 - 180 = 663 chiffres utilisés dans les nombres à trois chiffres. 663 ∕ 3 = 221, il y a donc 221 pages avec des nombres à trois chiffres. 99 + 221 = 320 nous donne la réponse.",
  "Numbering the pages of a book requires printing 200 nines. What is the minimum number of pages the book could have?": "Numéroter les pages d'un livre nécessite d'imprimer 200 neufs. Quel est le nombre minimum de pages que le livre pourrait avoir ?",
  "Think about the numbers under 100 first. There are 10 numbers ending in 9, and 10 numbers having 9 as their upper digit (90‒99), making for a total of 20 9s. In the same way, we have 20 9s between 100 and 199, and between 200 and 299, etc. So we get 9×20 = 180 9s up to 899. We need 20 more to reach 200 9s. From 900‒999, every number has a 9 at the beginning. Because 909 has two 9s, we get the last 20 9s from the numbers from 900‒918.": "Pensez d'abord aux nombres inférieurs à 100. Il y a 10 nombres se terminant par 9 et 10 nombres ayant 9 comme chiffre supérieur (90‒99), soit un total de 20 9. De la même façon, on a 20 9 entre 100 et 199, et entre 200 et 299, etc. On obtient donc 9×20 = 180 9 jusqu'à 899. Il nous en faut 20 de plus pour atteindre 200 9s. De 900 à 999, chaque nombre commence par un 9. Parce que 909 a deux 9, nous obtenons les 20 derniers 9 des nombres de 900 à 918."
}