{
  "OneTwoThreeFourFive": "Un deux three four five",
  "The pattern 123451234512345... is continued to form a 2000 digit number.": "Le modèle 123451234512345... se poursuit pour former un nombre à 2000 chiffres.",
  "What is the sum of all 2000 digits?": "Quelle est la somme de tous les 2000 chiffres ?",
  "How many times does the pattern 12345 appear in the 2000 digit number?": "Combien de fois le motif 12345 apparaît-il dans le nombre à 2 000 chiffres ?",
  "The five numbers 1, 2, 3, 4, and 5 add up to 15. If the pattern is continued for 2000 digits there will be 2000 ∕ 5 = 400 sets of these five numbers. 400×15 = 6000.": "Les cinq nombres 1, 2, 3, 4 et 5 totalisent 15. Si la régularité se poursuit sur 2 000 chiffres, il y aura 2 000 ∕ 5 = 400 ensembles de ces cinq nombres. 400×15 = 6000.",
  "There is a formula for adding the numbers 1, 2, 3, …, n together. It is ½×n×(n + 1). For example 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28 can be found by  ½×7×8  = 28.": "Il existe une formule pour additionner les nombres 1, 2, 3, …, n ensemble. C'est ½×n×(n + 1). Par exemple 1 + 2 + 3 + 4 + 5 + 6 + 7 = 28 peut être trouvé par ½×7×8 = 28.",
  "The sequence of numbers that this formula gives are called triangular numbers. The first ten are 1, 3, 6, 10, 15, 21, 28, 36, 45, and 55.": "La séquence de nombres que cette formule donne est appelée nombres triangulaires. Les dix premiers sont 1, 3, 6, 10, 15, 21, 28, 36, 45 et 55.",
  "The pattern 123456712345671234567... is continued to form a 2100 digit number.": "Le modèle 123456712345671234567... se poursuit pour former un nombre à 2100 chiffres.",
  "What is the sum of all 2100 digits?": "Quelle est la somme de tous les 2100 chiffres ?",
  "What do the numbers 1 + 2 + 3 + 4 + 5 + 6 + 7 add up to?": "A quoi correspondent les nombres 1 + 2 + 3 + 4 + 5 + 6 + 7 ?",
  "The seven numbers 1, 2, 3, 4, 5, 6, and 7 add up to 28. If the pattern is continued for 2100 digits there will be 2100 ∕ 7 = 300 sets of these seven numbers. 300×28 = 8400.": "Les sept nombres 1, 2, 3, 4, 5, 6 et 7 totalisent 28. Si la régularité se poursuit sur 2100 chiffres, il y aura 2100 ∕ 7 = 300 ensembles de ces sept nombres. 300×28 = 8400.",
  "The pattern 1234...n,1234,...n,1234…,n is carried on for 120000 digits. If the sum of these digits is 960000, what is n equal to?": "Le modèle 1234...n,1234,...n,1234…,n est poursuivi sur 120 000 chiffres. Si la somme de ces chiffres est 960000, à quoi est égal n ?",
  "960000 is the sum of all the digits. There are 120000 digits, so dividing 960000 by 120000 gives us the average of the digits. This is 8, so we are looking for a sequence of numbers 1, 2, 3, … with an average of 8. This must be 1, 2, 3, …, 15.": "960000 est la somme de tous les chiffres. Il y a 120 000 chiffres, donc diviser 960 000 par 120 000 nous donne la moyenne des chiffres. C'est 8, nous recherchons donc une séquence de nombres 1, 2, 3, … avec une moyenne de 8. Cela doit être 1, 2, 3, …, 15."
}