{
  "Pieces of Cake": "Pieces of Cake",
  "What is the biggest number of pieces of a circular cake you can obtain with 5 straight cuts? Cuts must be made on the top of the cake.": "Quel est le plus grand nombre de morceaux d'un gâteau circulaire que vous pouvez obtenir avec 5 coupes droites ? Les coupes doivent être faites sur le dessus du gâteau.",
  "Start with a small number of cuts, e.g. 1, 2, 3. How can you add another cut to get the biggest number of pieces? Remember it doesn't say that the pieces have to be the same size! What happens if many cuts pass through the same point?": "Commencez par un petit nombre de coupes, par ex. 1, 2, 3. Comment pouvez-vous ajouter une autre coupe pour obtenir le plus grand nombre de pièces ? Rappelez-vous qu'il ne dit pas que les pièces doivent être de la même taille ! Que se passe-t-il si plusieurs coupes passent par le même point ?",
  "With one cut you always get 2 pieces. With two cuts you can get 4 pieces. With three cuts, if all cuts pass through the same point you get 6 pieces. However, you can get 7 pieces if the third cut doesn't pass through the same point as the previous two. Use this idea to get the maximum number with four cuts. So to get the most pieces, make sure that no more than two cuts pass through the same point, otherwise you get less pieces. With four cuts you can get 11 pieces. Do the same again for five cuts, start with the four cuts that give 7 pieces and add a cut without passing through any meeting points (intersections) and you can get 16 pieces.": "Avec une coupe, vous obtenez toujours 2 pièces. Avec deux coupes, vous pouvez obtenir 4 pièces. Avec trois coupes, si toutes les coupes passent par le même point, vous obtenez 6 pièces. Cependant, vous pouvez obtenir 7 pièces si la troisième coupe ne passe pas par le même point que les deux précédentes. Utilisez cette idée pour obtenir le nombre maximum avec quatre coupes. Donc, pour obtenir le plus de morceaux, assurez-vous que pas plus de deux coupes passent par le même point, sinon vous obtenez moins de morceaux. Avec quatre coupes, vous pouvez obtenir 11 pièces. Recommencez la même chose pour cinq coupes, commencez par les quatre coupes qui donnent 7 pièces et ajoutez une coupe sans passer par aucun point de rencontre (intersections) et vous pouvez obtenir 16 pièces.",
  "If you were allowed to cut the cake in any direction, not just from the top, with just three cuts you could cut it into 8 pieces (rather than only 6)!": "Si vous pouviez couper le gâteau dans n'importe quelle direction, pas seulement par le haut, avec seulement trois coupes, vous pourriez le couper en 8 morceaux (au lieu de seulement 6) !",
  "What is the biggest number of pieces of cake you can obtain with 7 cuts?": "Quel est le plus grand nombre de morceaux de gâteau que vous pouvez obtenir avec 7 coupes ?",
  "As the number of cuts increases, drawing and counting might be too complicated: can you spot the pattern in the sequence of numbers obtained from previous examples? For 7 cuts, first work out the answer for 6 cuts and then use this result.": "Au fur et à mesure que le nombre de coupes augmente, le dessin et le comptage peuvent être trop compliqués : pouvez-vous repérer le motif dans la séquence de nombres obtenue à partir des exemples précédents ? Pour 7 coupes, calculez d'abord la réponse pour 6 coupes, puis utilisez ce résultat.",
  "You might realise that there is a formula for obtaining the next number in the sequence from the previous one. You can see this by working out the number of new pieces created when you add an extra cut. For example, adding a fourth cut to 7 pieces obtained from 3 cuts adds 4 new pieces (11). Adding a fifth cut to this adds 5 new pieces (16). (Can you see why this is true in general when thinking about how we cross the existing cuts to create the most pieces?)": "Vous vous rendez peut-être compte qu'il existe une formule pour obtenir le numéro suivant dans la séquence à partir du précédent. Vous pouvez le voir en calculant le nombre de nouvelles pièces créées lorsque vous ajoutez une coupe supplémentaire. Par exemple, ajouter une quatrième coupe à 7 pièces obtenues à partir de 3 coupes ajoute 4 nouvelles pièces (11). L'ajout d'une cinquième coupe à cela ajoute 5 nouvelles pièces (16). (Pouvez-vous voir pourquoi cela est vrai en général en pensant à la façon dont nous croisons les coupes existantes pour créer le plus de pièces ?)",
  "So if C is the number of cuts and P(C) is the maximum number of pieces from C cuts, then the formula is:": "Donc si C est le nombre de coupes et P(C) est le nombre maximum de pièces de C coupes, alors la formule est :",
  "P(C + 1) = P(C) + C + 1": "P(C + 1) = P(C) + C + 1",
  "Therefore:\nP(6) = P(5) + 5 + 1 = 16 + 6 = 22\nP(7) = P(6) + 6 + 1 = 22 + 7 = 29": "Donc :\n P(6) = P(5) + 5 + 1 = 16 + 6 = 22 \nP(7) = P(6) + 6 + 1 = 22 + 7 = 29",
  "Can you work out the biggest number of pieces you can get with 99 cuts?": "Pouvez-vous calculer le plus grand nombre de pièces que vous pouvez obtenir avec 99 coupes ?",
  "We found the formula P(C + 1) = P(C) + C + 1 for the maximum number of pieces giving the cuts. However, this is not practical to use for the case of 99 cuts because we would first need to know the number of pieces for 98 cuts, and then the number of pieces for 97 cuts, and so on. You have to think how to get the explicit formula: P(C) = ½×C×(C + 1) + 1.": "Nous avons trouvé la formule P(C + 1) = P(C) + C + 1 pour le nombre maximum de pièces donnant les coupes. Cependant, ce n'est pas pratique à utiliser pour le cas de 99 coupes car il faudrait d'abord connaître le nombre de pièces pour 98 coupes, puis le nombre de pièces pour 97 coupes, et ainsi de suite. Vous devez penser comment obtenir la formule explicite : P(C) = ½×C×(C + 1) + 1.",
  "Either by intuition or by using the formula to work back from P(C) to P(1):\nP(C) = P(C - 1) + C - 1 + 1": "Soit par intuition, soit en utilisant la formule pour remonter de P(C) à P(1) : P(C) = P(C - 1) + C - 1 + 1",
  "= P(C - 1) + C": "= P(C - 1) + C",
  "= P(C - 2) + (C - 1) + C": "= P(C - 2) + (C - 1) + C",
  "= P(C - 3) + (C - 2) + (C - 1)  + C": "= P(C - 3) + (C - 2) + (C - 1)  + C",
  "…": "…",
  "= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C": "= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C",
  "= 2 + (2 + 3 + … + C)": "= 2 + (2 + 3 + … + C)",
  "= 1 + (1 + 2 + 3 + … + C)": "= 1 + (1 + 2 + 3 + … + C)",
  "= 1 + ½×C×(C + 1)": "= 1 + ½×C×(C + 1)",
  "The last step is obtained from what we know about triangular numbers.\nTherefore, P(99) = ½×99×100 = 4951.": "La dernière étape est obtenue à partir de ce que nous savons sur les nombres triangulaires. Par conséquent, P(99) = ½×99×100 = 4951.",
  "This problem is related to the number of regions (pieces of the cake) in a plane bounded by a generic configuration of lines (cuts). \"Generic\" means that there are no parallel lines and that no more than two lines intersect in the same points. This guarantees that the number of pieces of cake is maximal. Given C lines on a plane (in a generic configuration), then adding an extra line such that it intersects all the previous lines would create (C+1) new regions (around each intersection point of the new line with the previous ones, we add two new regions. However, one of the two is counted also in the next intersection point). This leads to P(C + 1) = P(C) + C + 1.": "Ce problème est lié au nombre de régions (morceaux du gâteau) dans un plan délimité par une configuration générique de lignes (coupes). \"Générique\" signifie qu'il n'y a pas de lignes parallèles et que pas plus de deux lignes se croisent aux mêmes points. Cela garantit que le nombre de parts de gâteau est maximal. Étant donné C lignes sur un plan (dans une configuration générique), puis ajouter une ligne supplémentaire telle qu'elle coupe toutes les lignes précédentes créerait (C + 1) nouvelles régions (autour de chaque point d'intersection de la nouvelle ligne avec les précédentes, nous ajouter deux nouvelles régions. Cependant, l'un des deux est également compté au point d'intersection suivant). Cela conduit à P(C + 1) = P(C) + C + 1."
}