{
  "Restaurant": "Restaurant",
  "At a restaurant each table has 3 legs, each chair has 4 legs and all the customers and the three members of staff have 2 legs each. There are four chairs at each table. Three quarters of the chairs are occupied by customers and there are 206 legs altogether in the restaurant. How many chairs does the restaurant have?": "Dans un restaurant, chaque table a 3 pieds, chaque chaise a 4 pieds et tous les clients et les trois membres du personnel ont 2 pieds chacun. Il y a quatre chaises à chaque table. Les trois quarts des chaises sont occupées par des clients et il y a 206 pieds au total dans le restaurant. Combien de chaises le restaurant a-t-il ?",
  "Can you work out how many legs there are at each table if three quarters of the chairs have people on them?": "Pouvez-vous déterminer combien de pieds il y a à chaque table si les trois quarts des chaises sont occupées par des personnes ?",
  "The three members of staff have six legs so take this off the total, giving 206 - 6 = 200. Now the tables, chairs and customers have 200 legs. On average, at each table there are 3 table legs, 16 chair legs and 6 customer legs (as only three quarters of the chairs are taken).This gives 3 + 16 + 6 = 25 legs per table. The number of tables is therefore 200 ∕ 25 = 8, hence the number of chairs is 8×4 = 32.": "Les trois membres du personnel ont six pattes, alors retirez cela du total, ce qui donne 206 - 6 = 200. Maintenant, les tables, les chaises et les clients ont 200 pattes. En moyenne, à chaque table il y a 3 pieds de table, 16 pieds de chaise et 6 pieds clients (puisque seulement les trois quarts des chaises sont prises). Cela donne 3 + 16 + 6 = 25 pieds par table. Le nombre de tables est donc 200 ∕ 25 = 8, donc le nombre de chaises est 8×4 = 32.",
  "This puzzle was originally a problem from a UKMT maths challenge": "Ce puzzle était à l'origine un problème d'un défi de mathématiques UKMT",
  "I have 30 coins. Some of the coins are 1¢, some are 2¢ and some are 6¢. The value of the 6¢ coins is worth the same amount as the total value of the 1¢ coins and the 2¢ coins combined. Given that I have a different number of each type of coin, what is the total value of all of the coins (in ¢)?": "J'ai 30 pièces. Certaines des pièces sont de 1 ¢, d'autres de 2 ¢ et d'autres de 6 ¢. La valeur des pièces de 6 ¢ vaut le même montant que la valeur totale des pièces de 1 ¢ et des pièces de 2 ¢ combinées. Étant donné que j'ai un nombre différent de chaque type de pièce, quelle est la valeur totale de toutes les pièces (en ¢) ?",
  "Start by considering how many 6¢ coins I could have...if I have too many, I won't be able to match their value with the 1¢ coins and the 2¢ coins.": "Commencez par considérer combien de pièces de 6 ¢ je pourrais avoir... si j'en ai trop, je ne pourrai pas faire correspondre leur valeur avec les pièces de 1 ¢ et les pièces de 2 ¢.",
  "First we suppose we have 8×6¢ coins, this has a value of 48¢, with 22 coins remaining. The target value is always a multiple of six and therefore even, so we will require an even number of 1¢ to make the even number. The largest even total among the rest of the coins is 20x2¢ + 2x1¢  = 42¢, which is less than 48¢.": "D'abord, nous supposons que nous avons des pièces de 8 × 6 ¢, cela a une valeur de 48 ¢, avec 22 pièces restantes. La valeur cible est toujours un multiple de six et donc paire, nous aurons donc besoin d'un nombre pair de 1 ¢ pour obtenir le nombre pair. Le plus grand total pair parmi le reste des pièces est de 20x2 ¢ + 2x1 ¢ = 42 ¢, soit moins de 48 ¢.",
  "So at most we can have 7×6¢ = 42¢, with 23 coins remaining. In this case the largest even total is  21x2¢ + 2x1¢  = 44¢. Our target was 42¢, thus we include more 1¢ coins, and fewer 2¢ coins. The next highest even total is 19x2¢ + 4x1¢  = 42¢, hitting our target.": "Donc, au plus, nous pouvons avoir 7 × 6 ¢ = 42 ¢, avec 23 pièces restantes. Dans ce cas, le total pair le plus élevé est 21x2 ¢ + 2x1 ¢ = 44 ¢. Notre objectif était de 42 ¢, donc nous incluons plus de pièces de 1 ¢ et moins de pièces de 2 ¢. Le total pair suivant le plus élevé est de 19x2 ¢ + 4x1 ¢ = 42 ¢, atteignant notre objectif.",
  "Therefore the total value of all coins is 7×6¢ + 19x2¢ + 4x1¢ = 84¢.": "Par conséquent, la valeur totale de toutes les pièces est de 7 × 6 ¢ + 19 x 2 ¢ + 4 x 1 ¢ = 84 ¢.",
  "For completeness, the smallest number of 6¢ coins is 5 (choosing 4 gives a total of  24¢ with 26 coins remaining). The solution with 5×6¢ is 5×2¢ and 10×1¢. The solution for 6×6¢ is 12×2¢ and 12×1¢. However neither of these solutions have a different amount of each coin.": "Pour être complet, le plus petit nombre de pièces de 6 ¢ est 5 (choisir 4 donne un total de 24 ¢ avec 26 pièces restantes). La solution avec 5×6¢ est 5×2¢ et 10×1¢. La solution pour 6 × 6 ¢ est 12 × 2 ¢ et 12 × 1 ¢. Cependant, aucune de ces solutions n'a une quantité différente de chaque pièce."
}