{
  "Scoring Goals": "Buts marqués",
  "In the final of a football cup the score was 5 - 2. In how many possible orders could the goals in the game be scored?": "Lors de la finale d'une coupe de football, le score était de 5 à 2. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ?",
  "Imagine the sequence of all goals and think about the positions in the sequence in which the second football team can have scored their 2 goals. Try to find the answer in the cases the score was 3 - 2 or 4 - 2.": "Imaginez la séquence de tous les buts et réfléchissez aux positions dans la séquence dans lesquelles la deuxième équipe de football peut avoir marqué ses 2 buts. Essayez de trouver la réponse dans les cas où le score était de 3 - 2 ou de 4 - 2.",
  "Imagine the score was only 3 - 2. Let us think about three goals scored by the first(home) team (HHH) and two goals scored by the second (away) team (AA). We could try and list the possibilities. e.g. AAHHH would represent the first two goals scored by the away team and then the next three goals scored by the home team. All the options for the five goals are : AAHHH, AHAHH, AHHAH, AHHHA, HAAHH, HAHAH, HAHHA, HHAAH, HHAHA, HHHAA. There are 10 options in total. A way to calculate this is to think about there being 5 options for one away goal: _ <em> _ </em> _ it could be in one of any of the 5 positions (e.g. A _ <em> _ </em>) . The other away goal could be in one of the remaining 4 positions. So you would think there would be 5×4 = 20 ways of choosing where the two goals would go.   However, we have double counted, because we have included every possibility (e.g. AAHHH) twice (one goal in position 1 and the other in position 2 but also the other way around). The order in which we selected the 2 goals of the second team does not matter: we need to divide by 2. So the answer if the score was 5 - 2 is 5×4 ∕ 2 = 10.": "Imaginez que le score n'était que de 3 à 2. Pensons à trois buts marqués par la première équipe (à domicile) (HHH) et deux buts marqués par la deuxième équipe (à l'extérieur) (AA). On pourrait essayer d'énumérer les possibilités. par exemple. AAHHH représenterait les deux premiers buts marqués par l'équipe à l'extérieur, puis les trois buts suivants marqués par l'équipe à domicile. Toutes les options pour les cinq buts sont : AAHHH, AHAHH, AHHAH, AHHHA, HAAHH, HAHAH, HAHHA, HHAAH, HHAHA, HHHAA. Il y a 10 options au total. Une façon de calculer cela est de penser qu'il y a 5 options pour un but à l'extérieur : _ <em> _ </em> _ il pourrait être dans l'une des 5 positions (par exemple A _ <em> _ </em >). L'autre but à l'extérieur pourrait être dans l'une des 4 positions restantes. On pourrait donc penser qu'il y aurait 5 × 4 = 20 façons de choisir où iraient les deux objectifs. Cependant, nous avons compté deux fois, car nous avons inclus chaque possibilité (par exemple AAHHH) deux fois (un but en position 1 et l'autre en position 2 mais aussi l'inverse). L'ordre dans lequel nous avons sélectionné les 2 buts de la deuxième équipe n'a pas d'importance : nous devons diviser par 2. Donc la réponse si le score était 5 - 2 est 5×4 ∕ 2 = 10.",
  "For the question of how many ways can the goals be scored if the score is 5 - 2, we can use the same logic. There are 7 possibilities to select the position for one goal; then there are 7 - 1 = 6 possibilities to select the position of the other goal (\"-1\" because one position has already been selected), therefore you get 7×6 = 42. However, the order in which you selected the 2 goals of the away team does not matter: you need to divide by 2. So we get 7×6 ∕ 2 = 21.": "Pour la question de combien de façons les buts peuvent-ils être marqués si le score est de 5 à 2, nous pouvons utiliser la même logique. Il y a 7 possibilités pour sélectionner la position pour un but ; alors il y a 7 - 1 = 6 possibilités pour sélectionner la position de l'autre but (\"-1\" car une position a déjà été sélectionnée), donc on obtient 7×6 = 42. Cependant, l'ordre dans lequel vous avez sélectionné les 2 buts de l'équipe visiteuse n'a pas d'importance : il faut diviser par 2. On obtient donc 7×6 ∕ 2 = 21.",
  "Combinatorics is an area of mathematics primarily concerned with counting. Two big aspects of combinatorics are finding combinations and permutations. For combinations the order does not matter - like in our football example we didn't mind which order the away team scored the goals. For permutations the order does matter - for example there are six ways to arrange the digits 123.": "La combinatoire est un domaine des mathématiques principalement concerné par le comptage. Deux grands aspects de la combinatoire sont la recherche de combinaisons et de permutations. Pour les combinaisons, l'ordre n'a pas d'importance - comme dans notre exemple de football, l'ordre dans lequel l'équipe à l'extérieur a marqué les buts ne nous dérangeait pas. Pour les permutations, l'ordre est important - par exemple, il existe six façons d'organiser les chiffres 123.",
  "In the final of a football cup the score was 6 - 2. In how many possible orders could the goals in the game be scored?": "Lors de la finale d'une coupe de football, le score était de 6 à 2. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ?",
  "Think about the strategy you used to answer the previous question and try to generalise it for any number of goals scored by the first team.": "Réfléchissez à la stratégie que vous avez utilisée pour répondre à la question précédente et essayez de la généraliser pour n'importe quel nombre de buts marqués par la première équipe.",
  "The answer is 8×7 ∕ 2=28": "La réponse est 8×7 ∕ 2=28",
  "This problem is equivalent to counting how many ways you select 2 objects (the positions of the two goals of the second team in the sequence above) from a total of n objects (the total number of positions of the goals). This is calculated by the number of <em>combinations</em> ⁿC₂=n! ∕ (2!×(n-2)!) = n×(n - 1) ∕ 2.": "Ce problème équivaut à compter le nombre de façons dont vous sélectionnez 2 objets (les positions des deux buts de la deuxième équipe dans la séquence ci-dessus) à partir d'un total de n objets (le nombre total de positions des buts). Ceci est calculé par le nombre de <em>combinaisons</em> ⁿC₂=n ! ∕ (2!×(n-2)!) = n×(n - 1) ∕ 2.",
  "In this formula n! = n×(n - 1)×(n - 2)×…×1": "Dans cette formule n! = n×(n - 1)×(n - 2)×…×1",
  "You can use this to come up with the formula generalising the reasoning in the previous part: there are n possibilities to select the position of the first goal of the second team; then there are (n - 1) possibilities to select the position of the second goal of the second team (\"-1\" because one position has already been selected), therefore you get n×(n-1). However, the order in which you selected the 2 positions for the two goals in the sequence does not matter: you need to divide by 2.": "Vous pouvez vous en servir pour trouver la formule généralisant le raisonnement de la partie précédente : il y a n possibilités pour sélectionner la position du premier but de la seconde équipe ; alors il y a (n - 1) possibilités pour sélectionner la position du deuxième but de la deuxième équipe (\"-1\" car onposition a déjà été sélectionnée), vous obtenez donc n×(n-1). Cependant, l'ordre dans lequel vous avez sélectionné les 2 positions pour les deux buts dans la séquence n'a pas d'importance : vous devez diviser par 2.",
  "In the final of a football cup the score was 4 - 3. In how many possible orders could the goals in the game be scored?": "Lors de la finale d'une coupe de football, le score était de 4 à 3. Dans combien d'ordres possibles les buts pouvaient-ils être marqués ?",
  "If we think about the sequence of 4 + 3 = 7 goals (G₁, G₂, G₃, G₄, G₅, G₆, and G₇), then the problem is equivalent to counting how many ways you select 3 objects (the positions of the three goals of the second team in the sequence above) from a total of 7 objects (the total number of positions of the goals). There are 7 possibilities to select the position for the first goal; then there are 7 - 1 = 6 possibilities to select the position of the second goal (\"-1\" because one position has already been selected); there are 7 - 2 = 5 possibilities to select the position of the third goal (\"-2\" because two positions have already been selected). Therefore you get 7×6×5 = 210. However, the order in which you selected the 3 goals of the second team does not matter: you need to divide by the number of ways you can order the 3 goals. You have 3 ways of picking the first goal; then you have 3 - 1 = 2 ways to pick the second (\"-1\" because one goal has already been selected); there are 3 - 2 = 1 possibilities to select the third goal (\"-2\" because two goals have already been selected); therefore you get 3×2×1 = 6 ways you can order 3 goals. Finally, you can find the result by doing: 210 ∕ 6 = 35.": "Si nous pensons à la séquence de 4 + 3 = 7 buts (G₁, G₂, G₃, G₄, G₅, G₆ et G₇), alors le problème équivaut à compter combien de façons vous sélectionnez 3 objets (les positions des trois buts de la deuxième équipe dans la séquence ci-dessus) à partir d'un total de 7 objets (le nombre total de positions deles buts). Il y a 7 possibilités pour sélectionner la position du premier but ; alors il y a 7 - 1 = 6 possibilités pour sélectionner la position du second but (\"-1\" car une position a déjà été sélectionnée) ; il y a 7 - 2 = 5 possibilités pour sélectionner la position du troisième but (\"-2\" car deuxpostes ont déjà été sélectionnés). Vous obtenez donc 7×6×5 = 210. Cependant, l'ordre dans lequel vous avez sélectionné les 3 buts de la deuxième équipe n'a pas d'importance : vous devez diviser par le nombre de façons dont vous pouvez ordonner les 3 buts. Vous avez 3 façons de choisir le premier objectif ; alors vous avez 3 - 1 = 2 façons de choisir le second (\"-1\" car un objectif a déjà été sélectionné) ; il y a 3 - 2 = 1 possibilités pour sélectionner le troisième objectif (\"-2\" car deux objectifs ont déjà été sélectionnés) ; donc vous obtenez 3 × 2 × 1 = 6 façons de pouvoircommander 3 buts. Enfin, vous pouvez trouver le résultat en faisant : 210 ∕ 6 = 35.",
  "35 is the answer to rearranging HHHHAAA, whereas 210 would be the answer to rearranging HHHHA₁A₂A₃.": "35 est la réponse au réarrangement HHHHAAA, tandis que 210 serait la réponse au réarrangement HHHHA₁A₂A₃."
}