{
  "Bar Stools": "Bar Stools",
  "How many different ways can you arrange teachers and students in a row of 5 chairs such that no 2 teachers are sat next to each other?": "How many different ways can you arrange teachers and students in a row of 5 chairs such that no 2 teachers are sat next to each other?",
  "You could have five students sitting on the five chairs. You could have two teachers sitting on chairs number 2 and 4 and students in chairs 1, 3, and 5. Can you think of any other options? Can you think of the maximum number of teachers that could sit on the chairs? You might like to start with a smaller number of chairs and work your way up.": "You could have five students sitting on the five chairs. You could have two teachers sitting on chairs number 2 and 4 and students in chairs 1, 3, and 5. Can you think of any other options? Can you think of the maximum number of teachers that could sit on the chairs? You might like to start with a smaller number of chairs and work your way up.",
  "Think of chairs as having a teacher (x) or a student (o).": "Think of chairs as having a teacher (x) or a student (o).",
  "For 5 chairs we can have": "Ku ntebe 5 twagira",
  "ooooo, xoooo, oxooo, ooxoo, oooxo, oooox, xoxoo, xooxo, xooox, oxoxo, oxoox, ooxox, xoxox": "ooooo, xoooo, oxooo, ooxoo, oooxo, oooox, xoxoo, xooxo, xooox, oxoxo, oxoox, ooxox, xoxox",
  "Total = 13": "Igiteranyo = 13",
  "There is a way we can build up to this solution by thinking about the answer if there was 1 chair, 2 chairs, 3 chairs etc.": "Hari uburyo twakubaka iki gisubizo mu gutekereza uko igisubizo cyaba kimeze iyaba hari intebe 1, intebe 2, intebe 3 nibind.",
  "1 chair has 2 options: x , o": "Intebe 1 ifite uburyo 2; X, O",
  "2 chairs has 3 options: ox, oo, xo": "intebe 2 zifite uburyo 3: ox, oo, xo",
  "3 chairs has 5 options: oox, ooo, oxo, xox, xoo": "Intebe 3 zifite uburyo 5: oox, ooo, oxo, xox, xoo",
  "Each time you add a chair you can generate the new options by simply adding a student to the start of all the previous options. You can also add a teacher and then a student to all of the options from two chairs ago. Let's see this with 4 chairs:": "Buri gihe uteranije intebe ushobora kurema ubundi buryo mukongeraho umunyeshuri kuntangiriro yuburyo twari dufte bwose mbere. Ushobora nanone kongeraho mwarimu ubund umunyeshuri ku buryo bwose bwakozwe muntebe ebyiri zabanje. Reka turebe dufite intebe 4:",
  "Add o onto all the 3 chair options gives:": "Ushyize o muburyo bwose intebe 3 zakoze biduha:",
  "ooox, oooo, ooxo, oxox, oxoo": "ooox, oooo, ooxo, oxox, oxoo",
  "And adding xo onto all the 2 chair options gives:": "Noneho guteranyaho /gushyiramo xo mu buryo bwose ku ntebe 2 biduha:",
  "xoox, xooo, xoxo": "xoox, xooo, xoxo",
  "This gives 5 + 3 = 8 options in total.": "Ibi bitanga 5+3= 8 uburyo bwose hamwe.",
  "For the 5 chairs we can add o onto all the 4 chairs options and and xo onto all the 3 chair options which gives 8 + 5 = 13 as before.": "Ku ntebe 5 dushobora kongera o muburyo bwakozwe kuntebe 4 nanone tukongera xo mu buryo bwose bwakozwe kuntebe 3 aribyo bizaduha 8+5=13 nkambere.",
  "The sequence of numbers in this puzzle are part of the Fibonacci Sequence sequence:": "Uruhererekane rw' imibare muri iri hurizo nibice by' uruhererekane bita Fibonacci:",
  "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... It is easy to find the next number by adding the previous two numbers, but you can also find the nᵗʰ Fibonacci number in the sequence directly using this formula:": "0, 1, 1, 2, 3, 5, 8, 13, 21, 34,... Biroroshye kumenya umubare ukurikiyeho duteranije imibare ibiri iwubanziriza, ariko ushobora kubona umubare winshuro n za fibonacci muruhererekane duhise dukoresha iyi forumire:",
  "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )": "LaTeX Start $$F_n = \\frac{1}{\\sqrt{5}}\\left[ \\left(\\frac{1+\\sqrt{5}}{2}\\right)^{n+1} - \\left(\\frac{1-\\sqrt{5}}{2}\\right)^{n+1}\\right]$$ LaTeX End  Fₙ = (1 ∕ √5)×( ((1 + √5) ∕ 2)ⁿ⁺¹ - ((1 - √5) ∕ 2)ⁿ⁺¹ )",
  "How many different ways can you arrange teachers and students in a row of 10 chairs such that no 2 teachers are sat next to each other?": "Nuburyo butandukanye bungahe twashyira abarimu n' abanyeshuri ku murongo w' intebe 10 ariko abarimu 2 bakicara begeranye?",
  "Try and build up the answer from a smaller number of chairs.": "Gerageza kubaka igisubizo uhereye kumubare muto w' intebe.",
  "We had already found the following sequence for 1 chair, 2 chairs, 3 chairs , …": "Twamaze kubona uruhererekane rukurikira ku ntebe 1, intebe 2, intebe 3, …",
  "2, 3, 5, 8, 13": "2, 3, 5, 8, 13",
  "Each term in the sequence can be found by adding the two previous terms. We can carry it on:": "Buri gake kagize urukurikirane kaboneka duteranije uuduce tubiri tukabanziriiza. Twakomeza:",
  "2, 3, 5, 8, 13, 21, 34, 55, 89, 144": "2, 3, 5, 8, 13, 21, 34, 55, 89, 144",
  "So there are 144 ways to have people sitting on the 10 chairs.": "Rero hari uburyo 144 bwo kugira abantu bicaye kuntebe 10.",
  "For all the number of chairs between 1 and 30 inclusive, how many of these will have an even number of ways of sitting on them?": "Kumubare wose wintebe twafata hagati ya 1 na 30, nuwuhe mubare twafata kugira tugire uburyo bugabanyika na kabiri bwuko abantu bazicaraho?",
  "For the sequence 2,3,5,8,13, … we can see that there is a pattern even, odd, odd, even, odd odd, etc. This makes sense as even + odd = odd and odd + odd = even. So every third number in the sequence is even. We need to do 30 ∕ 3 = 10.": "Kuruhererekane2, 3, 5, 8, 13,... turabonako hari uruhererekane rwimibare igabanyika na kabiri, igabanyika itagabanyika na 2, , byisubiramo..., Ibi bigira igisonuro niba umubare ugabanyika na 2+ umubare utagabanyika na 2, kand nabwo imibare ibiri itagabanyika na kabiri uyiteranije iguha umubare ugabanyika na 2. rero buri mubare wagatatu mu ruhererekane ugabanyika na 2. Dukeneye gukorera 30/3=10."
}